{"disease": "breast and ovarian cancer", "core_genes": ["BRCA1", "homologous recombination repair", "PARP inhibitor resistance"], "hypotheses": ["Upregulation of RAD51 in BRCA1-deficient cancer cells, facilitated by dysregulated post-translational modifications or altered chromatin remodeling factors, drives homologous recombination restoration and PARP inhibitor resistance, suggesting targeting RAD51 regulatory pathways could overcome therapeutic escape."]}
{"disease": "cancer (wild-type p53)", "core_genes": ["p53", "MDM2"], "hypotheses": ["Pharmacologic inhibition of MDM2 in wild-type p53 tumors, when combined with targeting metabolic pathways that regulate NAD+ availability, synergistically enhances p53-mediated apoptosis by promoting transcription of pro-apoptotic genes and overcoming metabolic resistance in the tumor microenvironment."]}
{"disease": "colorectal cancer", "core_genes": ["KRAS G12C"], "hypotheses": ["KRAS G12C mutation enhances PI3K-mediated suppression of apoptosis via BCL-XL upregulation in colorectal cancer, and this effect can be validated in vivo using patient-derived xenograft models treated with targeted KRAS or PI3K pathway inhibitors."]}
{"disease": "cancer", "core_genes": ["EGFR L858R", "tyrosine kinase inhibitor sensitivity"], "hypotheses": ["EGFR L858R-mediated PI3K-AKT signaling not only upregulates BCL2 but also induces MCL1 stabilization, together creating a redundant anti-apoptotic network that synergistically promotes resistance to tyrosine kinase inhibitors in cancer cells."]}
{"disease": "cancer immune escape", "core_genes": ["PD-L1", "JAK-STAT"], "hypotheses": ["Selective inhibition of JAK-STAT signaling in tumor-associated macrophages using small-molecule inhibitors or macrophage-specific genetic knockdown reduces PD-L1 expression and synergistically enhances T cell-mediated cytotoxicity within the tumor microenvironment."]}
{"disease": "gastric cancer", "core_genes": ["HER2", "trastuzumab resistance"], "hypotheses": ["Upregulation of MET signaling promotes trastuzumab resistance in HER2-positive gastric cancer cells by inducing crosstalk with the FGFR pathway, creating a compensatory loop that sustains PI3K/AKT activation even when HER2 is inhibited."]}
{"disease": "B-cell malignancy", "core_genes": ["CD19", "CAR-T cell", "cytokine release syndrome biomarkers"], "hypotheses": ["Dual inhibition of IL-6 and GM-CSF signaling during CD19 CAR-T cell therapy synergistically reduces cytokine release syndrome severity while preserving, or potentially enhancing, anti-tumor cytotoxicity through improved control of myeloid-driven inflammation without impairing CAR-T effector function."]}
{"disease": "glioblastoma", "core_genes": ["VEGF-A", "VEGFR2"], "hypotheses": ["Inhibition of VEGFR2 signaling in endothelial cells reduces secretion of immunosuppressive molecules such as TGF-β and PD-L1, thereby reversing immune evasion and promoting cytotoxic lymphocyte infiltration into glioblastoma tumors."]}
{"disease": "cancer-associated fibroblasts", "core_genes": ["TNF-α", "NF-κB"], "hypotheses": ["TNF-Α–induced NF-ΚB activation in cancer-associated fibroblasts elevates matrix metalloproteinase expression and, through upregulation of immunosuppressive chemokines, synergistically promotes epithelial-to-mesenchymal transition and tumor cell invasion by coordinating extracellular matrix remodeling with local immune suppression."]}
{"disease": "PI3K/PTEN-deficient tumors", "core_genes": ["mTOR complex 1", "hyperactivation"], "hypotheses": ["In PI3K/PTEN-deficient tumors, hyperactive mTORC1 inhibits autophagic degradation of specific oncogenic substrates such as c-Myc, resulting in their accumulation, which in turn amplifies metabolic reprogramming and drives proliferation via enhanced mitochondrial biogenesis and anabolic signaling."]}
{"disease": "Parkinson's disease", "core_genes": ["LRRK2 G2019S", "mitochondrial dynamics"], "hypotheses": ["Pharmacological inhibition of LRRK2 G2019S may restore mitochondrial fusion and enhance mitophagy in Parkinson’s disease by modulating the activity of dynamin-related protein 1 (Drp1) and PINK1/Parkin signaling, thereby protecting dopaminergic neurons from degeneration."]}
{"disease": "Parkinson's disease", "core_genes": ["α-synuclein A53T", "aggregation", "neuroinflammation"], "hypotheses": ["Inhibiting microglial NLRP3 inflammasome activation disrupts the A53T α-synuclein-induced feedback loop by reducing mitochondrial ROS production, thereby dampening NF-κB-mediated cytokine release and preventing propagation of neurotoxic aggregates in Parkinson’s disease models."]}
{"disease": "Alzheimer's disease", "core_genes": ["APOE4", "amyloid-β clearance"], "hypotheses": ["APOE4 expression in microglia disrupts lysosomal biogenesis and impairs endolysosomal trafficking, leading to spatially localized deficits in amyloid-β clearance and heightened neuroinflammation, which can be detected in vivo by advanced imaging in APOE4+ Alzheimer’s disease patient brains."]}
{"disease": "frontotemporal dementia", "core_genes": ["Tau R406W"], "hypotheses": ["The TAU R406W mutation induces mitochondrial dysfunction in neurons, leading to increased release of DAMPs that activate microglial NLRP3 inflammasome, thereby intensifying neuroinflammation and accelerating neuronal degeneration in frontotemporal dementia."]}
{"disease": "Alzheimer's disease", "core_genes": ["TREM2", "microglia", "neuroinflammation"], "hypotheses": ["Activation of TREM2 not only boosts microglial phagocytosis but may also upregulate specific lipid metabolism pathways, thereby facilitating amyloid-β clearance via metabolic reprogramming and modulating crosstalk with astrocytes to further suppress neuroinflammation in Alzheimer’s disease."]}
{"disease": "Lewy body diseases", "core_genes": ["GBA1", "lysosomal dysfunction"], "hypotheses": ["Pharmacological activation of glucocerebrosidase stimulates autophagic α-synuclein clearance and suppresses neuroinflammation in Lewy body disease by promoting lysosomal restoration, thus reducing oxidative stress and modulating microglial activation through improved neuronal protein homeostasis."]}
{"disease": "amyotrophic lateral sclerosis (ALS)", "core_genes": ["NEFL", "axonal degeneration"], "hypotheses": ["Upregulation of NEFL in motor neurons may suppress axonal degeneration in ALS not only by stabilizing neurofilaments but also by modulating local axonal signaling pathways, such as attenuating stress kinase activation or enhancing neurotrophic signaling, thereby amplifying cytoskeletal resilience and neuroprotection."]}
{"disease": "Parkinson's disease", "core_genes": ["c-Abl kinase", "dopaminergic neuronal death"], "hypotheses": ["Inhibition of c-Abl kinase enhances mitochondrial resilience in Parkinson’s disease by upregulating mitophagy via modulation of parkin-independent pathways, such as PINK1 stabilization or increased expression of alternative E3 ubiquitin ligases, thereby offering novel neuroprotection against dopaminergic neuronal death."]}
{"disease": "neurodegeneration", "core_genes": ["CLOCK gene", "circadian rhythm"], "hypotheses": ["Dysregulation of the CLOCK gene in neurons disrupts autophagy by impairing circadian control of key autophagy-related gene expression, which in turn intensifies oxidative stress and promotes toxic protein aggregate buildup, thereby accelerating neurodegenerative progression."]}
{"disease": "multiple sclerosis", "core_genes": ["neurofilament light chain (NFL)"], "hypotheses": ["Enhancement of microglial phagocytic activity via upregulation of TREM2 signaling reduces neurofilament light chain (NFL) release by promoting efficient clearance of axonal debris and dampening inflammatory cytokine production during acute multiple sclerosis lesions."]}
{"disease": "metabolic syndrome", "core_genes": ["GLP-1 receptor agonist", "AMPK signaling"], "hypotheses": ["GLP-1 receptor agonist treatment activates hepatic AMPK, which in turn elevates hepatic FGF21 production, enabling an endocrine feedback loop that enhances peripheral lipid utilization and further reduces hepatic steatosis in individuals with metabolic syndrome."]}
{"disease": "diabetic cardiomyopathy", "core_genes": ["SGLT2 inhibitor", "ketogenesis"], "hypotheses": ["SGLT2 inhibitor-induced ketogenesis elevates cardiac NAD+/NADH ratio, which in turn activates SIRT3-mediated deacetylation of mitochondrial antioxidant enzymes, thereby amplifying oxidative stress suppression and improving myocardial function in diabetic cardiomyopathy."]}
{"disease": "obesity-induced insulin resistance", "core_genes": ["GIP receptor", "GLP-1"], "hypotheses": ["Chronic GLP-1 receptor activation reduces obesity-induced adipose inflammation and enhances insulin sensitivity by driving AMPK-mediated suppression of NLRP3 inflammasome activation and downregulating pro-inflammatory cytokine expression in adipocytes."]}
{"disease": "metabolic syndrome", "core_genes": ["UCP1", "brown adipose tissue", "thermogenesis"], "hypotheses": ["Pharmacological activation of UCP1 in brown adipose tissue enhances insulin sensitivity in metabolic syndrome by promoting thermogenic energy expenditure and triggering FGF21 secretion, which synergistically improves glucose uptake and modulates hepatic lipid metabolism."]}
{"disease": "type 2 diabetes", "core_genes": ["IRS-1", "serine phosphorylation"], "hypotheses": ["Inhibition of the atypical kinase NLK, potentially activated by hyperglycemia-induced mitochondrial stress, reduces IRS-1 serine phosphorylation and uniquely enhances insulin signaling and glucose uptake in skeletal muscle cells in type 2 diabetes."]}
{"disease": "congenital leptin deficiency", "core_genes": ["LEPR gene"], "hypotheses": ["Restoring LEPR signaling in hypothalamic neurons not only suppresses hyperphagia but may also reprogram neuroendocrine circuits to enhance peripheral immune function in congenital leptin deficiency, unveiling a potential link between energy homeostasis and immune modulation."]}
{"disease": "congenital hypothyroidism", "core_genes": ["TPO gene"], "hypotheses": ["Loss-of-function mutations in the TPO gene may alter interactions with oxidative stress response proteins, such as DUOX2 or SOD1, thereby modulating the severity and clinical variability of congenital hypothyroidism beyond impaired hormone synthesis alone."]}
{"disease": "hepatic glucose production", "core_genes": ["GCGR antagonism"], "hypotheses": ["GCGR antagonism not only suppresses hepatic PEPCK expression but also modulates hepatic lipid metabolism via downregulation of SREBP-1c, suggesting a dual mechanism for improving both glucose and lipid profiles in metabolic disease."]}
{"disease": "medium-chain acyl-CoA dehydrogenase disorders", "core_genes": ["ACADM deficiency"], "hypotheses": ["Pharmacological PPARα activation in ACADM-deficient hepatocytes induces compensatory upregulation of peroxisomal and mitochondrial alternative fatty acid oxidation enzymes, thereby enhancing non-MCAD-mediated fatty acid catabolism and attenuating toxic medium-chain acylcarnitine accumulation under metabolic stress."]}
{"disease": "mitochondrial diabetes", "core_genes": ["TFAM gene"], "hypotheses": ["Reduced TFAM expression in pancreatic β-cells disrupts mitochondrial biogenesis and may dysregulate Ca2+ signaling pathways, compounding insulin secretion defects and accelerating mitochondrial diabetes onset beyond effects attributed solely to impaired ATP production."]}
{"disease": "familial hypercholesterolemia", "core_genes": ["PCSK9 inhibition", "LDL receptor recycling"], "hypotheses": ["In familial hypercholesterolemia, PCSK9 inhibition-driven LDL receptor recycling not only reduces hepatic lipid accumulation but also attenuates NLRP3 inflammasome activation by lowering intracellular cholesterol, thereby decreasing downstream IL-1β-mediated hepatic inflammation."]}
{"disease": "atherosclerosis", "core_genes": ["NLRP3 inflammasome", "plaque formation"], "hypotheses": ["Targeted inhibition of NLRP3 inflammasome-driven metabolic reprogramming in vascular macrophages, specifically by modulating mitochondrial reactive oxygen species and glycolytic flux, will not only suppress IL-1β production but also induce a reparative macrophage phenotype, thereby stabilizing atherosclerotic plaques beyond reducing lipid accumulation."]}
{"disease": "cardiac fibrosis and heart failure", "core_genes": ["TGF-β1 signaling"], "hypotheses": ["Targeting the interaction between TGF-β1/Smad3 signaling and Hippo-YAP pathway activity could synergistically inhibit myofibroblast differentiation and extracellular matrix accumulation, providing a novel approach to attenuate cardiac fibrosis in heart failure."]}
{"disease": "vascular aging", "core_genes": ["eNOS uncoupling", "endothelial dysfunction"], "hypotheses": ["Targeting the mitochondrial SIRT3–eNOS axis with specific SIRT3 activators may prevent eNOS uncoupling, thereby reducing vascular inflammation and arterial stiffness during aging through a novel modulation of endothelial mitochondrial metabolism and nitric oxide signaling."]}
{"disease": "heart failure with preserved ejection fraction", "core_genes": ["BNP elevation"], "hypotheses": ["Persistent BNP elevation in HFpEF may dysregulate cardiac fibroblast autocrine signaling, altering matrix metalloproteinase expression and indirectly enhancing extracellular matrix deposition, thereby exacerbating myocardial stiffness and diastolic dysfunction beyond BNP’s canonical hemodynamic effects."]}
{"disease": "cardiomyocyte regeneration", "core_genes": ["GATA4 transcription factor"], "hypotheses": ["Overexpression of GATA4 activates a regulatory axis involving YAP/TAZ co-activators that synergistically upregulate cyclin D1, thereby enhancing cardiomyocyte cell cycle re-entry and regeneration after myocardial injury."]}
{"disease": "vascular smooth muscle cell proliferation", "core_genes": ["PDGF-BB signaling"], "hypotheses": ["PDGF-BB signaling synergistically activates both STAT and PI3K/Akt pathways to induce MMP-9 expression, which not only promotes VSMC proliferation but also enhances extracellular matrix remodeling, collectively accelerating neointimal hyperplasia in vascular disease."]}
{"disease": "vascular calcification", "core_genes": ["Runx2 transcription factor"], "hypotheses": ["RUNX2 activation in vascular smooth muscle cells, under metabolic stress, upregulates BMP2 and concurrently suppresses specific microRNAs that normally inhibit osteogenic gene expression, synergistically accelerating vascular calcification via both transcriptional and post-transcriptional mechanisms."]}
{"disease": "hypertension-induced cardiac remodeling", "core_genes": ["ACE2", "Ang-(1-7) axis"], "hypotheses": ["Upregulation of ACE2 enhances Ang-(1-7)-Mas receptor signaling, which not only suppresses cardiac fibroblast activation but also disrupts TGF-β/Smad cross-talk with inflammatory pathways, thereby synergistically inhibiting collagen deposition during hypertension-induced cardiac remodeling."]}
{"disease": "cardiac metabolic reprogramming", "core_genes": ["SIRT1 deacetylase activity"], "hypotheses": ["SIRT1 deacetylase activity suppresses NF-κB-driven inflammation and simultaneously enhances PGC-1α-mediated mitochondrial biogenesis, collaboratively reprogramming energy metabolism in stressed cardiomyocytes to prevent maladaptive remodeling unique to cardiac tissue."]}
{"disease": "regulatory T cell dysfunction", "core_genes": ["FOXP3 expression stability"], "hypotheses": ["Inhibition of IL-6 signaling stabilizes FOXP3 expression in regulatory T cells by upregulating the less-characterized Eos (Ikzf4) transcription factor, thereby reinforcing Treg lineage commitment and preventing their transdifferentiation into pro-inflammatory effector cells."]}
{"disease": "systemic lupus erythematosus", "core_genes": ["IRF7", "type I interferon signaling"], "hypotheses": ["Pharmacologic inhibition of IRF7 not only suppresses type I interferon signaling but also disrupts IRF7-driven metabolic reprogramming in dendritic cells, thereby limiting their pro-inflammatory capacity and further reducing autoreactive lymphocyte activation in systemic lupus erythematosus."]}
{"disease": "Th17 cell differentiation", "core_genes": ["RORγt transcription factor"], "hypotheses": ["Targeted inhibition of RORγt acetylation using genetic knock-in of acetylation-deficient mutants or small-molecule bromodomain inhibitors during in vitro Th17 differentiation will specifically reduce IL-17A expression and may confer resistance to Th17-driven autoimmunity in established murine disease models."]}
{"disease": "B cell tolerance breakdown", "core_genes": ["CD20 expression loss"], "hypotheses": ["Loss of CD20 expression enables autoreactive B cells to evade depletion and may promote their persistence by altering the balance of survival signaling—potentially through enhanced resistance to FcγRIIb-mediated apoptosis—thus contributing to the breakdown of peripheral B cell tolerance in autoimmunity."]}
{"disease": "rheumatoid arthritis", "core_genes": ["C5aR1 complement receptor"], "hypotheses": ["Pharmacological inhibition of C5AR1 signaling disrupts cross-talk between synovial fibroblasts and infiltrating macrophages via suppression of the NF-κB pathway, leading to reduced cytokine production and attenuated joint inflammation in rheumatoid arthritis."]}
{"disease": "autoinflammatory disease pathogenesis", "core_genes": ["NLRP3 inflammasome priming"], "hypotheses": ["Selective inhibition of NF-κB–induced priming in conjunction with targeting metabolic modulators such as mitochondrial ROS may synergistically suppress NLRP3-driven IL-1β overproduction and resolve chronic inflammation in autoinflammatory disease models more effectively than NF-κB inhibition alone."]}
{"disease": "tissue-resident memory T cells", "core_genes": ["CD69 expression"], "hypotheses": ["Upregulation of CD69 on tissue-resident memory T cells not only suppresses S1PR1-mediated egress but also enhances rapid effector responses by modulating local cytokine production through cross-talk with tissue-derived signals such as TGF-β or alarmins during pathogen challenge."]}
{"disease": "autoimmune polyglandular syndrome", "core_genes": ["AIRE gene mutations"], "hypotheses": ["Restoring AIRE function in medullary thymic epithelial cells, in combination with modulation of novel AIRE-interacting cofactors such as FEZF2 or candidate epigenetic regulators, synergistically enhances central tolerance and may more effectively prevent multi-organ autoimmunity in autoimmune polyglandular syndrome than AIRE restoration alone."]}
{"disease": "autoimmune disease susceptibility", "core_genes": ["CTLA-4 polymorphisms"], "hypotheses": ["CTLA-4 polymorphisms that reduce protein expression disrupt Treg-mediated suppression, leading to excess CD80/CD86 signaling through CD28, which enhances STAT3 activation in CD4+ T cells and drives IL-17A upregulation and Th17-mediated autoimmune pathology."]}
{"disease": "microbiome-mediated immune development", "core_genes": ["TLR4 signaling"], "hypotheses": ["Enhanced production of short-chain fatty acids by commensal microbiota not only suppresses TLR4 signaling in neonatal macrophages but also shifts cytokine profiles toward regulatory phenotypes, fostering immune tolerance and balanced maturation of both innate and adaptive immunity during early development."]}
{"disease": "carbapenem resistance", "core_genes": ["NDM-1 metallo-β-lactamase"], "hypotheses": ["Modulating bacterial zinc uptake systems or exploiting host-induced zinc deprivation, in combination with targeted chelators, will synergistically suppress NDM-1 activity and restore carbapenem efficacy in NDM-1-positive Gram-negative pathogens."]}
{"disease": "COVID-19", "core_genes": ["SARS-CoV-2 spike protein D614G", "viral fitness"], "hypotheses": ["The D614G mutation in the SARS-CoV-2 spike protein may enhance viral transmission by not only increasing ACE2-mediated entry but also modulating spike interactions with mucosal immune factors, potentially facilitating immune evasion during early infection in respiratory epithelial tissues."]}
{"disease": "tuberculosis", "core_genes": ["ESX-1 secretion system", "Mycobacterium tuberculosis virulence"], "hypotheses": ["Inhibition of ESX-1 not only blocks ESAT-6-mediated phagosomal disruption but may also enhance host autophagy and type I interferon responses, synergistically reducing Mycobacterium tuberculosis virulence and shifting the macrophage immune environment toward bacterial clearance."]}
{"disease": "azole-resistant Aspergillus fumigatus", "core_genes": ["CYP51A gene mutations"], "hypotheses": ["Overexpression of CYP51A in Aspergillus fumigatus may trigger upregulation of ERG3 and ERG6, facilitating alternative ergosterol biosynthetic routes and potentially promoting cell wall remodeling to synergistically enhance azole resistance and fungal survival."]}
{"disease": "influenza", "core_genes": ["memory B cell", "BCR affinity maturation"], "hypotheses": ["During influenza infection, the interaction between viral neuraminidase and germinal center B cells may upregulate AID activity via a sialic acid–dependent signaling pathway, enhancing BCR affinity maturation and biasing memory B cell repertoires towards neuraminidase-specific high-affinity clones."]}
{"disease": "bacterial biofilm formation", "core_genes": ["FtsZ protein inhibition"], "hypotheses": ["FtsZ protein inhibition triggers localized cell lysis and matrix remodeling within mature biofilms, activating dispersal-promoting signaling pathways that synergize with antibiotics to enhance biofilm eradication."]}
{"disease": "hepatitis B virus drug resistance", "core_genes": ["HBV polymerase L180M", "entecavir resistance"], "hypotheses": ["The HBV polymerase L180M mutation enhances Hsp90 recruitment and stabilization in patient-derived HBV isolates, and disrupting this interaction with Hsp90 inhibitors may restore entecavir sensitivity and suppress resistant viral replication in chronic hepatitis B in vivo."]}
{"disease": "chronic viral infections", "core_genes": ["CD8+ T cell exhaustion markers"], "hypotheses": ["Upregulation of TOX in CD8+ T cells enhances NFAT-driven transcriptional networks that not only induce PD-1 and TIGIT but also suppress IL-2 and IFN-γ production, thereby reinforcing T cell exhaustion and facilitating viral persistence during chronic infection."]}
{"disease": "malaria", "core_genes": ["PfEMP1 protein", "Plasmodium falciparum immune evasion"], "hypotheses": ["Plasmodium falciparum infection may trigger a cascade in which PfEMP1 engagement of ICAM-1 activates endothelial NF-κB signaling, amplifying local inflammatory cytokine release and upregulating additional endothelial receptors, thereby creating a positive feedback loop that further intensifies microvascular sequestration and cerebral malaria risk."]}
{"disease": "bacteriophage host specificity", "core_genes": ["phage tail fibers"], "hypotheses": ["Distinct modular recombination events in phage tail fiber genes may facilitate host range expansion by generating novel domain architectures that target previously unrecognized bacterial membrane proteins, potentially enabling rapid adaptation to emerging bacterial strains with altered surface epitopes."]}
{"disease": "cellular senescence", "core_genes": ["p16INK4a expression"], "hypotheses": ["Upregulation of p16INK4A in senescent cells promotes SASP-driven inflammation and tissue remodeling by fostering metabolic reprogramming that increases mitochondrial ROS production, which in turn amplifies pro-inflammatory cytokine signaling and may establish a feed-forward loop accelerating tissue aging."]}
{"disease": "telomere maintenance disorders", "core_genes": ["TERT promoter mutations"], "hypotheses": ["TERT promoter mutations synergize with MYC to upregulate telomerase in vivo, driving clonal expansion and tumorigenesis in telomere maintenance disorder models, with murine xenograft systems enabling direct assessment of this axis in tissue regeneration and malignancy development."]}
{"disease": "mitochondrial quality control", "core_genes": ["PINK1", "Parkin pathway"], "hypotheses": ["Activation of PINK1 not only drives PARKIN-mediated ubiquitination of VDAC1 but may also recruit unconventional autophagy adaptors, such as NDP52 or OPTN, amplifying mitophagy efficiency and conferring heightened resistance to oxidative stress in dopaminergic neurons."]}
{"disease": "inflammaging", "core_genes": ["SASP factor", "IL-6 secretion"], "hypotheses": ["Dual inhibition of IL-6 and the less-studied SASP factor GDF15 in senescent cells synergistically disrupts the feed-forward loop of inflammaging, potentially reprogramming immune surveillance and enhancing tissue regeneration in aging organisms beyond effects seen with IL-6 inhibition alone."]}
{"disease": "epigenetic aging", "core_genes": ["EPAS1 gene methylation"], "hypotheses": ["Hypermethylation of the EPAS1 promoter in vascular endothelial cells suppresses HIF-2α expression, which not only accelerates epigenetic aging but may also amplify oxidative stress–induced senescence by disrupting adaptive hypoxic signaling pathways."]}
{"disease": "mitochondrial aging", "core_genes": ["SIRT3 deacetylase activity"], "hypotheses": ["Enhancing SIRT3 deacetylase activity in aged animal models will restore mitochondrial metabolic efficiency, thereby reducing ROS-driven NLRP3 inflammasome activation and cellular senescence, and potentially reversing functional phenotypes of mitochondrial aging in vivo."]}
{"disease": "stem cell senescence", "core_genes": ["LIN28A expression"], "hypotheses": ["Overexpression of LIN28A in adult human mesenchymal stem cells not only suppresses let-7-mediated p16INK4a induction but may also enhance resistance to stress-induced senescence by modulating additional let-7 targets involved in DNA repair and metabolic homeostasis."]}
{"disease": "DNA damage response aging", "core_genes": ["ATM kinase activation"], "hypotheses": ["Pharmacological inhibition of ATM kinase during chronic DNA damage not only reduces SASP expression in aging fibroblasts but may also attenuate tissue dysfunction and delay onset of age-associated diseases in vivo by modulating senescence-driven inflammation."]}
{"disease": "progeria syndrome", "core_genes": ["LMNA mutations"], "hypotheses": ["Progerin accumulation suppresses SIRT1-mediated deacetylation of specific histone residues, leading to persistent DNA repair defects and chromatin mislocalization, which together amplify vascular dysfunction and cellular senescence in Hutchinson-Gilford progeria syndrome."]}
{"disease": "senolytic drug mechanisms", "core_genes": ["BCL-2 family proteins"], "hypotheses": ["Combined inhibition of BCL-W and BCL-XL using BH3 mimetics may drive mitochondrial outer membrane permeabilization in senescent cells, amplifying navitoclax-induced senolysis and rejuvenating aged tissue microenvironments via selective clearance of pro-inflammatory senescent cells."]}
{"disease": "cystic fibrosis", "core_genes": ["CFTR F508del mutation"], "hypotheses": ["Pharmacological inhibition of neutrophil elastase in F508del CFTR cystic fibrosis may restore epithelial ion channel function by reducing proteolytic degradation of non-CFTR channels, thereby synergistically enhancing mucociliary clearance and attenuating inflammation beyond direct epithelial protection."]}
{"disease": "Pompe disease", "core_genes": ["GAA gene", "enzyme replacement therapy"], "hypotheses": ["ERT may activate the AMPK pathway, leading to upregulation of specific autophagy-related genes and improved recruitment of lysosomal biogenesis, thereby synergistically enhancing glycogen clearance and muscle function in Pompe disease beyond the direct enzymatic effects of GAA restoration."]}
{"disease": "spinal muscular atrophy", "core_genes": ["SMN1 gene deletion"], "hypotheses": ["Upregulation of U1 snRNP assembly factors in SMN1-deficient spinal muscular atrophy may synergistically enhance motor neuron survival by not only compensating for impaired snRNP biogenesis but also by modulating stress granule dynamics and alternative splicing of neuroprotective transcripts."]}
{"disease": "Morquio syndrome", "core_genes": ["GALNS enzyme deficiency"], "hypotheses": ["Restoring GALNS enzyme activity in chondrocytes may not only reduce keratan sulfate accumulation but also modulate autophagic flux, potentially enhancing cartilage matrix homeostasis and further alleviating skeletal dysplasia in Morquio syndrome."]}
{"disease": "Schwartz-Jampel syndrome", "core_genes": ["HSPG2 gene mutations"], "hypotheses": ["Loss of perlecan due to HSPG2 mutations disrupts coordinated FGF and TGF-β signaling crosstalk in cartilage, leading to aberrant chondrocyte maturation and altered neuromuscular matrix organization, thereby contributing to both skeletal dysplasia and myotonia in Schwartz-Jampel syndrome."]}
{"disease": "myotonic dystrophy", "core_genes": ["DMPK gene expansion"], "hypotheses": ["Upregulation of MBNL1 not only rescues canonical splicing defects but also reprograms alternative polyadenylation and microRNA processing, potentially reversing muscle pathology and multisystem symptoms in myotonic dystrophy by restoring broader post-transcriptional regulatory networks disrupted by DMPK expansion."]}
{"disease": "Fukuyama congenital muscular dystrophy", "core_genes": ["FKTN gene mutations"], "hypotheses": ["Restoring fukutin-mediated glycosylation of alpha-dystroglycan not only stabilizes muscle fiber membranes but may also modulate intracellular calcium signaling pathways, thereby reducing susceptibility to contraction-induced injury and enhancing muscle regeneration in Fukuyama congenital muscular dystrophy models."]}
{"disease": "X-linked adrenoleukodystrophy", "core_genes": ["ABCD1 gene mutations"], "hypotheses": ["Restoring ABCD1-mediated VLCFA transport in oligodendrocytes not only suppresses neuroinflammation and preserves myelin integrity in X-linked adrenoleukodystrophy, but may also indirectly modulate astrocyte activation through altered oligodendrocyte-astrocyte metabolic signaling, providing a novel therapeutic axis."]}
{"disease": "malignant infantile osteopetrosis", "core_genes": ["TCIRG1 gene defects"], "hypotheses": ["Restoring TCIRG1-dependent vacuolar H+-ATPase activity in osteoclasts not only enhances bone resorption but may also alter the marrow microenvironment to improve hematopoietic stem cell niche function and immune cell development in malignant infantile osteopetrosis."]}
{"disease": "X-linked retinitis pigmentosa", "core_genes": ["RPGR gene mutations"], "hypotheses": ["Restoring RPGR function may not only correct ciliary trafficking but also enhance the resilience of photoreceptors to metabolic or oxidative stress by modulating uncharacterized cilia-dependent signaling pathways disrupted in X-linked retinitis pigmentosa."]}
{"disease": "metabolic health regulation", "core_genes": ["Akkermansia muciniphila"], "hypotheses": ["Akkermansia muciniphila-derived Amuc_1100 activates TLR2 signaling in intestinal epithelial cells, triggering PI3K/Akt pathway activation, which enhances tight junction protein expression and suppresses inflammatory cytokines, ultimately improving insulin sensitivity through integrated barrier and anti-inflammatory mechanisms."]}
{"disease": "microbiota-gut-brain axis", "core_genes": ["Bacteroides fragilis polysaccharide A"], "hypotheses": ["Polysaccharide A from Bacteroides fragilis stimulates gut-derived regulatory T cells to secrete IL-10, which crosses the blood-brain barrier to attenuate hippocampal microglial activation and cognitive decline, with measurable effects in both murine models and humanized in vitro brain-immune co-culture systems."]}
{"disease": "antibiotic-associated colitis", "core_genes": ["Clostridioides difficile toxin B"], "hypotheses": ["Clostridioides difficile toxin B disrupts intestinal epithelial Rho GTPase signaling, leading to both IL-8-dependent and IL-1β-mediated neutrophil recruitment, thereby amplifying mucosal inflammation through synergistic cytokine cascades in antibiotic-associated colitis."]}
{"disease": "immune system modulation", "core_genes": ["Lactobacillus rhamnosus GG"], "hypotheses": ["Lactobacillus rhamnosus GG administration promotes intestinal epithelial cell-derived TGF-β and short-chain fatty acid production, fostering dendritic cell-mediated regulatory T cell differentiation and amplifying mucosal anti-inflammatory responses through a synergistic cross-talk between epithelial and immune cell networks."]}
{"disease": "rheumatoid arthritis", "core_genes": ["Prevotella copri"], "hypotheses": ["Prevotella copri promotes intestinal Th17 cell differentiation not only via IL-6 induction but also through modulation of epithelial barrier function and IL-23 production, synergistically accelerating systemic inflammation and rheumatoid arthritis onset."]}
{"disease": "intestinal barrier function", "core_genes": ["butyrate-producing bacteria"], "hypotheses": ["Augmentation of butyrate-producing bacteria abundance enhances claudin-1 expression via butyrate-induced activation of the GPR109A receptor and subsequent modulation of AMPK signaling, thus reinforcing tight junction integrity and reducing intestinal permeability."]}
{"disease": "periodontal disease and cardiovascular risk", "core_genes": ["Porphyromonas gingivalis"], "hypotheses": ["Porphyromonas gingivalis gingipains may upregulate endothelial ICAM-1 by modulating local cytokine production, thereby synergistically enhancing both monocyte adhesion and foam cell formation to accelerate atherogenesis beyond the effects of ICAM-1 alone."]}
{"disease": "obesity and insulin resistance", "core_genes": ["Firmicutes/Bacteroidetes ratio"], "hypotheses": ["A higher Firmicutes/Bacteroidetes ratio increases gut-derived lipopolysaccharide translocation, which activates TLR4 on adipose tissue macrophages, triggering production of ceramides that impair insulin receptor signaling and exacerbate insulin resistance in obesity."]}
{"disease": "intestinal permeability", "core_genes": ["zonulin protein"], "hypotheses": ["Upregulation of zonulin may activate downstream signaling that selectively alters tricellulin localization, independently of occludin, thereby enabling targeted passage of specific bacterial antigens and shaping distinct mucosal immune responses in the intestinal epithelium."]}
{"disease": "anti-inflammatory effects", "core_genes": ["Faecalibacterium prausnitzii"], "hypotheses": ["Faecalibacterium prausnitzii–derived indole metabolites enhance regulatory T cell differentiation in intestinal tissue, thereby indirectly suppressing mucosal inflammation through modulation of dendritic cell function independently of the canonical butyrate–NF-κB–IL-8 pathway in inflammatory bowel disease."]}
{"disease": "pain management", "core_genes": ["CYP2D6 polymorphisms", "codeine metabolism"], "hypotheses": ["Concurrent genetic variation in UGT2B7, affecting morphine glucuronidation, may synergistically exacerbate reduced analgesic efficacy in codeine-treated patients with CYP2D6 reduced-function alleles by further decreasing active morphine metabolite availability."]}
{"disease": "lung cancer monitoring", "core_genes": ["ctDNA", "EGFR T790M mutation"], "hypotheses": ["Dynamic increases in ctDNA harboring EGFR T790M, co-occurring with emerging MET amplification, predict early resistance and inferior response to EGFR-TKI therapy in NSCLC, suggesting that dual monitoring of these alterations could optimize precision treatment strategies."]}
{"disease": "hereditary breast cancer", "core_genes": ["BRCA1/2 germline mutations"], "hypotheses": ["BRCA1 deficiency in breast epithelial cells leads to accumulation of cytosolic DNA fragments that activate cGAS-STING via impaired DNA damage clearance, with ATM kinase dysregulation acting as a critical intermediary amplifying interferon-driven immunogenicity in hereditary breast cancer."]}
{"disease": "immunotherapy patient selection", "core_genes": ["PD-L1 tumor proportion score"], "hypotheses": ["Elevated PD-L1 tumor proportion score not only suppresses cytotoxic T lymphocyte infiltration but also enhances recruitment of immunosuppressive myeloid cells via cytokine modulation, collaboratively establishing a tumor microenvironment with diminished baseline anti-tumor immunity prior to immunotherapy."]}
{"disease": "abacavir hypersensitivity prevention", "core_genes": ["HLA-B*5701 allele"], "hypotheses": ["Upregulation of ERAP1 in HLA-B*5701-positive individuals may selectively generate a novel set of abacavir-altered self-peptides that are less likely to activate pathogenic T cells, thereby attenuating hypersensitivity risk through unique immunopeptidome reshaping."]}
{"disease": "predictive biomarker for sotorasib response", "core_genes": ["KRAS G12C mutation"], "hypotheses": ["Co-occurring STK11 loss-of-function mutations in KRAS G12C-mutant NSCLC promote metabolic reprogramming that reduces sotorasib efficacy by shifting tumor cell survival from KRAS G12C dependency to glutamine-driven pathways, potentially revealing new combination therapeutic strategies."]}
{"disease": "cardiovascular risk stratification", "core_genes": ["CRP elevation"], "hypotheses": ["CRP elevation induces endothelial microRNA dysregulation—specifically downregulating miR-126—which in turn upregulates VCAM-1 expression, thereby enhancing monocyte adhesion and exacerbating atherogenesis in individuals with heightened cardiovascular risk."]}
{"disease": "prostate cancer early detection", "core_genes": ["PSA isoforms"], "hypotheses": ["Upregulation of the protease-resistant [-2]proPSA isoform in early prostate cancer promotes cell invasiveness by facilitating evasion of α1-antichymotrypsin-mediated inhibition, potentially through altered microenvironmental signaling that further stimulates invasive gene expression programs."]}
{"disease": "acute myocardial infarction diagnosis", "core_genes": ["Troponin I kinetics"], "hypotheses": ["Altered expression of endothelial cell adhesion molecules may influence troponin I release kinetics after acute myocardial infarction by modulating leukocyte transmigration and local inflammatory responses, thereby serving as an early indicator of disproportionate myocardial injury risk beyond traditional biomarkers."]}
{"disease": "diabetes management", "core_genes": ["HbA1c levels"], "hypotheses": ["Pharmacological activation of Nrf2 signaling reduces HbA1c levels in type 2 diabetes patients by simultaneously upregulating antioxidant genes and altering hepatic glucose metabolism through modulation of key gluconeogenic enzymes, suggesting a dual mechanism for improved glycemic control."]}
