{"disease": "breast and ovarian cancer", "core_genes": ["BRCA1", "homologous recombination repair", "PARP inhibitor resistance"], "hypotheses": ["PPP2CA activation leads to dephosphorylation of CEBPB, enhancing its recruitment—together with MYC or EGR1—to RAD51 and BRCA2 promoters, as detected by ChIP-seq, thereby restoring homologous recombination and promoting PARP inhibitor resistance in BRCA1-mutant breast and ovarian cancers."]}
{"disease": "cancer (wild-type p53)", "core_genes": ["p53", "MDM2"], "hypotheses": ["Targeting MT1A or its interaction with SUZ12 in cancers with wild-type p53 could restore p53-driven ferroptosis and sensitize tumors to immunotherapy by reversing MT1A-mediated epigenetic silencing of the p53 pathway and associated immune evasion."]}
{"disease": "colorectal cancer", "core_genes": ["KRAS G12C"], "hypotheses": ["PPP2CB activation in KRAS G12C-mutant colorectal cancer orchestrates suppression of MAPK and EGFR signaling and reshapes the tumor immune microenvironment through Hippo pathway gene modulation, thereby potentiating responses to combined KRAS G12C inhibition and immunotherapy while antagonizing mechanisms of adaptive resistance."]}
{"disease": "cancer", "core_genes": ["EGFR L858R", "tyrosine kinase inhibitor sensitivity"], "hypotheses": ["PPP2CA dephosphorylates EGFR L858R and, through functional interplay with NRF1 and EGR1, may disrupt MUC1-C–driven resistance, thereby restoring or enhancing tyrosine kinase inhibitor sensitivity in non-small cell lung cancer—a mechanism testable via targeted modulation of each component in NSCLC models."]}
{"disease": "cancer immune escape", "core_genes": ["PD-L1", "JAK-STAT"], "hypotheses": ["PPP2CA suppresses JAK1-driven PD-L1 expression in tumor cells by modulating the phosphorylation state and stability of MYC and ETS1, thereby enhancing cDC1 and CD8+ T-cell infiltration and synergizing with STING-mediated antitumor immunity within the tumor microenvironment."]}
{"disease": "gastric cancer", "core_genes": ["HER2", "trastuzumab resistance"], "hypotheses": ["PPP2CA suppresses trastuzumab resistance in HER2-positive gastric cancer by preferentially dephosphorylating EGR1, thereby impairing EGR1-dependent activation of the NPC1-CDC42-Hedgehog-ABCB1 axis, disrupting cholesterol-driven drug efflux and diminishing cancer stemness and survival."]}
{"disease": "B-cell malignancy", "core_genes": ["CD19", "CAR-T cell", "cytokine release syndrome biomarkers"], "hypotheses": ["EGR1 upregulation in B-cell malignancies enhances CD19 expression and drives metabolic/epigenetic reprogramming (notably via histone lactylation), and isolating EGR1’s direct contribution to cytokine release syndrome—independent of tumor burden—can be achieved using isogenic or conditional EGR1-modulated cell and animal models."]}
{"disease": "glioblastoma", "core_genes": ["VEGF-A", "VEGFR2"], "hypotheses": ["PPP2CA coordinates with NRF1 and MYC to regulate HIF1A turnover and metabolic reprogramming, amplifying VEGFA-mediated angiogenesis and resistance in glioblastoma, which could be validated via co-immunoprecipitation, metabolic flux analysis, and functional angiogenesis assays in patient-derived glioblastoma models."]}
{"disease": "cancer-associated fibroblasts", "core_genes": ["TNF-α", "NF-κB"], "hypotheses": ["TNF-α stimulation of cancer-associated fibroblasts induces KAT2B-mediated lactylation and nuclear import of EGR1, enabling EGR1 to coordinate metabolic reprogramming and potentiate NF-κB-driven pro-tumorigenic secretion, thereby amplifying EMT and spatial heterogeneity within the tumor microenvironment."]}
{"disease": "PI3K/PTEN-deficient tumors", "core_genes": ["mTOR complex 1", "hyperactivation"], "hypotheses": ["PPP2CA suppresses mTORC1-driven macrophage recruitment in PTEN-deficient tumors by targeting AKT1 and inhibiting MYC-driven CCL2 and CXCL8 expression, thereby reducing chemokine-mediated macrophage infiltration."]}
{"disease": "Parkinson's disease", "core_genes": ["LRRK2 G2019S", "mitochondrial dynamics"], "hypotheses": ["PPP2CA–NRF1 interaction modulates LRRK2 G2019S-driven DRP1 phosphorylation and mitochondrial fragmentation in microglia, with resulting changes in mitochondrial morphology and pro-inflammatory cytokine expression serving as measurable indicators of neuroinflammatory regulation in Parkinson’s disease."]}
{"disease": "Parkinson's disease", "core_genes": ["α-synuclein A53T", "aggregation", "neuroinflammation"], "hypotheses": ["TRIM14 accelerates α-synuclein A53T aggregation and neuronal loss in Parkinson’s disease by boosting NF-κB activation, altering TRAF3 and USP14 activity, and reducing autophagic clearance—effects verifiable by tracking phosphorylated NF-κB, TRAF3/USP14 levels, and α-synuclein aggregates in PD animal or neuronal models."]}
{"disease": "Alzheimer's disease", "core_genes": ["APOE4", "amyloid-β clearance"], "hypotheses": ["LGALS9-LRP1 interaction in APOE4-expressing microglia impairs autophagic flux (decreased LC3-II/LC3-I ratio), lysosomal acidification (reduced LAMP1+ vesicles), and increases proinflammatory cytokines (e.g., IL-1β, TNF-α), resulting in diminished amyloid-β clearance and accelerated Alzheimer’s disease pathology."]}
{"disease": "frontotemporal dementia", "core_genes": ["Tau R406W"], "hypotheses": ["PPP2CA activation enhances NRF1 signaling, which indirectly represses CDK5 activity, thereby reducing tau T217 phosphorylation and neurofibrillary tangle formation in MAPT R406W frontotemporal dementia."]}
{"disease": "Alzheimer's disease", "core_genes": ["TREM2", "microglia", "neuroinflammation"], "hypotheses": ["HMG20A, via modulation of the TCF20/PHF14 chromatin complex, represses lysosomal gene Rab7 and activates metabolic gene networks in microglia, epigenetically shifting TREM2-responsive states to enhance amyloid-β clearance and neuroprotection in Alzheimer's disease."]}
{"disease": "Lewy body diseases", "core_genes": ["GBA1", "lysosomal dysfunction"], "hypotheses": ["TRIM14 upregulation in GBA1-deficient microglia drives STING-mediated neuroinflammation by promoting TRAF3 degradation and sustained NF-κB activation, which, through impaired lipid metabolism, accelerates neuronal loss and α-synuclein aggregation in Lewy body diseases."]}
{"disease": "amyotrophic lateral sclerosis (ALS)", "core_genes": ["NEFL", "axonal degeneration"], "hypotheses": ["Pharmacological or genetic upregulation of PPP2CA in motor neurons may simultaneously enhance NEFL stability and suppress aberrant CDK2/MYC-regulated pathways, offering a multi-targeted strategy for halting axonal degeneration and motor neuron loss in amyotrophic lateral sclerosis."]}
{"disease": "Parkinson's disease", "core_genes": ["c-Abl kinase", "dopaminergic neuronal death"], "hypotheses": ["Activation of TRIM14 promotes aberrant c-Abl kinase signaling, leading to increased parkin phosphorylation, PARIS accumulation, and measurable suppression of PGC-1α and mitochondrial function, potentially involving PPP2CA activity, thereby accelerating neuroinflammation and dopaminergic neuronal death in Parkinson’s disease."]}
{"disease": "neurodegeneration", "core_genes": ["CLOCK gene", "circadian rhythm"], "hypotheses": ["Inhibition of GSK3B enhances CLOCK’s suppression of neuroinflammation by activating NRF2-dependent antioxidant signaling and altering MYC-mediated transcription, with these effects measurable via NRF2 reporter assays, MYC target gene expression, and glial oxidative stress markers to validate pathway engagement and neuroprotection."]}
{"disease": "multiple sclerosis", "core_genes": ["neurofilament light chain (NFL)"], "hypotheses": ["Dysregulated TTR alters interactions with PHYHIP and ATF5, potentially modulating calpain-mediated NfL proteolysis and amplifying microglial activation, thereby accelerating neuroaxonal injury and disability progression in progressive multiple sclerosis, especially when combined with chronic neuroinflammation and demyelination."]}
{"disease": "metabolic syndrome", "core_genes": ["GLP-1 receptor agonist", "AMPK signaling"], "hypotheses": ["PPP2CA-driven dephosphorylation of AKT and AMPK, modulated by GLP1R signaling, restores insulin sensitivity and lipid balance in hepatic and adipose tissues, which can be experimentally validated by correlating plasma EV-associated PP2A activity with insulin resistance and HbA1c in human metabolic syndrome cohorts."]}
{"disease": "diabetic cardiomyopathy", "core_genes": ["SGLT2 inhibitor", "ketogenesis"], "hypotheses": ["Enhancing HSD17B10-driven mitochondrial RNA processing and HMGCS2 complex assembly via modulation of protein partners such as EIF3I or PSMC4 will boost ketogenesis and directly ameliorate cardiac dysfunction and oxidative stress in diabetic cardiomyopathy, providing a novel therapeutic avenue."]}
{"disease": "obesity-induced insulin resistance", "core_genes": ["GIP receptor", "GLP-1"], "hypotheses": ["PPP2CA-mediated dephosphorylation of GIPR disrupts GIPR-NRF1/MYC signaling in adipocytes, thereby blunting incretin-induced transcription of thermogenic and insulin-sensitizing genes, ultimately limiting clinical improvements in glucose disposal and energy expenditure during obesity-targeted incretin therapy."]}
{"disease": "metabolic syndrome", "core_genes": ["UCP1", "brown adipose tissue", "thermogenesis"], "hypotheses": ["FGF9 stimulates FGFR3/MYC signaling to enhance UCP1-driven thermogenesis in brown adipose tissue, thereby increasing the secretion of specific BAT-derived adipokines (e.g., adiponectin) whose direct effects on insulin sensitivity can be quantified via conditioned media transfer and proteomic profiling in metabolic syndrome models."]}
{"disease": "type 2 diabetes", "core_genes": ["IRS-1", "serine phosphorylation"], "hypotheses": ["PPP2CA activation reduces IRS-1 serine phosphorylation and, by forming a complex with NRF1 that can be detected via co-immunoprecipitation, synergistically enhances insulin signaling and mitochondrial gene transcription to improve glucose uptake in type 2 diabetes."]}
{"disease": "congenital leptin deficiency", "core_genes": ["LEPR gene"], "hypotheses": ["Loss-of-function mutations in LEPR disrupt LEPR–GRB2 and LEPR–CSNK2B interactions within hypothalamic neurons, impairing transduction of metabolic cues to kisspeptin-expressing cells and thus diminishing GnRH secretion, leading to congenital hypogonadotropic hypogonadism in leptin-deficient individuals."]}
{"disease": "congenital hypothyroidism", "core_genes": ["TPO gene"], "hypotheses": ["TRIM38 regulates the ubiquitination of HSPA1A, which modulates PPP2CA phosphatase activity, ultimately influencing TPO protein stability and thereby altering thyroid hormone biosynthesis and the clinical severity of congenital hypothyroidism; each step can be delineated by sequential molecular assays."]}
{"disease": "hepatic glucose production", "core_genes": ["GCGR antagonism"], "hypotheses": ["GCGR antagonism suppresses hepatic gluconeogenesis by disrupting GCGR–PSMD2 interaction, and targeted in vivo disruption of this axis stabilizes PPARα and potentiates lipid oxidation, suggesting a novel therapeutic strategy for improving metabolic dysfunction in insulin-resistant liver disease."]}
{"disease": "medium-chain acyl-CoA dehydrogenase disorders", "core_genes": ["ACADM deficiency"], "hypotheses": ["Disruption of the ACADM–PNKD protein interaction in MCADD destabilizes distinct ACADM-containing complexes with ETF and CKAP5, and targeted co-immunoprecipitation and proteomics in patient-derived cells could reveal novel regulatory assemblies underlying variable metabolic stress responses."]}
{"disease": "mitochondrial diabetes", "core_genes": ["TFAM gene"], "hypotheses": ["TFAM deficiency impairs MYC- and EGR1-driven mitochondrial biogenesis, increases cytoplasmic mtDNA-triggered cGAS-STING inflammation, and alters lysosomal remodeling, each of which can be dissected in cellular and animal models to reveal distinct contributions to ATP depletion and insulin secretion failure in mitochondrial diabetes."]}
{"disease": "familial hypercholesterolemia", "core_genes": ["PCSK9 inhibition", "LDL receptor recycling"], "hypotheses": ["PPP2CA alters the phosphorylation of SNX17 and Rab GTPases to modulate LDLR recycling and LDL-C levels in familial hypercholesterolemia, which can be tested via phosphoproteomics and LDLR trafficking assays in CRISPR-edited mice and patient-derived hepatocytes, with clinical biomarkers as measurable outcomes."]}
{"disease": "atherosclerosis", "core_genes": ["NLRP3 inflammasome", "plaque formation"], "hypotheses": ["PPP2CA inhibits NLRP3 inflammasome activation in macrophages by dephosphorylating NLRP3 at serine 3 and dampening NF-κB p65 phosphorylation, thereby reducing IL-1β secretion and suppressing atherosclerotic plaque formation more effectively when TBK1/IKKε activity is diminished."]}
{"disease": "cardiac fibrosis and heart failure", "core_genes": ["TGF-β1 signaling"], "hypotheses": ["In cardiac fibroblasts, EIF3I interacts with MYC and ETS1 to form a regulatory complex whose stress-responsive assembly is enhanced following cardiac injury, thereby modulating TGFB1 mRNA translation and amplifying TGF-β1-driven fibrotic remodeling observed in both animal models and human heart failure tissues."]}
{"disease": "vascular aging", "core_genes": ["eNOS uncoupling", "endothelial dysfunction"], "hypotheses": ["NOX4 activation in senescent endothelial cells increases mitochondrial ROS, disrupts GRP78-GPX4 interaction—assessable by proximity ligation and ferroptosis markers—and induces eNOS uncoupling, collectively driving vascular aging in a process experimentally testable in primary human endothelial cell and animal models."]}
{"disease": "heart failure with preserved ejection fraction", "core_genes": ["BNP elevation"], "hypotheses": ["FGF9 upregulation in cardiac fibroblasts, acting through FGFR3 and modulating MYC and ETS1-driven transcriptional networks, suppresses profibrotic gene expression and attenuates BNP elevation by disrupting pathological extracellular matrix remodeling in HFpEF."]}
{"disease": "cardiomyocyte regeneration", "core_genes": ["GATA4 transcription factor"], "hypotheses": ["Combining HDAC4 inhibition with pharmacological activation of the PP2A-Akt1 axis directly increases GATA4-driven cardiomyocyte regeneration by releasing repressive HDAC4 complexes and enhancing chromatin accessibility, with measurable molecular and functional outcomes verifiable through current chromatin and cardiomyocyte assays."]}
{"disease": "vascular smooth muscle cell proliferation", "core_genes": ["PDGF-BB signaling"], "hypotheses": ["GATA2 and EGR1 physically interact at the CDK2 promoter to quantitatively enhance PDGF-BB-induced VSMC proliferation, as measured by synergistic increases in CDK2 mRNA expression and cell proliferation rates detectable through ChIP-qPCR, reporter assays, and interaction analysis."]}
{"disease": "vascular calcification", "core_genes": ["Runx2 transcription factor"], "hypotheses": ["SKP2 and stress-induced RUNX2 stabilization synergistically drive vascular calcification in vivo, a mechanism testable with VSMC-specific SKP2 knockout and combined SKP2/stress pathway inhibition in calcification-prone mouse models, using quantitative imaging and molecular assays to validate additive or synergistic effects on RUNX2 and calcification."]}
{"disease": "hypertension-induced cardiac remodeling", "core_genes": ["ACE2", "Ang-(1-7) axis"], "hypotheses": ["PPP2CA interacts with myocardial transcription factors such as EGR1 and MYC to modulate TGF-β signaling and ACE2/Ang-(1-7) axis activity, suggesting that its upregulation could synergistically suppress cardiac fibrosis by integrating anti-fibrotic transcriptional and post-translational mechanisms in hypertensive heart disease."]}
{"disease": "cardiac metabolic reprogramming", "core_genes": ["SIRT1 deacetylase activity"], "hypotheses": ["SIRT1 deacetylase activity, by counteracting MYC-driven glycolysis and activating the AMPK-PGC-1α axis, restores mitochondrial function, reduces hypertrophic gene expression (e.g., ANP, BNP), and diminishes fibrosis and oxidative stress, offering measurable endpoints for limiting maladaptive cardiac remodeling."]}
{"disease": "regulatory T cell dysfunction", "core_genes": ["FOXP3 expression stability"], "hypotheses": ["PPP2CA activation in regulatory T cells upregulates NRF1-driven antioxidant gene expression, reducing ROS-induced FOXP3 degradation and shifting metabolism, as verified by FOXP3 protein stability assays, ROS measurement, and Treg suppressive function in inflammatory model systems."]}
{"disease": "systemic lupus erythematosus", "core_genes": ["IRF7", "type I interferon signaling"], "hypotheses": ["SUMO1-mediated sumoylation of IRF7 enhances its transcriptional and metabolic regulation in B cells, promoting persistent autoantibody production in SLE, potentially through aggregation-dependent mechanisms that could be dissected using in vivo proteostasis reporters and germinal center B cell models."]}
{"disease": "Th17 cell differentiation", "core_genes": ["RORγt transcription factor"], "hypotheses": ["EGR1 represses STAT3 to inhibit RORγt-driven Th17 differentiation, and EGR1 activation—potentially enhanced by microbiome-derived metabolites like L-ornithine—synergistically disrupts the IL-23/STAT3 axis, offering a dual-targeted strategy to dampen Th17-mediated pathology in autoimmune and inflammatory diseases."]}
{"disease": "B cell tolerance breakdown", "core_genes": ["CD20 expression loss"], "hypotheses": ["Reduced CD20 expression on B cells, in conjunction with enhanced CD19-PIK3R1/SP1 signaling and newly implicated EGR1 involvement, synergistically drives metabolic and transcriptional reprogramming that promotes autoreactive B cell survival and proliferation during immune tolerance breakdown and therapeutic resistance."]}
{"disease": "rheumatoid arthritis", "core_genes": ["C5aR1 complement receptor"], "hypotheses": ["C5AR1 activation in neutrophils induces PRKCB interaction and recruitment, promoting PPP2CA-dependent dephosphorylation of HDAC5, thereby increasing NETosis and joint damage in rheumatoid arthritis—a pathway readily testable by co-immunoprecipitation, phosphatase assays, and NET quantification in primary neutrophils."]}
{"disease": "autoinflammatory disease pathogenesis", "core_genes": ["NLRP3 inflammasome priming"], "hypotheses": ["PPP2CA influences NLRP3 inflammasome priming and IL-1β/IL-18 secretion through functional networks involving EGR1, MYC, and CDK2, with PPP2CA loss or dysregulation predicted to exacerbate autoinflammatory disease by simultaneously disrupting cell cycle checkpoints and inflammasome regulation in vivo."]}
{"disease": "tissue-resident memory T cells", "core_genes": ["CD69 expression"], "hypotheses": ["Inflammatory cytokines or local metabolic cues such as elevated lactate modulate EP300-EGR1 cooperation at the CD69 locus, dynamically regulating chromatin accessibility and thereby tailoring tissue-resident memory T cell persistence and effector responses to the tissue microenvironment."]}
{"disease": "autoimmune polyglandular syndrome", "core_genes": ["AIRE gene mutations"], "hypotheses": ["Loss-of-function mutations in AIRE abrogate its experimentally supported interaction with PIK3R1, leading to uncontrolled PI3K signaling that not only heightens lymphocyte activation but also enhances interferon-γ-mediated tissue injury and alters immune cell infiltration profiles in APS-1."]}
{"disease": "autoimmune disease susceptibility", "core_genes": ["CTLA-4 polymorphisms"], "hypotheses": ["CTLA-4 polymorphisms diminish inhibitory signaling, enabling PIK3R1 and FYN/LCK gain-of-function alterations that drive persistent STAT3-mediated TH17 polarization and disrupt PPP2CA-dependent phosphatase homeostasis, collectively amplifying autoreactive T cell survival and autoimmune hepatitis risk in genetically susceptible individuals."]}
{"disease": "microbiome-mediated immune development", "core_genes": ["TLR4 signaling"], "hypotheses": ["Microbiome-induced TLR4 activation recruits an ETS1–PPP2CA complex that represses Hmbox1, thereby orchestrating nucleosome remodeling and TNFSF4-mediated B cell activation to calibrate immune tolerance and neuroimmune crosstalk during early immune development; this axis is amenable to in vivo validation via genetic and functional assays."]}
{"disease": "carbapenem resistance", "core_genes": ["NDM-1 metallo-β-lactamase"], "hypotheses": ["CD81-enriched extracellular vesicles deliver oxidized glutathione or related redox-active molecules to Gram-negative bacteria, selectively disrupting NDM-1 metallo-β-lactamase activity and thereby enhancing meropenem susceptibility through direct modulation of bacterial redox homeostasis."]}
{"disease": "COVID-19", "core_genes": ["SARS-CoV-2 spike protein D614G", "viral fitness"], "hypotheses": ["Modulation of BACE2 activity in airway epithelial cells alters ACE2 abundance and cholesterol signaling, impacting D614G spike-mediated viral entry; levels of soluble VEGFR3 and cholesterol metabolites in patient plasma could serve as translational biomarkers to link these cellular effects to COVID-19 severity and outcomes."]}
{"disease": "tuberculosis", "core_genes": ["ESX-1 secretion system", "Mycobacterium tuberculosis virulence"], "hypotheses": ["Activation of TLR2 in macrophages suppresses ESX-1-mediated phagosomal rupture by Mycobacterium tuberculosis via PI3K signaling, with genetic or pharmacological inhibition of TLR2 or PI3K predicted to restore ESAT-6-driven membrane remodeling, cytosolic escape, and pathogen-induced macrophage death."]}
{"disease": "azole-resistant Aspergillus fumigatus", "core_genes": ["CYP51A gene mutations"], "hypotheses": ["In Aspergillus fumigatus, stress-induced activation of a fungal SREBF2-like transcription factor may coordinate with SP1 and SUMO1-mediated pathways to upregulate CYP51A1 and ancillary cholesterol biosynthesis genes, thereby amplifying azole resistance in CYP51A mutant strains beyond canonical resistance mechanisms."]}
{"disease": "influenza", "core_genes": ["memory B cell", "BCR affinity maturation"], "hypotheses": ["POU5F1, in concert with SOX2 and MAPK1, modulates chromatin accessibility in germinal center B cells to increase the frequency of high-affinity, broadly neutralizing BCRs and the proportion of CD27+CD38– memory B cells following influenza vaccination, as measured by single-cell BCR-seq and flow cytometry."]}
{"disease": "bacterial biofilm formation", "core_genes": ["FtsZ protein inhibition"], "hypotheses": ["BPIFA1 enhances the anti-biofilm efficacy of FtsZ inhibitors in resistant bacterial strains by downregulating Orai1-mediated calcium signaling in macrophages, promoting a transient M1 phenotype and resulting in targeted immune-mediated biofilm clearance; this mechanism can be validated in murine lung infection models."]}
{"disease": "hepatitis B virus drug resistance", "core_genes": ["HBV polymerase L180M", "entecavir resistance"], "hypotheses": ["USP11-driven stabilization of both EEF1A1 and MYC enhances the translation of the HBV L180M polymerase mutant in hepatocytes, creating a MYC/EEF1A1/RPS8-dependent axis that confers lamivudine resistance by selectively promoting mutant polymerase synthesis and viral persistence."]}
{"disease": "chronic viral infections", "core_genes": ["CD8+ T cell exhaustion markers"], "hypotheses": ["PPP2CA modulates the phosphorylation states of transcription factors such as MYC and ETS1, which in turn influence TOX-driven epigenetic reprogramming and reinforce CD8+ T cell exhaustion during chronic viral infection."]}
{"disease": "malaria", "core_genes": ["PfEMP1 protein", "Plasmodium falciparum immune evasion"], "hypotheses": ["Upregulation of ZNF24 in endothelial cells reduces VEGFA-driven permeability, which may reinforce endothelial barrier integrity and limit the exposure of PfEMP1 receptors, thereby decreasing infected erythrocyte sequestration and altering the severity of Plasmodium falciparum malaria via a host-regulated vascular mechanism."]}
{"disease": "bacteriophage host specificity", "core_genes": ["phage tail fibers"], "hypotheses": ["Amino acid substitutions in phage tail fiber contact residues with altered charge or size shift binding specificity toward engineered or natural LRP2 conformers or modifications, a process testable by in vitro affinity assays and infection of bacterial strains expressing defined LRP2 variants to map host range changes."]}
{"disease": "cellular senescence", "core_genes": ["p16INK4a expression"], "hypotheses": ["ATM-mediated phosphorylation of BNIP3 enhances mitochondrial cristae formation and fatty acid oxidation, generating acetyl-CoA that activates KAT5-dependent histone acetylation to upregulate CDKN2A (p16INK4A) and trigger senescence, revealing a mechanistic axis verifiable in metabolic syndrome animal models or patient tissues."]}
{"disease": "telomere maintenance disorders", "core_genes": ["TERT promoter mutations"], "hypotheses": ["TERT promoter mutations synergize with MYC stabilization by SETD8 and deubiquitinases to elevate CD34+ cell proliferation, glycolytic enzyme expression, and telomerase activity, quantifiably accelerating clonal expansion and malignant transformation in hematopoietic cells of telomere maintenance disorder patients."]}
{"disease": "mitochondrial quality control", "core_genes": ["PINK1", "Parkin pathway"], "hypotheses": ["NEDD8-mediated neddylation of PINK1 enhances mitophagy and reduces oxidative stress in MYC-driven cancer cells, with measurable endpoints including PINK1 neddylation, MYC activity, mitophagy flux, and ROS levels, and is testable in cell lines or xenograft models using established molecular assays."]}
{"disease": "inflammaging", "core_genes": ["SASP factor", "IL-6 secretion"], "hypotheses": ["MIR145 disrupts SASP-driven inflammaging in senescent vascular smooth muscle cells by downregulating SOCS7-mediated JAK/STAT3 signaling and HDAC11-dependent epigenetic activation, thereby jointly suppressing IL-6 secretion and the persistence of the pro-inflammatory senescent phenotype."]}
{"disease": "epigenetic aging", "core_genes": ["EPAS1 gene methylation"], "hypotheses": ["Hypermethylation of the EPAS1 promoter represses EPAS1–SP1 and EPAS1–VHL interactions, disrupting hypoxic signaling and potentially shifting macrophage and pericyte phenotypes toward increased inflammation and fibrosis in aging tissues through altered mTOR/TFEB and ceramide pathways."]}
{"disease": "mitochondrial aging", "core_genes": ["SIRT3 deacetylase activity"], "hypotheses": ["EGR1, upon metabolic stress-induced nuclear import via importin-α, recruits HDAC3 to the SIRT3 promoter, promoting histone deacetylation and epigenetic silencing of SIRT3, thereby reducing mitochondrial antioxidant capacity and accelerating cellular senescence."]}
{"disease": "stem cell senescence", "core_genes": ["LIN28A expression"], "hypotheses": ["The LIN28A–SIN3A complex suppresses neural progenitor cell senescence in vivo by integrating WNT3A-driven Wnt signaling, let-7 microRNA suppression, and metabolic reprogramming—including enhanced oxidative phosphorylation—suggesting a multi-layered regulatory axis that supports neurogenesis and counters age-related neurodegeneration."]}
{"disease": "DNA damage response aging", "core_genes": ["ATM kinase activation"], "hypotheses": ["TAF1, via its acetylrecognition domains, cooperates with the MRN complex to facilitate local ATM activation and prevent LARP7 downregulation, thereby sustaining SIRT1 activity and restraining p53-driven cellular senescence during the DNA damage response."]}
{"disease": "progeria syndrome", "core_genes": ["LMNA mutations"], "hypotheses": ["PPP2CA activation attenuates progerin-induced vascular pathology in HGPS by enhancing MST1/2-dependent YAP/TAZ phosphorylation and cytoplasmic retention, as confirmed by reduced EndMT (e.g., decreased αSMA, SNAIL), lowered fibrotic markers (e.g., COL1A1, FN1), and improved vascular reactivity in experimental models."]}
{"disease": "senolytic drug mechanisms", "core_genes": ["BCL-2 family proteins"], "hypotheses": ["Activation of EGR1 in hepatic senescent cells enhances BAX-driven apoptosis and, when combined with BCL-2/BCL-xL-targeting senolytics, reduces senescent cell burden and tumor incidence, potentially restoring liver function in metabolic dysfunction-associated steatotic liver disease models."]}
{"disease": "cystic fibrosis", "core_genes": ["CFTR F508del mutation"], "hypotheses": ["Combining HSPA1A upregulation with USP1- or USP28-recruiting DUBTACs will synergistically enhance F508del-CFTR folding and stability, restoring chloride transport in patient-derived airway cells, and this synergy will demonstrate safety and efficacy in preclinical CF animal models."]}
{"disease": "Pompe disease", "core_genes": ["GAA gene", "enzyme replacement therapy"], "hypotheses": ["Upregulation of EP300 and inhibition of GYS1, tested individually and in combination in Pompe disease muscle models with mechanistic and phenotypic readouts, will reveal whether their synergistic action on autophagic flux and glycogen reduction surpasses either intervention alone in reversing muscle pathology."]}
{"disease": "spinal muscular atrophy", "core_genes": ["SMN1 gene deletion"], "hypotheses": ["Reduced PPP2CA activity leads to hyperphosphorylation of spliceosomal proteins and dysregulation of the PPP2CA–CDK2 axis, which impairs SMN1-dependent spliceosome assembly and drives motor neuron degeneration in spinal muscular atrophy, highlighting CDK2 as a potential therapeutic target."]}
{"disease": "Morquio syndrome", "core_genes": ["GALNS enzyme deficiency"], "hypotheses": ["ISLR, through its redox-sensing function and direct interaction with cytoskeletal proteins, modulates chondrocyte lysosomal dynamics and may influence GALNS trafficking or stability, thereby altering glycosaminoglycan turnover and contributing to Morquio syndrome severity under oxidative stress."]}
{"disease": "Schwartz-Jampel syndrome", "core_genes": ["HSPG2 gene mutations"], "hypotheses": ["In HSPG2-deficient models of Schwartz-Jampel syndrome, REST inhibition will derepress EGR1, FOS, and SP1, leading to increased muscle excitability quantifiable by electromyography and RT-qPCR, with corresponding improvements in myotonia severity as measured by standardized motor function assays."]}
{"disease": "myotonic dystrophy", "core_genes": ["DMPK gene expansion"], "hypotheses": ["EP300 integrates nutrient sensing and PP2A-mediated signaling to coordinate mTORC1-driven autophagy with DMPK-dependent MBNL1 sequestration, thereby linking metabolic status to both RNA splicing and autophagy defects in myotonic dystrophy type 1 pathogenesis."]}
{"disease": "Fukuyama congenital muscular dystrophy", "core_genes": ["FKTN gene mutations"], "hypotheses": ["B4GAT1 confines FKTN-mediated α-dystroglycan glycosylation to the trans-Golgi, and its loss leads to altered matriglycan chain length and subcellular mislocalization, which can be empirically tracked by glycan mass spectrometry, Golgi marker imaging, and membrane integrity assays in FCMD models."]}
{"disease": "X-linked adrenoleukodystrophy", "core_genes": ["ABCD1 gene mutations"], "hypotheses": ["PPP2CA modulates phosphorylation of NRF1 in human neural or glial cell models, thereby regulating ABCD1 expression and peroxisomal β-oxidation, which in turn alters VLCFA accumulation and neurodegeneration severity in X-linked adrenoleukodystrophy."]}
{"disease": "malignant infantile osteopetrosis", "core_genes": ["TCIRG1 gene defects"], "hypotheses": ["Pharmacological inhibition of ARHGEF1 or its downstream microvesicle biogenesis pathways may counteract EGR1-driven osteoclast dysfunction in TCIRG1-deficient osteopetrosis, offering a feasible translational strategy to restore bone resorption and reduce osteosclerosis in affected patients."]}
{"disease": "X-linked retinitis pigmentosa", "core_genes": ["RPGR gene mutations"], "hypotheses": ["Conditional knockout of CTCF or NURF-specific subunits in photoreceptors disrupts chromatin accessibility at RPGR-regulated ciliary trafficking genes, directly impairing ciliary protein localization and accelerating degeneration in X-linked retinitis pigmentosa, an effect reversible by targeted chromatin remodeler rescue."]}
{"disease": "metabolic health regulation", "core_genes": ["Akkermansia muciniphila"], "hypotheses": ["Akkermansia muciniphila enrichment enhances PYY-NPY2R signaling in the gut, improving glucose tolerance and reducing adiposity, while also modulating reproductive hormone expression via gut-brain axis crosstalk potentially mediated by BDNF and serotonin pathways."]}
{"disease": "microbiota-gut-brain axis", "core_genes": ["Bacteroides fragilis polysaccharide A"], "hypotheses": ["Polysaccharide A from Bacteroides fragilis, when delivered in gnotobiotic mouse models, orchestrates IL2-EGR1-STAT1 signaling in regulatory T cells, leading to suppression of CNS neuroinflammation through a gut-brain immune axis that could be dynamically influenced by bacteriophage-mediated PSA expression modulation."]}
{"disease": "antibiotic-associated colitis", "core_genes": ["Clostridioides difficile toxin B"], "hypotheses": ["PPP2CA activation suppresses STAT3-driven pro-inflammatory signaling induced by Clostridioides difficile Toxin B and, through dephosphorylation of spliceosome and cell cycle regulatory proteins (e.g., SRSF and CDK2 phosphorylation states), restores epithelial integrity and reduces colonic tissue damage in severe colitis."]}
{"disease": "immune system modulation", "core_genes": ["Lactobacillus rhamnosus GG"], "hypotheses": ["Lactobacillus rhamnosus GG administration in periodontitis upregulates SOCS3 in macrophages, which not only suppresses JAK-STAT but may also disrupt MET-EGFR crosstalk, thereby synergistically attenuating proinflammatory and pro-angiogenic signaling and promoting tissue repair."]}
{"disease": "rheumatoid arthritis", "core_genes": ["Prevotella copri"], "hypotheses": ["Prevotella copri enrichment in the gut drives PRKCA-mediated signaling in intestinal immune cells, facilitating pathogenic crosstalk with CD53 and GSK3B, which collectively intensify gut-joint axis inflammation and may serve as a novel mechanistic link to rheumatoid arthritis exacerbation."]}
{"disease": "intestinal barrier function", "core_genes": ["butyrate-producing bacteria"], "hypotheses": ["PHYHIP modulates TTR's signaling axis with TNFSF4/TRAF2, which in turn alters PPP2CA-mediated phosphorylation events to fine-tune FFAR2/3-dependent butyrate responses, ultimately orchestrating intestinal barrier stability and adaptive immune regulation during microbiome shifts."]}
{"disease": "periodontal disease and cardiovascular risk", "core_genes": ["Porphyromonas gingivalis"], "hypotheses": ["Porphyromonas gingivalis infection triggers TNFSF4-mediated inflammatory signaling in hepatocytes, leading to PPP2CA inhibition and caveolin-1-driven ABCA1 lysosomal mislocalization, ultimately activating mTORC1 and promoting hepatic cholesterol accumulation and atherosclerosis."]}
{"disease": "obesity and insulin resistance", "core_genes": ["Firmicutes/Bacteroidetes ratio"], "hypotheses": ["An elevated Firmicutes/Bacteroidetes ratio induces oxidative stress and bile acid dysregulation that perturb FXR1-mediated cytoskeletal signaling in hepatocytes, favoring senescent cell accumulation and impairing insulin responsiveness, thus potentiating obesity-driven insulin resistance through a gut-liver axis feedback loop."]}
{"disease": "intestinal permeability", "core_genes": ["zonulin protein"], "hypotheses": ["Activation of PRKCI enhances bicellular tight junction assembly via PI3K/AKT/mTOR signaling to mitigate zonulin-driven intestinal permeability and inflammation, potentially offering a targeted therapeutic approach for disorders such as inflammatory bowel disease and disorders of gut-brain interaction characterized by barrier dysfunction."]}
{"disease": "anti-inflammatory effects", "core_genes": ["Faecalibacterium prausnitzii"], "hypotheses": ["Faecalibacterium prausnitzii KBL1027 or its purified extracellular polysaccharides, by enhancing macrophage IL10RA/IL10RB expression and L-ornithine production, disrupt Th17 stabilization and promote regulatory T cell expansion, collectively suppressing cGAS-driven inflammation in inflammatory bowel disease."]}
{"disease": "pain management", "core_genes": ["CYP2D6 polymorphisms", "codeine metabolism"], "hypotheses": ["We hypothesize that altered CD81 expression in CYP2D6 poor metabolizers regulates endocytosis-independent exosome release, which in turn modulates neuronal uptake and signaling of codeine-derived metabolites—a relationship testable in co-culture or in vivo models using tagged exosomes and opioid receptor activity readouts."]}
{"disease": "lung cancer monitoring", "core_genes": ["ctDNA", "EGFR T790M mutation"], "hypotheses": ["ctDNA-detected gain-of-function PIK3R1 alterations cooperate with EGFR T790M to drive resistance to early-generation EGFR TKIs in NSCLC, partly by enabling miR-345/498–PIK3R1–AKT and PIK3R1–VAV3 pathways that collectively promote pro-survival signaling and immune evasion within the tumor microenvironment."]}
{"disease": "hereditary breast cancer", "core_genes": ["BRCA1/2 germline mutations"], "hypotheses": ["BRCA1 loss-of-function disrupts its interaction with EGR1, leading to sequential upregulation of NNMT, increased lactate-mediated histone lactylation, and subsequent MYC-dependent transcriptional activation and proliferation in hereditary breast cancer—a pathway that can be interrogated using protein interaction, epigenetic, metabolic, and functional assays."]}
{"disease": "immunotherapy patient selection", "core_genes": ["PD-L1 tumor proportion score"], "hypotheses": ["TTR overexpression in NSCLC interacts with PIK3R1 to activate the PI3K pathway, resulting in reduced PD-L1 tumor proportion score and diminished immune checkpoint inhibitor efficacy, a relationship that can be directly tested in molecular and cellular models."]}
{"disease": "abacavir hypersensitivity prevention", "core_genes": ["HLA-B*5701 allele"], "hypotheses": ["Abacavir exposure sequentially activates SP1 and EGR1 to upregulate HSP90AB1, which, in cooperation with PPP2CA and CDK2, destabilizes HLA-B*5701-peptide complexes, potentiating mechanotransduction-dependent T-cell activation and thereby intensifying hypersensitivity reactions."]}
{"disease": "predictive biomarker for sotorasib response", "core_genes": ["KRAS G12C mutation"], "hypotheses": ["Increased CALM1 expression induces coordinated changes in MYC- and CTCF-regulated chromatin accessibility and gene expression signatures, driving ctDNA-detectable MAPK pathway reactivation and sotorasib resistance in KRAS G12C-mutant NSCLC."]}
{"disease": "cardiovascular risk stratification", "core_genes": ["CRP elevation"], "hypotheses": ["PHYHIP drives coronary atherosclerosis by modulating TTR and HNRNPA1 protein complexes, altering TNFSF4/TRAF2-NFκB axis activity and resulting in measurable increases in CRP and endothelial dysfunction, with each step offering assayable biomarkers for experimental validation."]}
{"disease": "prostate cancer early detection", "core_genes": ["PSA isoforms"], "hypotheses": ["In aggressive prostate cancer, altered HLA-A expression may reshape the PSA isoform immunopeptidome—potentially including cryptic or aberrant translation products—thereby affecting tumor immunogenicity and enabling immune-based stratification strategies testable by advanced immunopeptidomics."]}
{"disease": "acute myocardial infarction diagnosis", "core_genes": ["Troponin I kinetics"], "hypotheses": ["REG3A-driven modulation of EGFR- or Akt-mTOR-mediated inflammatory signaling after acute myocardial infarction alters cTnI release kinetics, and targeted manipulation of REG3A could enhance early diagnostic accuracy and individualized risk stratification in AMI by refining cTnI-based clinical algorithms."]}
{"disease": "diabetes management", "core_genes": ["HbA1c levels"], "hypotheses": ["VCAM1-induced NF-κB activation drives C/EBPα-mediated mitochondrial biogenesis in immune cells, increasing STING pathway–dependent inflammation, which elevates endothelial permeability and disrupts glucose homeostasis, thereby raising HbA1c levels and promoting microvascular complications in diabetes through a unified inflammatory-metabolic axis."]}
