{"disease": "breast and ovarian cancer", "core_genes": ["BRCA1", "homologous recombination repair", "PARP inhibitor resistance"], "hypotheses": ["EGR1 upregulation enhances BRCA1-mediated homologous recombination repair, promoting resistance to PARP inhibitors in BRCA1-deficient breast and ovarian cancer cells."]}
{"disease": "cancer (wild-type p53)", "core_genes": ["p53", "MDM2"], "hypotheses": ["Pharmacologic inhibition of MDM2 combined with PPP2CA activation enhances p53-mediated GSDME-dependent pyroptosis in wild-type p53 cancers by synergistically amplifying ROS-NLRP3 inflammasome signaling."]}
{"disease": "colorectal cancer", "core_genes": ["KRAS G12C"], "hypotheses": ["Inhibition of CALM1 suppresses KRAS G12C-mediated RAS-MAPK signaling, thereby reducing proliferation and enhancing sensitivity to EGFR inhibitors in colorectal cancer cells."]}
{"disease": "cancer", "core_genes": ["EGFR L858R", "tyrosine kinase inhibitor sensitivity"], "hypotheses": ["Inhibition of PPP2CA enhances the stability of mutant EGFR L858R/Y891D, thereby promoting resistance to tyrosine kinase inhibitors in non-small cell lung cancer cells."]}
{"disease": "cancer immune escape", "core_genes": ["PD-L1", "JAK-STAT"], "hypotheses": ["SLC15A1 enhances JAK1-dependent PD-L1 expression in tumor cells, thereby promoting immune escape within the tumor microenvironment."]}
{"disease": "gastric cancer", "core_genes": ["HER2", "trastuzumab resistance"], "hypotheses": ["PPP2CA activation suppresses CDC42-mediated GLS1 expression, thereby reducing M2 macrophage polarization and overcoming trastuzumab resistance in HER2-positive gastric cancer."]}
{"disease": "B-cell malignancy", "core_genes": ["CD19", "CAR-T cell", "cytokine release syndrome biomarkers"], "hypotheses": ["EGR1 upregulation in CD19-expressing B-cell malignancies enhances CAR-T cell-induced cytokine release by promoting IL-18 signaling, thereby exacerbating cytokine release syndrome severity."]}
{"disease": "glioblastoma", "core_genes": ["VEGF-A", "VEGFR2"], "hypotheses": ["PPP2CA inhibits EGR1-mediated upregulation of VEGFA, thereby suppressing angiogenesis and tumor progression in glioblastoma."]}
{"disease": "cancer-associated fibroblasts", "core_genes": ["TNF-α", "NF-κB"], "hypotheses": ["EGR1 activation in cancer-associated fibroblasts enhances TNF-α–induced NF-κB signaling, thereby promoting an inflammatory CAF phenotype that supports immune evasion and metastasis."]}
{"disease": "PI3K/PTEN-deficient tumors", "core_genes": ["mTOR complex 1", "hyperactivation"], "hypotheses": ["PPP2CA activation suppresses mTORC1-driven HMOX1hi macrophage expansion, thereby reducing immune evasion in PI3K/PTEN-deficient tumors."]}
{"disease": "Parkinson's disease", "core_genes": ["LRRK2 G2019S", "mitochondrial dynamics"], "hypotheses": ["GSK3B activation enhances LRRK2 G2019S-induced Drp1-mediated mitochondrial fission, thereby exacerbating mitochondrial dysfunction and neurodegeneration in Parkinson’s disease."]}
{"disease": "Parkinson's disease", "core_genes": ["α-synuclein A53T", "aggregation", "neuroinflammation"], "hypotheses": ["EGR1 upregulation enhances IL1B-mediated microglial activation, thereby amplifying neuroinflammation and accelerating dopaminergic neuron loss in α-synuclein A53T Parkinson’s disease models."]}
{"disease": "Alzheimer's disease", "core_genes": ["APOE4", "amyloid-β clearance"], "hypotheses": ["Activation of PPP2CA enhances LRP1-mediated amyloid-β clearance in APOE4-expressing microglia, thereby mitigating neurodegeneration in Alzheimer’s disease."]}
{"disease": "frontotemporal dementia", "core_genes": ["Tau R406W"], "hypotheses": ["PPP2CA activation suppresses R406W mutant tau-induced neurotoxicity in frontotemporal dementia by inhibiting CDK5-mediated tau hyperphosphorylation."]}
{"disease": "Alzheimer's disease", "core_genes": ["TREM2", "microglia", "neuroinflammation"], "hypotheses": ["PHYHIP modulates TREM2-dependent microglial metabolic reprogramming via the TTR–PPP2CA axis, thereby regulating neuroinflammation and amyloid clearance in Alzheimer’s disease."]}
{"disease": "Lewy body diseases", "core_genes": ["GBA1", "lysosomal dysfunction"], "hypotheses": ["TRIM14 upregulation enhances STING1-mediated neuroinflammation in the context of GBA1 deficiency, thereby accelerating α-synuclein aggregation and dopaminergic neurodegeneration in Lewy body diseases."]}
{"disease": "amyotrophic lateral sclerosis (ALS)", "core_genes": ["NEFL", "axonal degeneration"], "hypotheses": ["PPP2CA modulates NEFL phosphorylation status, thereby regulating axonal stability and influencing the progression of motor neuron degeneration in amyotrophic lateral sclerosis."]}
{"disease": "Parkinson's disease", "core_genes": ["c-Abl kinase", "dopaminergic neuronal death"], "hypotheses": ["TRIM14 enhances c-Abl–mediated phosphorylation of PARIS, thereby promoting mitochondrial dysfunction and accelerating dopaminergic neuronal death in Parkinson’s disease."]}
{"disease": "neurodegeneration", "core_genes": ["CLOCK gene", "circadian rhythm"], "hypotheses": ["GSK3B activation suppresses CLOCK-mediated regulation of autophagy in astrocytes, thereby accelerating neurodegeneration in Parkinson’s disease models."]}
{"disease": "multiple sclerosis", "core_genes": ["neurofilament light chain (NFL)"], "hypotheses": ["Upregulation of MMP13 enhances neurofilament light chain (NFL) release, thereby promoting neuroaxonal injury and accelerating disease progression in multiple sclerosis."]}
{"disease": "metabolic syndrome", "core_genes": ["GLP-1 receptor agonist", "AMPK signaling"], "hypotheses": ["FGF9 activation enhances AMPK signaling in perivascular adipose tissue, thereby reducing endothelial dysfunction and improving metabolic parameters in metabolic syndrome."]}
{"disease": "diabetic cardiomyopathy", "core_genes": ["SGLT2 inhibitor", "ketogenesis"], "hypotheses": ["Upregulation of HMGCS2 in cardiomyocytes enhances SIRT1-mediated autophagic flux, thereby suppressing oxidative stress and senescence in diabetic cardiomyopathy."]}
{"disease": "obesity-induced insulin resistance", "core_genes": ["GIP receptor", "GLP-1"], "hypotheses": ["PPP2CA modulates GIPR-mediated SERCA-dependent calcium cycling in adipocytes, thereby regulating lipid oxidation and influencing the development of obesity-induced insulin resistance."]}
{"disease": "metabolic syndrome", "core_genes": ["UCP1", "brown adipose tissue", "thermogenesis"], "hypotheses": ["PHYHIP activation enhances UCP2 and UCP3 expression in brown adipose tissue, thereby promoting thermogenesis and improving metabolic outcomes in metabolic syndrome."]}
{"disease": "type 2 diabetes", "core_genes": ["IRS-1", "serine phosphorylation"], "hypotheses": ["CSNK2B-mediated phosphorylation of IRS-1 enhances serine phosphorylation, thereby inhibiting PI3K/AKT pathway activation and exacerbating insulin resistance in type 2 diabetes."]}
{"disease": "congenital leptin deficiency", "core_genes": ["LEPR gene"], "hypotheses": ["CSNK2B modulates LEPR-mediated hypothalamic signaling, and its dysregulation exacerbates hyperphagia and metabolic imbalance in congenital leptin deficiency."]}
{"disease": "congenital hypothyroidism", "core_genes": ["TPO gene"], "hypotheses": ["TRIM38 loss-of-function mutations suppress residual TPO enzymatic activity, thereby exacerbating thyroid hormone deficiency severity in congenital hypothyroidism independent of thyroid gland localization."]}
{"disease": "hepatic glucose production", "core_genes": ["GCGR antagonism"], "hypotheses": ["GCGR antagonism suppresses hepatic glucose production by modulating TGM2 activity, thereby reducing gluconeogenic flux and ameliorating hyperglycemia in metabolic liver disease."]}
{"disease": "medium-chain acyl-CoA dehydrogenase disorders", "core_genes": ["ACADM deficiency"], "hypotheses": ["Disruption of ACADM enhances sequestration of CoA, which in turn suppresses ETFA-mediated electron transfer activity, exacerbating mitochondrial dysfunction during metabolic stress in affected tissues."]}
{"disease": "mitochondrial diabetes", "core_genes": ["TFAM gene"], "hypotheses": ["EGR1 interaction with TFAM represses mitochondrial biogenesis in diabetic cardiomyopathy, thereby exacerbating mitochondrial dysfunction and progression of cardiac complications in mitochondrial diabetes."]}
{"disease": "familial hypercholesterolemia", "core_genes": ["PCSK9 inhibition", "LDL receptor recycling"], "hypotheses": ["PPP2CA activation modulates SNX17-mediated LDLR recycling, thereby enhancing the efficacy of PCSK9 inhibition in reducing LDL-cholesterol in familial hypercholesterolemia."]}
{"disease": "atherosclerosis", "core_genes": ["NLRP3 inflammasome", "plaque formation"], "hypotheses": ["SMARCA5 modulates NLRP3 inflammasome activation in vascular macrophages, thereby regulating IL-1β and IL-18 maturation and influencing plaque vulnerability in atherosclerosis."]}
{"disease": "cardiac fibrosis and heart failure", "core_genes": ["TGF-β1 signaling"], "hypotheses": ["EIF3I enhances TGF-β1-induced fibroblast activation by stabilizing TGFB1 protein, thereby promoting cardiac fibrosis progression in heart failure."]}
{"disease": "vascular aging", "core_genes": ["eNOS uncoupling", "endothelial dysfunction"], "hypotheses": ["Activation of NOX4 enhances oxidative stress, thereby promoting eNOS uncoupling and accelerating endothelial senescence during vascular aging."]}
{"disease": "heart failure with preserved ejection fraction", "core_genes": ["BNP elevation"], "hypotheses": ["LAMP1 upregulation in epicardial adipose tissue promotes local inflammation that elevates BNP expression and exacerbates diastolic dysfunction in heart failure with preserved ejection fraction."]}
{"disease": "cardiomyocyte regeneration", "core_genes": ["GATA4 transcription factor"], "hypotheses": ["EP300 enhances GATA4-mediated activation of connexin 43 expression, thereby promoting sarcomere organization and functional maturation during cardiomyocyte regeneration."]}
{"disease": "vascular smooth muscle cell proliferation", "core_genes": ["PDGF-BB signaling"], "hypotheses": ["PPP2CA suppresses PDGF-BB-induced vascular smooth muscle cell proliferation by dephosphorylating and inactivating ELK1 and KLF4 downstream of PDGFB signaling."]}
{"disease": "vascular calcification", "core_genes": ["Runx2 transcription factor"], "hypotheses": ["PPP2CA inhibits vascular calcification by promoting dephosphorylation and subsequent degradation of RUNX2 in vascular smooth muscle cells."]}
{"disease": "hypertension-induced cardiac remodeling", "core_genes": ["ACE2", "Ang-(1-7) axis"], "hypotheses": ["PPP2CA activation enhances ACE2-mediated Ang-(1-7) signaling, thereby suppressing TGF-β-driven myocardial fibrosis in hypertension-induced cardiac remodeling."]}
{"disease": "cardiac metabolic reprogramming", "core_genes": ["SIRT1 deacetylase activity"], "hypotheses": ["SIRT1 deacetylase activity suppresses EGR1-mediated transcriptional responses, thereby attenuating oxidative stress-induced cardiac fibrosis during metabolic reprogramming."]}
{"disease": "regulatory T cell dysfunction", "core_genes": ["FOXP3 expression stability"], "hypotheses": ["VAV3 enhances FOXP3 expression stability in regulatory T cells by modulating intracellular ROS levels, thereby preserving Treg suppressive function during autoimmune hepatitis."]}
{"disease": "systemic lupus erythematosus", "core_genes": ["IRF7", "type I interferon signaling"], "hypotheses": ["SUMO1-mediated sumoylation of IRF7 suppresses IRF7-driven B cell differentiation into plasma cells, thereby attenuating autoantibody production and inflammation in systemic lupus erythematosus."]}
{"disease": "Th17 cell differentiation", "core_genes": ["RORγt transcription factor"], "hypotheses": ["EIF3I binding to RORγt enhances RORγt-mediated transcriptional activation, thereby promoting Th17 cell differentiation and increasing susceptibility to Th17-driven inflammation."]}
{"disease": "B cell tolerance breakdown", "core_genes": ["CD20 expression loss"], "hypotheses": ["Loss of CD20 expression induces defective B cell activation by disrupting CD19-associated PI3K signaling, thereby promoting breakdown of B cell tolerance in autoimmune and malignant contexts."]}
{"disease": "rheumatoid arthritis", "core_genes": ["C5aR1 complement receptor"], "hypotheses": ["C5AR1 physically interacts with PRKCB to enhance osteoclastogenesis, thereby promoting bone erosion in rheumatoid arthritis."]}
{"disease": "autoinflammatory disease pathogenesis", "core_genes": ["NLRP3 inflammasome priming"], "hypotheses": ["PRKACA phosphorylates NLRP3 to enhance its priming, thereby increasing IL-1β secretion and promoting autoinflammatory disease severity in NLRP3 gain-of-function contexts."]}
{"disease": "tissue-resident memory T cells", "core_genes": ["CD69 expression"], "hypotheses": ["EP300 acetyltransferase activity enhances CD69-mediated tissue residency programming in TRM cells by promoting transcriptional activation of metabolic pathways linked to the glutamine/polyamine/hypusine axis."]}
{"disease": "autoimmune polyglandular syndrome", "core_genes": ["AIRE gene mutations"], "hypotheses": ["AIRE mutations disrupt interaction with HDAC2, thereby impairing epigenetic regulation of tissue-specific antigen expression and promoting autoreactive T cell survival in autoimmune polyglandular syndrome type 1."]}
{"disease": "autoimmune disease susceptibility", "core_genes": ["CTLA-4 polymorphisms"], "hypotheses": ["CTLA-4 polymorphisms diminish inhibitory signaling to PIK3R1, thereby enhancing T cell activation and increasing susceptibility to pediatric systemic lupus erythematosus."]}
{"disease": "microbiome-mediated immune development", "core_genes": ["TLR4 signaling"], "hypotheses": ["ETS1 modulates TLR4-mediated B-cell activation, thereby enhancing aberrant IgA1 glycosylation in response to gut microbiome dysbiosis during early immune development."]}
{"disease": "carbapenem resistance", "core_genes": ["NDM-1 metallo-β-lactamase"], "hypotheses": ["CD81 expression modulates susceptibility to meropenem in NDM-1-producing Gram-negative bacteria by altering membrane permeability and thereby influences carbapenem resistance levels."]}
{"disease": "COVID-19", "core_genes": ["SARS-CoV-2 spike protein D614G", "viral fitness"], "hypotheses": ["SP1 upregulation enhances FURIN expression, thereby increasing S1/S2 cleavage efficiency of the SARS-CoV-2 D614G spike protein and promoting higher viral entry and replication in human airway epithelia."]}
{"disease": "tuberculosis", "core_genes": ["ESX-1 secretion system", "Mycobacterium tuberculosis virulence"], "hypotheses": ["Upregulation of PBX1 in macrophages promotes ESX-1-mediated phagosomal rupture, thereby enhancing Mycobacterium tuberculosis cytosolic escape and increasing pulmonary tuberculosis severity."]}
{"disease": "azole-resistant Aspergillus fumigatus", "core_genes": ["CYP51A gene mutations"], "hypotheses": ["Upregulation of SREBF1 enhances CYP51A1 expression, thereby promoting azole resistance in Aspergillus fumigatus through increased lanosterol 14-α-demethylase abundance."]}
{"disease": "influenza", "core_genes": ["memory B cell", "BCR affinity maturation"], "hypotheses": ["MYC activation enhances BCR affinity maturation in germinal center B cells, thereby increasing the breadth of memory B cell responses to antigenically drifted influenza viruses."]}
{"disease": "bacterial biofilm formation", "core_genes": ["FtsZ protein inhibition"], "hypotheses": ["Quercetin inhibits FtsZ-mediated cell division, thereby suppressing biofilm formation and reducing virulence in gram-negative bacterial infections."]}
{"disease": "hepatitis B virus drug resistance", "core_genes": ["HBV polymerase L180M", "entecavir resistance"], "hypotheses": ["Upregulation of ENO3 in HBV-infected hepatocytes modulates entecavir susceptibility by altering HBV polymerase conformation and diminishing the impact of the L180M resistance mutation."]}
{"disease": "chronic viral infections", "core_genes": ["CD8+ T cell exhaustion markers"], "hypotheses": ["PPP2CA modulates mTOR-mediated differentiation of CD8+ T cells, thereby enhancing the expression of exhaustion markers CTLA-4 and CD160 during chronic viral infection."]}
{"disease": "malaria", "core_genes": ["PfEMP1 protein", "Plasmodium falciparum immune evasion"], "hypotheses": ["Increased serum bile acid concentration modulates PfEMP1-mediated endothelial adhesion, thereby enhancing microvascular sequestration and severity in Plasmodium falciparum malaria."]}
{"disease": "bacteriophage host specificity", "core_genes": ["phage tail fibers"], "hypotheses": ["Engineering bacteriophage tail fiber genes to display amyloid fiber–binding motifs promotes selective attachment to bacteria with surface-associated amyloid structures, thereby expanding phage host range."]}
{"disease": "cellular senescence", "core_genes": ["p16INK4a expression"], "hypotheses": ["KAT5-mediated acetylation enhances p16INK4A (CDKN2A) expression under mitochondrial metabolic stress, promoting senescence that is further exacerbated by autophagy impairment."]}
{"disease": "telomere maintenance disorders", "core_genes": ["TERT promoter mutations"], "hypotheses": ["MYC overexpression enhances the compensatory effect of TERT promoter mutations by upregulating TERT transcription, thereby improving telomere maintenance in hematopoietic cells with telomere maintenance disorders."]}
{"disease": "mitochondrial quality control", "core_genes": ["PINK1", "Parkin pathway"], "hypotheses": ["NEDD8 conjugation modulates PINK1 stability, thereby enhancing Parkin-mediated mitophagy and reducing oxidative stress-induced cell death in neurons."]}
{"disease": "inflammaging", "core_genes": ["SASP factor", "IL-6 secretion"], "hypotheses": ["RBM25 modulates IL-6 secretion in senescent vascular smooth muscle cells by regulating splicing of cGAS-STING pathway components, thereby promoting inflammaging-associated tissue dysfunction."]}
{"disease": "epigenetic aging", "core_genes": ["EPAS1 gene methylation"], "hypotheses": ["Hypermethylation of EPAS1 suppresses its interaction with EGFR, thereby impairing hypoxia-induced metabolic reprogramming and accelerating epigenetic aging in human tissues."]}
{"disease": "mitochondrial aging", "core_genes": ["SIRT3 deacetylase activity"], "hypotheses": ["SIRT3 deacetylase activity represses EGR1-mediated transcriptional activation of pro-senescent genes, thereby attenuating mitochondrial aging and cellular senescence."]}
{"disease": "stem cell senescence", "core_genes": ["LIN28A expression"], "hypotheses": ["SIN3A interaction with LIN28A represses LIN28A-mediated activation of mitochondrial oxidative phosphorylation, thereby accelerating stem cell senescence and reducing regenerative capacity."]}
{"disease": "DNA damage response aging", "core_genes": ["ATM kinase activation"], "hypotheses": ["TAF1 interaction with ATM kinase modulates ATM-dependent p53 activation, thereby regulating cellular senescence and tissue aging in response to persistent DNA damage."]}
{"disease": "progeria syndrome", "core_genes": ["LMNA mutations"], "hypotheses": ["Progerin accumulation in progeria syndrome suppresses MYC-mediated transcriptional programs, thereby enhancing cellular senescence and impairing tissue regeneration in affected mesenchymal cells."]}
{"disease": "senolytic drug mechanisms", "core_genes": ["BCL-2 family proteins"], "hypotheses": ["Mycophenolic acid suppresses BCL2L1-dependent apoptotic resistance, thereby enhancing the senolytic efficacy of BCL-xL inhibition in senescent cells."]}
{"disease": "cystic fibrosis", "core_genes": ["CFTR F508del mutation"], "hypotheses": ["PPP2CA activation enhances CFTR F508del correction by promoting proper folding and trafficking of the mutant protein in airway epithelial cells."]}
{"disease": "Pompe disease", "core_genes": ["GAA gene", "enzyme replacement therapy"], "hypotheses": ["EP300 modulates GAA gene expression in muscle cells, and pharmacological activation of EP300 enhances the efficacy of enzyme replacement therapy in Pompe disease by improving lysosomal glycogen clearance."]}
{"disease": "spinal muscular atrophy", "core_genes": ["SMN1 gene deletion"], "hypotheses": ["CUL3 upregulation enhances degradation of proteins involved in spliceosome assembly, thereby exacerbating motor neuron degeneration in SMN1-deficient spinal muscular atrophy."]}
{"disease": "Morquio syndrome", "core_genes": ["GALNS enzyme deficiency"], "hypotheses": ["ISLR interaction with GALNS modulates glycosaminoglycan accumulation, thereby influencing cartilage integrity and the severity of skeletal dysplasia in Morquio syndrome."]}
{"disease": "Schwartz-Jampel syndrome", "core_genes": ["HSPG2 gene mutations"], "hypotheses": ["Reduced HSPG2 function disrupts perlecan-mediated regulation of REST activity, thereby enhancing abnormal neuromuscular excitability and contributing to myotonia in Schwartz-Jampel syndrome."]}
{"disease": "myotonic dystrophy", "core_genes": ["DMPK gene expansion"], "hypotheses": ["Altered PPP2CA activity modulates MBNL1 sequestration by toxic DMPK RNA, thereby exacerbating alternative splicing defects in myotonic dystrophy type 1."]}
{"disease": "Fukuyama congenital muscular dystrophy", "core_genes": ["FKTN gene mutations"], "hypotheses": ["Disruption of the FKTN–B4GAT1 protein interaction reduces α-dystroglycan glycosylation efficiency, exacerbating muscle and neuronal dysfunction in Fukuyama congenital muscular dystrophy."]}
{"disease": "X-linked adrenoleukodystrophy", "core_genes": ["ABCD1 gene mutations"], "hypotheses": ["BSG physically interacts with ABCD1 and modulates VLCFA import into peroxisomes, thereby influencing the extent of neuroinflammation and demyelination in X-linked adrenoleukodystrophy."]}
{"disease": "malignant infantile osteopetrosis", "core_genes": ["TCIRG1 gene defects"], "hypotheses": ["PPP2CA activity modulates TCIRG1-dependent osteoclast acidification, and its inhibition exacerbates impaired bone resorption in malignant infantile osteopetrosis."]}
{"disease": "X-linked retinitis pigmentosa", "core_genes": ["RPGR gene mutations"], "hypotheses": ["CTCF physically interacts with RPGR to regulate photoreceptor-specific gene expression, and disruption of this interaction exacerbates photoreceptor degeneration in X-linked retinitis pigmentosa."]}
{"disease": "metabolic health regulation", "core_genes": ["Akkermansia muciniphila"], "hypotheses": ["Akkermansia muciniphila abundance suppresses TLR4-mediated SMAD3 activation in intestinal epithelial cells, thereby reducing downstream pro-inflammatory signaling and improving metabolic health outcomes."]}
{"disease": "microbiota-gut-brain axis", "core_genes": ["Bacteroides fragilis polysaccharide A"], "hypotheses": ["Bacteroides fragilis polysaccharide A enhances neuroimmune homeostasis by activating STAT1-PI4KA protein interactions, thereby reducing neuroinflammation-associated alterations in brain network architecture."]}
{"disease": "antibiotic-associated colitis", "core_genes": ["Clostridioides difficile toxin B"], "hypotheses": ["PIK3R1 activation enhances STAT3-mediated inflammatory signaling in colonic epithelial cells exposed to Clostridioides difficile Toxin B, thereby exacerbating tissue damage in antibiotic-associated colitis."]}
{"disease": "immune system modulation", "core_genes": ["Lactobacillus rhamnosus GG"], "hypotheses": ["Lactobacillus rhamnosus GG administration induces SOCS3-mediated inhibition of EGFR signaling in macrophages, thereby suppressing IL1B production and attenuating inflammation in periodontitis."]}
{"disease": "rheumatoid arthritis", "core_genes": ["Prevotella copri"], "hypotheses": ["Prevotella copri abundance enhances the release of extracellular exosomes carrying pro-inflammatory signals, thereby promoting systemic immune activation and exacerbating rheumatoid arthritis severity."]}
{"disease": "intestinal barrier function", "core_genes": ["butyrate-producing bacteria"], "hypotheses": ["PHYHIP modulates intestinal barrier integrity by regulating TTR-mediated signaling to PPP2CA, which in turn influences FFAR2/FFAR3 activity and tight junction protein expression."]}
{"disease": "periodontal disease and cardiovascular risk", "core_genes": ["Porphyromonas gingivalis"], "hypotheses": ["PHYHIP regulates ABCA1 expression via the TTR–PPP2CA axis, thereby modulating P. gingivalis-induced alterations in lipid metabolism and atherosclerosis risk during periodontitis."]}
{"disease": "obesity and insulin resistance", "core_genes": ["Firmicutes/Bacteroidetes ratio"], "hypotheses": ["Modulation of the Firmicutes/Bacteroidetes ratio regulates FOXO1 activity in hepatic tissue, thereby altering insulin sensitivity and lipid metabolism in the context of abdominal obesity."]}
{"disease": "intestinal permeability", "core_genes": ["zonulin protein"], "hypotheses": ["PRKCI enhances zonulin-mediated disruption of bicellular tight junction assembly, thereby promoting increased intestinal permeability and elevating colorectal cancer susceptibility."]}
{"disease": "anti-inflammatory effects", "core_genes": ["Faecalibacterium prausnitzii"], "hypotheses": ["Faecalibacterium prausnitzii extracellular vesicles enhance IL10 expression in macrophages by promoting SP1 and ETS1 activity, thereby suppressing cGAS-mediated inflammatory signaling in colitis."]}
{"disease": "pain management", "core_genes": ["CYP2D6 polymorphisms", "codeine metabolism"], "hypotheses": ["Altered expression of CD81 modulates codeine analgesic efficacy by influencing both codeine metabolic response and dihydrocodeine pharmacodynamics in individuals with CYP2D6 polymorphisms."]}
{"disease": "lung cancer monitoring", "core_genes": ["ctDNA", "EGFR T790M mutation"], "hypotheses": ["Lansoprazole administration modulates EGFR signaling activity in lung cancer cells harboring T790M mutations, thereby altering ctDNA EGFR T790M clearance kinetics during third-generation TKI therapy."]}
{"disease": "hereditary breast cancer", "core_genes": ["BRCA1/2 germline mutations"], "hypotheses": ["BRCA1 deficiency disrupts MYC-mediated cell cycle regulation, thereby enhancing proliferation and oncogenic transformation in hereditary breast cancer cells."]}
{"disease": "immunotherapy patient selection", "core_genes": ["PD-L1 tumor proportion score"], "hypotheses": ["IRF3 activation enhances PD-L1 expression in breast cancer cells, thereby increasing tumor immune evasion and reducing efficacy of immune checkpoint inhibitor therapy."]}
{"disease": "abacavir hypersensitivity prevention", "core_genes": ["HLA-B*5701 allele"], "hypotheses": ["Abacavir exposure induces HSP90AB1 upregulation in HLA-B*57:01-expressing keratinocytes, which in turn amplifies ER stress and enhances IL-1β-mediated pro-inflammatory signaling in abacavir hypersensitivity."]}
{"disease": "predictive biomarker for sotorasib response", "core_genes": ["KRAS G12C mutation"], "hypotheses": ["PPP2CB expression modulates sotorasib response by regulating KRAS G12C signaling, influencing ctDNA clearance dynamics and resistance development in non-small cell lung cancer."]}
{"disease": "cardiovascular risk stratification", "core_genes": ["CRP elevation"], "hypotheses": ["SERPINA4 suppresses CRP-induced endothelial dysfunction, thereby attenuating atherosclerotic plaque instability and reducing cardiovascular disease progression."]}
{"disease": "prostate cancer early detection", "core_genes": ["PSA isoforms"], "hypotheses": ["Finasteride treatment suppresses early increases in [-2]proPSA isoform levels by inhibiting androgen receptor signaling, thereby reducing biochemical recurrence risk in prostate cancer patients post-radical prostatectomy."]}
{"disease": "acute myocardial infarction diagnosis", "core_genes": ["Troponin I kinetics"], "hypotheses": ["REG3A upregulation accelerates cardiac troponin I clearance, thereby reducing the sensitivity of cTnI kinetics for acute myocardial infarction diagnosis in genetically susceptible individuals."]}
{"disease": "diabetes management", "core_genes": ["HbA1c levels"], "hypotheses": ["PTEN modulates HbA1c levels by altering HBA1 protein interactions, thereby influencing long-term glycemic control and diabetes complication risk."]}
