{"disease": "breast and ovarian cancer", "core_genes": ["BRCA1", "homologous recombination repair", "PARP inhibitor resistance"], "hypotheses": ["Upregulation of RAD51AP1 promotes homologous recombination repair restoration and mediates acquired resistance to PARP inhibitors in BRCA1-mutant breast and ovarian cancer cells."]}
{"disease": "cancer (wild-type p53)", "core_genes": ["p53", "MDM2"], "hypotheses": ["Pharmacological inhibition of MDM2 enhances wild-type p53-mediated induction of pro-apoptotic genes, thereby increasing apoptosis in cancer cells with MDM2 overexpression."]}
{"disease": "colorectal cancer", "core_genes": ["KRAS G12C"], "hypotheses": ["Pharmacological inhibition of PI3K/AKT signaling suppresses KRAS G12C-driven immune evasion in colorectal cancer by reducing secretion of pro-inflammatory cytokines from tumor cells."]}
{"disease": "cancer", "core_genes": ["EGFR L858R", "tyrosine kinase inhibitor sensitivity"], "hypotheses": ["Activation of the PI3K/AKT pathway by EGFR L858R mutation promotes upregulation of survival genes, which is selectively suppressed by tyrosine kinase inhibitor treatment in non-small cell lung cancer cells."]}
{"disease": "cancer immune escape", "core_genes": ["PD-L1", "JAK-STAT"], "hypotheses": ["Inhibition of JAK-STAT signaling in tumor-associated macrophages suppresses PD-L1 expression and restores cytotoxic T cell activity within the tumor microenvironment."]}
{"disease": "gastric cancer", "core_genes": ["HER2", "trastuzumab resistance"], "hypotheses": ["Upregulation of MET signaling induces epithelial-mesenchymal transition and promotes trastuzumab resistance in HER2-positive gastric cancer cells."]}
{"disease": "B-cell malignancy", "core_genes": ["CD19", "CAR-T cell", "cytokine release syndrome biomarkers"], "hypotheses": ["Upregulation of IL-6 signaling in CD19-targeted CAR-T cells amplifies cytokine release syndrome severity by enhancing downstream IFN-γ and TNF-α production in B-cell malignancy patients."]}
{"disease": "glioblastoma", "core_genes": ["VEGF-A", "VEGFR2"], "hypotheses": ["VEGFR2 activation in glioblastoma endothelial cells suppresses cytotoxic T lymphocyte infiltration by upregulating PD-L1 expression, thereby promoting immune evasion within the tumor microenvironment."]}
{"disease": "cancer-associated fibroblasts", "core_genes": ["TNF-α", "NF-κB"], "hypotheses": ["Inhibition of TNF-α-induced NF-κB activation in cancer-associated fibroblasts suppresses their secretion of pro-angiogenic cytokines, thereby reducing tumor angiogenesis and metastatic potential."]}
{"disease": "PI3K/PTEN-deficient tumors", "core_genes": ["mTOR complex 1", "hyperactivation"], "hypotheses": ["mTORC1 hyperactivation in PTEN-deficient tumors upregulates HIF-1α, which induces metabolic reprogramming that enhances resistance to apoptosis and promotes tumor angiogenesis."]}
{"disease": "Parkinson's disease", "core_genes": ["LRRK2 G2019S", "mitochondrial dynamics"], "hypotheses": ["Pharmacological inhibition of LRRK2 G2019S kinase activity restores mitochondrial fusion, thereby suppressing neuroinflammatory signaling and protecting dopaminergic neurons from degeneration in Parkinson’s disease."]}
{"disease": "Parkinson's disease", "core_genes": ["α-synuclein A53T", "aggregation", "neuroinflammation"], "hypotheses": ["Activation of NLRP3 inflammasome by A53T α-synuclein aggregates promotes microglial secretion of IL-1β, thereby accelerating dopaminergic neuron loss in Parkinson’s disease."]}
{"disease": "Alzheimer's disease", "core_genes": ["APOE4", "amyloid-β clearance"], "hypotheses": ["APOE4 expression suppresses astrocytic LDL receptor–related protein 1 (LRP1) function, thereby reducing amyloid-β clearance and promoting plaque accumulation in Alzheimer’s disease."]}
{"disease": "frontotemporal dementia", "core_genes": ["Tau R406W"], "hypotheses": ["TAU R406W mutation enhances neuroinflammatory signaling by upregulating microglial NLRP3 inflammasome activation, thereby accelerating neuronal loss in frontotemporal dementia."]}
{"disease": "Alzheimer's disease", "core_genes": ["TREM2", "microglia", "neuroinflammation"], "hypotheses": ["Upregulation of TREM2 in microglia suppresses neuroinflammation by inhibiting pro-inflammatory cytokine production, thereby reducing amyloid-beta–induced synaptic dysfunction in Alzheimer's disease."]}
{"disease": "Lewy body diseases", "core_genes": ["GBA1", "lysosomal dysfunction"], "hypotheses": ["Augmenting lysosomal biogenesis via TFEB activation ameliorates alpha-synuclein aggregation and reduces neuroinflammation in GBA1 mutant models of Lewy body diseases."]}
{"disease": "amyotrophic lateral sclerosis (ALS)", "core_genes": ["NEFL", "axonal degeneration"], "hypotheses": ["Overexpression of NEFL stabilizes axonal cytoskeleton and suppresses axonal degeneration in motor neurons, thereby delaying disease progression in amyotrophic lateral sclerosis."]}
{"disease": "Parkinson's disease", "core_genes": ["c-Abl kinase", "dopaminergic neuronal death"], "hypotheses": ["Pharmacological inhibition of c-Abl kinase attenuates α-synuclein phosphorylation, thereby promoting autophagic clearance of protein aggregates and reducing dopaminergic neuronal death in Parkinson’s disease."]}
{"disease": "neurodegeneration", "core_genes": ["CLOCK gene", "circadian rhythm"], "hypotheses": ["Upregulation of CLOCK gene expression suppresses glial activation, thereby mitigating neuroinflammation and reducing neurodegeneration-associated neuronal loss."]}
{"disease": "multiple sclerosis", "core_genes": ["neurofilament light chain (NFL)"], "hypotheses": ["Suppression of microglial activation reduces neurofilament light chain (NFL) release, thereby mitigating axonal damage and slowing neurodegeneration in multiple sclerosis."]}
{"disease": "metabolic syndrome", "core_genes": ["GLP-1 receptor agonist", "AMPK signaling"], "hypotheses": ["GLP-1 receptor agonist treatment enhances AMPK-mediated suppression of hepatic gluconeogenesis, thereby reducing fasting hyperglycemia in individuals with metabolic syndrome."]}
{"disease": "diabetic cardiomyopathy", "core_genes": ["SGLT2 inhibitor", "ketogenesis"], "hypotheses": ["Augmentation of hepatic ketogenesis by SGLT2 inhibitors suppresses myocardial oxidative stress via enhanced utilization of circulating β-hydroxybutyrate in diabetic cardiomyopathy."]}
{"disease": "obesity-induced insulin resistance", "core_genes": ["GIP receptor", "GLP-1"], "hypotheses": ["Restoration of GIP receptor signaling suppresses adipose tissue inflammation by inhibiting pro-inflammatory cytokine production, thereby improving insulin sensitivity in obesity-induced insulin resistance."]}
{"disease": "metabolic syndrome", "core_genes": ["UCP1", "brown adipose tissue", "thermogenesis"], "hypotheses": ["Pharmacological activation of UCP1 in brown adipose tissue enhances thermogenesis and suppresses insulin resistance in models of metabolic syndrome."]}
{"disease": "type 2 diabetes", "core_genes": ["IRS-1", "serine phosphorylation"], "hypotheses": ["Inhibition of JNK-mediated serine phosphorylation of IRS-1 restores insulin-stimulated tyrosine phosphorylation of IRS-1 and improves glucose uptake in type 2 diabetic adipocytes."]}
{"disease": "congenital leptin deficiency", "core_genes": ["LEPR gene"], "hypotheses": ["Restoring JAK2/STAT3 signaling downstream of dysfunctional LEPR ameliorates hyperphagia and improves metabolic homeostasis in congenital leptin deficiency."]}
{"disease": "congenital hypothyroidism", "core_genes": ["TPO gene"], "hypotheses": ["Loss-of-function mutations in TPO gene enhance oxidative stress in thyrocytes by reducing thyroid hormone-mediated regulation of antioxidant enzymes, promoting cellular damage in congenital hypothyroidism."]}
{"disease": "hepatic glucose production", "core_genes": ["GCGR antagonism"], "hypotheses": ["GCGR antagonism suppresses hepatic PEPCK expression, thereby inhibiting gluconeogenesis and reducing hepatic glucose production in models of diabetes."]}
{"disease": "medium-chain acyl-CoA dehydrogenase disorders", "core_genes": ["ACADM deficiency"], "hypotheses": ["Activation of NRF2-mediated antioxidant pathways attenuates oxidative stress-induced hepatocyte apoptosis in ACADM deficiency by reducing the accumulation of toxic medium-chain acylcarnitines."]}
{"disease": "mitochondrial diabetes", "core_genes": ["TFAM gene"], "hypotheses": ["Reduced TFAM expression in pancreatic β-cells induces mitochondrial DNA instability, which elevates reactive oxygen species and suppresses glucose-stimulated insulin secretion, thereby promoting mitochondrial diabetes."]}
{"disease": "familial hypercholesterolemia", "core_genes": ["PCSK9 inhibition", "LDL receptor recycling"], "hypotheses": ["Enhancing expression of genes involved in LDL receptor recycling synergistically augments the LDL-lowering effect of PCSK9 inhibition in familial hypercholesterolemia hepatocytes."]}
{"disease": "atherosclerosis", "core_genes": ["NLRP3 inflammasome", "plaque formation"], "hypotheses": ["Pharmacological inhibition of NLRP3 inflammasome assembly suppresses IL-1β release, thereby attenuating vascular inflammation and reducing atherosclerotic plaque progression in vivo."]}
{"disease": "cardiac fibrosis and heart failure", "core_genes": ["TGF-β1 signaling"], "hypotheses": ["Inhibition of TGF-β1-induced SMAD3 activation suppresses endothelial-to-mesenchymal transition, thereby reducing cardiac fibrosis and preserving myocardial function in heart failure."]}
{"disease": "vascular aging", "core_genes": ["eNOS uncoupling", "endothelial dysfunction"], "hypotheses": ["Restoring BH4 availability suppresses eNOS uncoupling, thereby reducing superoxide production and reversing endothelial dysfunction in aged vascular tissue."]}
{"disease": "heart failure with preserved ejection fraction", "core_genes": ["BNP elevation"], "hypotheses": ["Enhanced neprilysin activity in HFpEF promotes BNP degradation, thereby impairing natriuretic signaling and exacerbating diastolic dysfunction and fluid retention."]}
{"disease": "cardiomyocyte regeneration", "core_genes": ["GATA4 transcription factor"], "hypotheses": ["Overexpression of GATA4 in adult cardiac fibroblasts induces activation of the Hippo-YAP pathway, promoting their reprogramming into proliferative cardiomyocyte-like cells after myocardial injury."]}
{"disease": "vascular smooth muscle cell proliferation", "core_genes": ["PDGF-BB signaling"], "hypotheses": ["Inhibition of PDGFR-β signaling represses PI3K/AKT-mediated phenotypic switching of vascular smooth muscle cells, thereby reducing neointimal hyperplasia during vascular remodeling."]}
{"disease": "vascular calcification", "core_genes": ["Runx2 transcription factor"], "hypotheses": ["RUNX2 transcription factor enhances BMP2-induced osteogenic gene expression in vascular smooth muscle cells, thereby accelerating vascular calcification in the context of chronic kidney disease."]}
{"disease": "hypertension-induced cardiac remodeling", "core_genes": ["ACE2", "Ang-(1-7) axis"], "hypotheses": ["Pharmacological activation of the Mas receptor enhances Ang-(1-7)-mediated suppression of TGF-β signaling, thereby reducing myocardial fibrosis in hypertension-induced cardiac remodeling."]}
{"disease": "cardiac metabolic reprogramming", "core_genes": ["SIRT1 deacetylase activity"], "hypotheses": ["SIRT1 deacetylase activity enhances PGC-1α–mediated mitochondrial biogenesis, thereby suppressing NF-κB-driven inflammation and reducing pathological cardiac remodeling during metabolic reprogramming."]}
{"disease": "regulatory T cell dysfunction", "core_genes": ["FOXP3 expression stability"], "hypotheses": ["Inhibition of pro-inflammatory cytokine signaling attenuates DNA methylation at the FOXP3 locus, thereby stabilizing FOXP3 expression and restoring regulatory T cell suppressive function."]}
{"disease": "systemic lupus erythematosus", "core_genes": ["IRF7", "type I interferon signaling"], "hypotheses": ["Pharmacological inhibition of IRF7 attenuates type I interferon signaling, thereby reducing autoantibody production and ameliorating disease severity in systemic lupus erythematosus."]}
{"disease": "Th17 cell differentiation", "core_genes": ["RORγt transcription factor"], "hypotheses": ["SUMOylation of RORγt suppresses its transcriptional activity, thereby inhibiting Th17 cell differentiation and reducing IL-17A/IL-17F expression."]}
{"disease": "B cell tolerance breakdown", "core_genes": ["CD20 expression loss"], "hypotheses": ["Loss of CD20 expression suppresses Fc receptor-mediated phagocytosis of autoreactive B cells, thereby promoting their survival and persistence in autoimmune disease."]}
{"disease": "rheumatoid arthritis", "core_genes": ["C5aR1 complement receptor"], "hypotheses": ["Pharmacologic inhibition of C5AR1 suppresses osteoclastogenesis by reducing macrophage-derived RANKL expression, thereby attenuating bone erosion in rheumatoid arthritis."]}
{"disease": "autoinflammatory disease pathogenesis", "core_genes": ["NLRP3 inflammasome priming"], "hypotheses": ["Inhibition of NF-κB-mediated NLRP3 inflammasome priming suppresses caspase-1 activation and reduces IL-1β maturation in autoinflammatory disease models."]}
{"disease": "tissue-resident memory T cells", "core_genes": ["CD69 expression"], "hypotheses": ["Upregulation of CD69 in tissue-resident memory T cells suppresses S1PR1-mediated egress, thereby enhancing local inflammatory cytokine production during recurrent tissue infection."]}
{"disease": "autoimmune polyglandular syndrome", "core_genes": ["AIRE gene mutations"], "hypotheses": ["AIRE gene mutations suppress Foxp3+ regulatory T cell differentiation in the thymus, thereby promoting autoreactive T cell-mediated destruction of endocrine tissues in autoimmune polyglandular syndrome."]}
{"disease": "autoimmune disease susceptibility", "core_genes": ["CTLA-4 polymorphisms"], "hypotheses": ["CTLA-4 polymorphisms that reduce CTLA-4 surface expression in regulatory T cells impair IL-10 production, thereby exacerbating autoimmune disease severity."]}
{"disease": "microbiome-mediated immune development", "core_genes": ["TLR4 signaling"], "hypotheses": ["Increased abundance of short-chain fatty acid–producing microbiota enhances TLR4-mediated regulatory cytokine production, thereby promoting immune tolerance during early-life immune development."]}
{"disease": "carbapenem resistance", "core_genes": ["NDM-1 metallo-β-lactamase"], "hypotheses": ["Zinc chelation suppresses NDM-1 metallo-β-lactamase activity and thereby restores carbapenem susceptibility in NDM-1–expressing Gram-negative bacteria under antibiotic stress conditions."]}
{"disease": "COVID-19", "core_genes": ["SARS-CoV-2 spike protein D614G", "viral fitness"], "hypotheses": ["The D614G mutation in the SARS-CoV-2 spike protein enhances viral replication in the upper respiratory tract by increasing ACE2-mediated entry efficiency in airway epithelial cells."]}
{"disease": "tuberculosis", "core_genes": ["ESX-1 secretion system", "Mycobacterium tuberculosis virulence"], "hypotheses": ["Inhibition of ESX-1-mediated ESAT-6 secretion suppresses NLRP3 inflammasome activation, thereby reducing granuloma formation and chronic inflammation during Mycobacterium tuberculosis infection."]}
{"disease": "azole-resistant Aspergillus fumigatus", "core_genes": ["CYP51A gene mutations"], "hypotheses": ["Upregulation of the transcription factor SrbA enhances CYP51A expression, thereby promoting azole resistance in Aspergillus fumigatus through increased ergosterol biosynthesis pathway activity."]}
{"disease": "influenza", "core_genes": ["memory B cell", "BCR affinity maturation"], "hypotheses": ["Enhanced activation of the CXCR5 signaling pathway in germinal center B cells promotes BCR affinity maturation, thereby increasing the generation of broadly neutralizing memory B cells during influenza infection."]}
{"disease": "bacterial biofilm formation", "core_genes": ["FtsZ protein inhibition"], "hypotheses": ["Inhibition of FTSZ protein enhances antibiotic susceptibility of mature bacterial biofilms by disrupting septum formation and reducing biofilm structural integrity."]}
{"disease": "hepatitis B virus drug resistance", "core_genes": ["HBV polymerase L180M", "entecavir resistance"], "hypotheses": ["The presence of the HBV polymerase L180M mutation enhances compensatory upregulation of viral replication genes, promoting persistent viremia despite entecavir therapy."]}
{"disease": "chronic viral infections", "core_genes": ["CD8+ T cell exhaustion markers"], "hypotheses": ["Sustained IL-10 signaling promotes the upregulation of TIGIT on CD8+ T cells, thereby reinforcing their exhausted phenotype during chronic viral infection."]}
{"disease": "malaria", "core_genes": ["PfEMP1 protein", "Plasmodium falciparum immune evasion"], "hypotheses": ["Upregulation of endothelial ICAM-1 by PFEMP1-expressing Plasmodium falciparum enhances leukocyte recruitment and exacerbates local inflammation during cerebral malaria."]}
{"disease": "bacteriophage host specificity", "core_genes": ["phage tail fibers"], "hypotheses": ["Engineering point mutations in the receptor-binding domains of phage tail fiber genes modulates the efficiency of host recognition, enabling targeted expansion of bacteriophage host range toward resistant bacterial strains."]}
{"disease": "cellular senescence", "core_genes": ["p16INK4a expression"], "hypotheses": ["Upregulation of P16INK4A enhances the senescence-associated secretory phenotype, thereby promoting chronic inflammation and exacerbating tissue dysfunction in age-related diseases."]}
{"disease": "telomere maintenance disorders", "core_genes": ["TERT promoter mutations"], "hypotheses": ["TERT promoter mutations enhance resistance to apoptosis in hematopoietic stem cells by upregulating telomerase activity, thereby increasing the risk of clonal hematopoiesis and leukemogenesis."]}
{"disease": "mitochondrial quality control", "core_genes": ["PINK1", "Parkin pathway"], "hypotheses": ["Overexpression of PINK1 enhances PARKIN-mediated mitophagy and suppresses oxidative stress-induced neuronal apoptosis in models of Parkinson’s disease."]}
{"disease": "inflammaging", "core_genes": ["SASP factor", "IL-6 secretion"], "hypotheses": ["Pharmacological inhibition of IL-6 signaling in senescent cells suppresses SASP factor expression, thereby disrupting the feed-forward loop that drives inflammaging and age-related tissue dysfunction."]}
{"disease": "epigenetic aging", "core_genes": ["EPAS1 gene methylation"], "hypotheses": ["Hypermethylation of EPAS1 represses HIF-2α-mediated activation of mitochondrial antioxidant genes, thereby accelerating epigenetic aging through increased oxidative stress in aging tissues."]}
{"disease": "mitochondrial aging", "core_genes": ["SIRT3 deacetylase activity"], "hypotheses": ["Upregulation of SIRT3 deacetylase activity enhances SOD2-mediated antioxidant defense, thereby suppressing mitochondrial ROS accumulation and delaying the onset of senescence in aging cells."]}
{"disease": "stem cell senescence", "core_genes": ["LIN28A expression"], "hypotheses": ["Restoration of LIN28A expression represses p16INK4a-mediated senescence and enhances genome stability in aged stem cells by inhibiting let-7 microRNA biogenesis."]}
{"disease": "DNA damage response aging", "core_genes": ["ATM kinase activation"], "hypotheses": ["Enhanced activation of ATM kinase in aged fibroblasts suppresses pro-inflammatory cytokine secretion by repressing NF-κB signaling, thereby mitigating age-related tissue inflammation."]}
{"disease": "progeria syndrome", "core_genes": ["LMNA mutations"], "hypotheses": ["Progerin accumulation suppresses the expression of DNA repair enzyme RAD51, thereby exacerbating genome instability in progeria syndrome fibroblasts."]}
{"disease": "senolytic drug mechanisms", "core_genes": ["BCL-2 family proteins"], "hypotheses": ["Inhibition of MCL-1 synergistically enhances navitoclax-induced apoptosis in senescent cells by promoting mitochondrial outer membrane permeabilization and caspase activation."]}
{"disease": "cystic fibrosis", "core_genes": ["CFTR F508del mutation"], "hypotheses": ["Inhibition of NF-κB signaling suppresses F508del CFTR-induced pro-inflammatory cytokine production in airway epithelial cells, thereby reducing chronic inflammation in cystic fibrosis."]}
{"disease": "Pompe disease", "core_genes": ["GAA gene", "enzyme replacement therapy"], "hypotheses": ["Enhancing autophagosome-lysosome fusion via pharmacological activation of TFEB augments the efficacy of enzyme replacement therapy in reducing muscle pathology in Pompe disease."]}
{"disease": "spinal muscular atrophy", "core_genes": ["SMN1 gene deletion"], "hypotheses": ["Restoring SMN1 expression in SMA motor neurons suppresses stress granule formation and normalizes cytoskeletal dynamics, thereby mitigating axonal transport deficits and delaying neurodegeneration."]}
{"disease": "Morquio syndrome", "core_genes": ["GALNS enzyme deficiency"], "hypotheses": ["Accumulation of keratan sulfate due to GALNS deficiency inhibits SOX9-mediated chondrocyte differentiation, exacerbating cartilage dysplasia in Morquio syndrome."]}
{"disease": "Schwartz-Jampel syndrome", "core_genes": ["HSPG2 gene mutations"], "hypotheses": ["Restoring perlecan-mediated modulation of growth factor signaling in skeletal muscle ameliorates impaired acetylcholinesterase clustering and reduces myotonia severity in Schwartz-Jampel syndrome."]}
{"disease": "myotonic dystrophy", "core_genes": ["DMPK gene expansion"], "hypotheses": ["Restoring MBNL1 activity in myotonic dystrophy muscle cells suppresses nuclear foci formation and ameliorates aberrant splicing of transcripts involved in muscle regeneration."]}
{"disease": "Fukuyama congenital muscular dystrophy", "core_genes": ["FKTN gene mutations"], "hypotheses": ["Augmenting LARGE1-mediated glycosylation compensates for FKTN deficiency and restores α-dystroglycan function, thereby enhancing muscle fiber integrity in Fukuyama congenital muscular dystrophy."]}
{"disease": "X-linked adrenoleukodystrophy", "core_genes": ["ABCD1 gene mutations"], "hypotheses": ["Pharmacological activation of peroxisome proliferator-activated receptor alpha (PPARα) enhances residual VLCFA degradation, thereby attenuating microglial activation and neuroinflammation in ABCD1-deficient X-ALD models."]}
{"disease": "malignant infantile osteopetrosis", "core_genes": ["TCIRG1 gene defects"], "hypotheses": ["Restoration of vacuolar H+-ATPase activity in TCIRG1-deficient osteoclasts promotes resorption lacuna acidification and rescues impaired bone remodeling in malignant infantile osteopetrosis."]}
{"disease": "X-linked retinitis pigmentosa", "core_genes": ["RPGR gene mutations"], "hypotheses": ["RPGR mutations disrupt ciliary microtubule organization, thereby enhancing activation of photoreceptor cell apoptotic pathways and accelerating rod degeneration in X-linked retinitis pigmentosa."]}
{"disease": "metabolic health regulation", "core_genes": ["Akkermansia muciniphila"], "hypotheses": ["Colonization with Akkermansia muciniphila suppresses intestinal IL-17A production, thereby reducing adipose tissue inflammation and improving insulin sensitivity in metabolic syndrome."]}
{"disease": "microbiota-gut-brain axis", "core_genes": ["Bacteroides fragilis polysaccharide A"], "hypotheses": ["Polysaccharide A from Bacteroides fragilis enhances gut barrier integrity by upregulating tight junction protein expression, thereby suppressing peripheral immune cell infiltration into the central nervous system."]}
{"disease": "antibiotic-associated colitis", "core_genes": ["Clostridioides difficile toxin B"], "hypotheses": ["Inhibition of TcdB-mediated Rho GTPase glucosylation in colonic epithelial cells attenuates pro-inflammatory cytokine release and reduces neutrophil-driven mucosal injury in antibiotic-associated colitis."]}
{"disease": "immune system modulation", "core_genes": ["Lactobacillus rhamnosus GG"], "hypotheses": ["Lactobacillus rhamnosus GG administration induces IL-10 production in intestinal dendritic cells, which subsequently suppresses NF-κB–mediated pro-inflammatory cytokine expression in the gut epithelium."]}
{"disease": "rheumatoid arthritis", "core_genes": ["Prevotella copri"], "hypotheses": ["Prevotella copri-derived antigens induce IL-23 production by intestinal dendritic cells, thereby enhancing Th17-mediated autoimmunity and exacerbating joint inflammation in rheumatoid arthritis."]}
{"disease": "intestinal barrier function", "core_genes": ["butyrate-producing bacteria"], "hypotheses": ["Upregulation of AMPK signaling by butyrate-producing bacteria suppresses claudin-2 expression, thereby reducing paracellular permeability in the intestinal epithelium."]}
{"disease": "periodontal disease and cardiovascular risk", "core_genes": ["Porphyromonas gingivalis"], "hypotheses": ["Porphyromonas gingivalis gingipains upregulate endothelial cell expression of adhesion molecules, thereby enhancing monocyte recruitment and promoting early atherosclerotic lesion development."]}
{"disease": "obesity and insulin resistance", "core_genes": ["Firmicutes/Bacteroidetes ratio"], "hypotheses": ["A decreased Bacteroidetes population suppresses intestinal tight junction protein expression, thereby increasing gut permeability and promoting systemic inflammation that exacerbates insulin resistance in obesity."]}
{"disease": "intestinal permeability", "core_genes": ["zonulin protein"], "hypotheses": ["Inhibition of zonulin-mediated protein kinase C activation restores tight junction integrity and suppresses antigen translocation in models of increased intestinal permeability."]}
{"disease": "anti-inflammatory effects", "core_genes": ["Faecalibacterium prausnitzii"], "hypotheses": ["Faecalibacterium prausnitzii-derived butyrate suppresses NF-κB–mediated TNF-α production in intestinal epithelial cells by promoting regulatory T cell differentiation and enhancing barrier integrity."]}
{"disease": "pain management", "core_genes": ["CYP2D6 polymorphisms", "codeine metabolism"], "hypotheses": ["The presence of CYP2D6 ultra-rapid metabolizer alleles promotes increased risk of opioid-induced respiratory depression following standard codeine dosing in postoperative pain management."]}
{"disease": "lung cancer monitoring", "core_genes": ["ctDNA", "EGFR T790M mutation"], "hypotheses": ["An early increase in ctDNA-detected EGFR T790M allele fraction predicts imminent radiographic progression in NSCLC patients undergoing first- or second-generation EGFR TKI therapy."]}
{"disease": "hereditary breast cancer", "core_genes": ["BRCA1/2 germline mutations"], "hypotheses": ["BRCA1 deficiency enhances MYC-driven transcriptional activation of cell cycle genes, thereby promoting uncontrolled proliferation in hereditary breast cancer cells."]}
{"disease": "immunotherapy patient selection", "core_genes": ["PD-L1 tumor proportion score"], "hypotheses": ["Elevated tumor PD-L1 Tumor Proportion Score enhances recruitment of regulatory T cells, thereby further suppressing antitumor immunity and increasing responsiveness to PD-1/PD-L1 checkpoint blockade."]}
{"disease": "abacavir hypersensitivity prevention", "core_genes": ["HLA-B*5701 allele"], "hypotheses": ["Upregulation of ERAP1 in HLA-B*5701-positive individuals modulates the repertoire of abacavir-induced peptide presentation, thereby reducing the frequency of hypersensitivity reactions."]}
{"disease": "predictive biomarker for sotorasib response", "core_genes": ["KRAS G12C mutation"], "hypotheses": ["Upregulation of SHP2 phosphatase activity attenuates sotorasib-mediated suppression of MAPK signaling in KRAS G12C-mutant tumors, thereby reducing therapeutic response."]}
{"disease": "cardiovascular risk stratification", "core_genes": ["CRP elevation"], "hypotheses": ["CRP elevation enhances vascular expression of ICAM-1, thereby promoting monocyte recruitment and accelerating atherosclerotic plaque destabilization in individuals at high cardiovascular risk."]}
{"disease": "prostate cancer early detection", "core_genes": ["PSA isoforms"], "hypotheses": ["Androgen receptor activation enhances the production of the [-2]proPSA isoform by upregulating proteolytic enzymes that selectively process PSA precursors in prostate epithelial cells."]}
{"disease": "acute myocardial infarction diagnosis", "core_genes": ["Troponin I kinetics"], "hypotheses": ["Accelerated troponin I kinetics predict increased activation of necroptosis pathways in cardiomyocytes during acute myocardial infarction."]}
{"disease": "diabetes management", "core_genes": ["HbA1c levels"], "hypotheses": ["Pharmacological activation of endothelial nitric oxide synthase reduces HbA1c levels by enhancing endothelial function and mitigating oxidative stress in patients with type 2 diabetes."]}
