{"disease": "breast and ovarian cancer", "core_genes": ["BRCA1", "homologous recombination repair", "PARP inhibitor resistance"], "hypotheses": ["BRCA1 loss impairs homologous recombination repair, leading to PARP inhibitor sensitivity, but secondary BRCA1 mutations restore repair activity, driving PARP inhibitor resistance in breast and ovarian cancer."]}
{"disease": "cancer (wild-type p53)", "core_genes": ["p53", "MDM2"], "hypotheses": ["MDM2 overexpression in wild-type p53 cancers promotes tumor progression by excessively degrading p53, thereby impairing DNA damage-induced cell cycle arrest and apoptosis."]}
{"disease": "colorectal cancer", "core_genes": ["KRAS G12C"], "hypotheses": ["KRAS G12C mutation promotes colorectal cancer progression by constitutively activating the MAPK signaling pathway, leading to increased cellular proliferation and resistance to apoptosis."]}
{"disease": "cancer", "core_genes": ["EGFR L858R", "tyrosine kinase inhibitor sensitivity"], "hypotheses": ["The EGFR L858R mutation enhances tyrosine kinase activity, increasing cancer cell proliferation, but simultaneously creates a conformational vulnerability that confers heightened sensitivity to tyrosine kinase inhibitors."]}
{"disease": "cancer immune escape", "core_genes": ["PD-L1", "JAK-STAT"], "hypotheses": ["Upregulation of PD-L1 via JAK-STAT signaling in tumor cells suppresses T cell activation, promoting cancer immune escape."]}
{"disease": "gastric cancer", "core_genes": ["HER2", "trastuzumab resistance"], "hypotheses": ["Overexpression of HER2 in gastric cancer upregulates PI3K/AKT signaling, promoting trastuzumab resistance by enhancing tumor cell survival and inhibiting apoptosis."]}
{"disease": "B-cell malignancy", "core_genes": ["CD19", "CAR-T cell", "cytokine release syndrome biomarkers"], "hypotheses": ["Activation of CD19-targeted CAR-T cells in B-cell malignancy elevates cytokine release syndrome biomarkers by triggering excessive cytokine secretion from both CAR-T cells and malignant B cells."]}
{"disease": "glioblastoma", "core_genes": ["VEGF-A", "VEGFR2"], "hypotheses": ["VEGF-A binding to VEGFR2 on glioblastoma cells activates PI3K/AKT signaling, promoting tumor angiogenesis and enhancing cell survival."]}
{"disease": "cancer-associated fibroblasts", "core_genes": ["TNF-α", "NF-κB"], "hypotheses": ["TNF-α activates NF-κB signaling in cancer-associated fibroblasts, promoting secretion of pro-tumorigenic cytokines and enhancing tumor progression."]}
{"disease": "PI3K/PTEN-deficient tumors", "core_genes": ["mTOR complex 1", "hyperactivation"], "hypotheses": ["Hyperactivation of mTOR complex 1 in PI3K/PTEN-deficient tumors drives uncontrolled cell growth by increasing protein synthesis and inhibiting autophagy."]}
{"disease": "Parkinson's disease", "core_genes": ["LRRK2 G2019S", "mitochondrial dynamics"], "hypotheses": ["LRRK2 G2019S mutation disrupts mitochondrial dynamics by increasing DRP1-mediated fission, leading to dopaminergic neuron degeneration in Parkinson’s disease."]}
{"disease": "Parkinson's disease", "core_genes": ["α-synuclein A53T", "aggregation", "neuroinflammation"], "hypotheses": ["The α-synuclein A53T mutation increases aggregation, which activates microglia and triggers neuroinflammation, accelerating dopaminergic neuron degeneration in Parkinson's disease."]}
{"disease": "Alzheimer's disease", "core_genes": ["APOE4", "amyloid-β clearance"], "hypotheses": ["APOE4 impairs microglial-mediated amyloid-β clearance by downregulating phagocytic receptor expression, leading to increased amyloid-β accumulation and Alzheimer’s disease progression."]}
{"disease": "frontotemporal dementia", "core_genes": ["Tau R406W"], "hypotheses": ["Tau R406W mutation impairs microtubule binding, leading to cytoskeletal destabilization and neuronal degeneration in frontotemporal dementia."]}
{"disease": "Alzheimer's disease", "core_genes": ["TREM2", "microglia", "neuroinflammation"], "hypotheses": ["TREM2 deficiency impairs microglial regulation of neuroinflammation, exacerbating neuronal damage and accelerating Alzheimer's disease progression."]}
{"disease": "Lewy body diseases", "core_genes": ["GBA1", "lysosomal dysfunction"], "hypotheses": ["Lysosomal dysfunction caused by GBA1 mutations leads to alpha-synuclein accumulation in neurons, promoting Lewy body formation and neurodegeneration in Lewy body diseases."]}
{"disease": "amyotrophic lateral sclerosis (ALS)", "core_genes": ["NEFL", "axonal degeneration"], "hypotheses": ["Aberrant NEFL expression disrupts neurofilament assembly, leading to axonal instability and degeneration in ALS motor neurons."]}
{"disease": "Parkinson's disease", "core_genes": ["c-Abl kinase", "dopaminergic neuronal death"], "hypotheses": ["Activation of c-Abl kinase promotes dopaminergic neuronal death in Parkinson’s disease by phosphorylating and destabilizing mitochondrial proteins essential for neuronal survival."]}
{"disease": "neurodegeneration", "core_genes": ["CLOCK gene", "circadian rhythm"], "hypotheses": ["Disruption of the CLOCK gene impairs circadian rhythm regulation, leading to increased neuronal oxidative stress and accelerated neurodegeneration."]}
{"disease": "multiple sclerosis", "core_genes": ["neurofilament light chain (NFL)"], "hypotheses": ["Elevated neurofilament light chain (NFL) promotes axonal degeneration in multiple sclerosis by impairing cytoskeletal integrity and enhancing susceptibility to immune-mediated demyelination."]}
{"disease": "metabolic syndrome", "core_genes": ["GLP-1 receptor agonist", "AMPK signaling"], "hypotheses": ["Activation of GLP-1 receptor agonists enhances AMPK signaling in adipose tissue, leading to increased fatty acid oxidation and improved insulin sensitivity in metabolic syndrome."]}
{"disease": "diabetic cardiomyopathy", "core_genes": ["SGLT2 inhibitor", "ketogenesis"], "hypotheses": ["SGLT2 inhibitor treatment enhances myocardial ketogenesis, providing an alternative energy substrate that improves cardiac function and reduces fibrosis in diabetic cardiomyopathy."]}
{"disease": "obesity-induced insulin resistance", "core_genes": ["GIP receptor", "GLP-1"], "hypotheses": ["Activation of GIP receptor impairs GLP-1 signaling in adipose tissue, reducing insulin sensitivity and promoting obesity-induced insulin resistance through altered incretin hormone crosstalk."]}
{"disease": "metabolic syndrome", "core_genes": ["UCP1", "brown adipose tissue", "thermogenesis"], "hypotheses": ["Activation of UCP1 in brown adipose tissue enhances thermogenesis, leading to increased energy expenditure and reduced adiposity, thereby ameliorating metabolic syndrome features."]}
{"disease": "type 2 diabetes", "core_genes": ["IRS-1", "serine phosphorylation"], "hypotheses": ["Increased serine phosphorylation of IRS-1 impairs insulin signaling by inhibiting IRS-1's interaction with the insulin receptor, contributing to insulin resistance in type 2 diabetes."]}
{"disease": "congenital leptin deficiency", "core_genes": ["LEPR gene"], "hypotheses": ["Loss-of-function mutations in the LEPR gene impair leptin receptor signaling, disrupting hypothalamic appetite regulation and leading to hyperphagia and early-onset obesity in congenital leptin deficiency."]}
{"disease": "congenital hypothyroidism", "core_genes": ["TPO gene"], "hypotheses": ["Mutations in the TPO gene impair thyroid peroxidase activity, leading to defective thyroid hormone synthesis and resulting in congenital hypothyroidism."]}
{"disease": "hepatic glucose production", "core_genes": ["GCGR antagonism"], "hypotheses": ["GCGR antagonism reduces hepatic glucose production by inhibiting cAMP-mediated activation of gluconeogenic gene transcription in hepatocytes."]}
{"disease": "medium-chain acyl-CoA dehydrogenase disorders", "core_genes": ["ACADM deficiency"], "hypotheses": ["ACADM deficiency impairs medium-chain fatty acid β-oxidation, causing toxic metabolite accumulation that disrupts mitochondrial energy production and triggers hypoglycemia during fasting states."]}
{"disease": "mitochondrial diabetes", "core_genes": ["TFAM gene"], "hypotheses": ["Reduced TFAM expression impairs mitochondrial DNA replication in pancreatic beta cells, leading to decreased ATP production and defective insulin secretion, thus contributing to the development of mitochondrial diabetes."]}
{"disease": "familial hypercholesterolemia", "core_genes": ["PCSK9 inhibition", "LDL receptor recycling"], "hypotheses": ["In familial hypercholesterolemia, PCSK9 inhibition increases LDL receptor recycling in hepatocytes, thereby enhancing LDL cholesterol clearance from plasma and lowering circulating cholesterol levels."]}
{"disease": "atherosclerosis", "core_genes": ["NLRP3 inflammasome", "plaque formation"], "hypotheses": ["Activation of the NLRP3 inflammasome in vascular macrophages promotes plaque formation in atherosclerosis by increasing IL-1β secretion, leading to enhanced vascular inflammation and lipid accumulation."]}
{"disease": "cardiac fibrosis and heart failure", "core_genes": ["TGF-β1 signaling"], "hypotheses": ["Activation of TGF-β1 signaling in cardiac fibroblasts promotes myofibroblast differentiation and excessive extracellular matrix deposition, directly contributing to cardiac fibrosis and subsequent heart failure."]}
{"disease": "vascular aging", "core_genes": ["eNOS uncoupling", "endothelial dysfunction"], "hypotheses": ["eNOS uncoupling increases reactive oxygen species, leading to endothelial dysfunction and accelerating vascular aging via impaired nitric oxide bioavailability."]}
{"disease": "heart failure with preserved ejection fraction", "core_genes": ["BNP elevation"], "hypotheses": ["Elevated BNP promotes myocardial fibrosis and vascular stiffness via enhanced natriuretic peptide signaling, contributing to diastolic dysfunction in heart failure with preserved ejection fraction."]}
{"disease": "cardiomyocyte regeneration", "core_genes": ["GATA4 transcription factor"], "hypotheses": ["GATA4 promotes cardiomyocyte regeneration by directly activating transcription of cell cycle re-entry genes in adult cardiomyocytes."]}
{"disease": "vascular smooth muscle cell proliferation", "core_genes": ["PDGF-BB signaling"], "hypotheses": ["PDGF-BB signaling promotes vascular smooth muscle cell proliferation by activating the PI3K/Akt pathway, leading to increased cyclin D1 expression and cell cycle progression."]}
{"disease": "vascular calcification", "core_genes": ["Runx2 transcription factor"], "hypotheses": ["Runx2 upregulation in vascular smooth muscle cells increases expression of osteogenic genes, directly promoting mineral deposition and progression of vascular calcification."]}
{"disease": "hypertension-induced cardiac remodeling", "core_genes": ["ACE2", "Ang-(1-7) axis"], "hypotheses": ["Activation of the ACE2/Ang-(1-7) axis attenuates hypertension-induced cardiac remodeling by inhibiting pro-fibrotic signaling pathways and reducing myocardial fibroblast activation."]}
{"disease": "cardiac metabolic reprogramming", "core_genes": ["SIRT1 deacetylase activity"], "hypotheses": ["SIRT1 deacetylase activity promotes cardiac metabolic reprogramming by deacetylating and activating PGC-1α, enhancing mitochondrial biogenesis and oxidative metabolism in cardiomyocytes under metabolic stress."]}
{"disease": "regulatory T cell dysfunction", "core_genes": ["FOXP3 expression stability"], "hypotheses": ["Reduced FOXP3 expression stability leads to impaired suppressive function in regulatory T cells by disrupting the transcriptional maintenance of Treg lineage-specific genes."]}
{"disease": "systemic lupus erythematosus", "core_genes": ["IRF7", "type I interferon signaling"], "hypotheses": ["IRF7 overactivation amplifies type I interferon signaling in plasmacytoid dendritic cells, promoting autoantibody production and immune complex deposition in systemic lupus erythematosus."]}
{"disease": "Th17 cell differentiation", "core_genes": ["RORγt transcription factor"], "hypotheses": ["RORγt directly upregulates IL-17A gene transcription by recruiting histone acetyltransferases to the IL-17A promoter during Th17 cell differentiation."]}
{"disease": "B cell tolerance breakdown", "core_genes": ["CD20 expression loss"], "hypotheses": ["Loss of CD20 expression impairs B cell receptor signaling thresholds, leading to survival of autoreactive B cells and subsequent breakdown of B cell tolerance."]}
{"disease": "rheumatoid arthritis", "core_genes": ["C5aR1 complement receptor"], "hypotheses": ["Activation of C5aR1 complement receptor on synovial macrophages enhances pro-inflammatory cytokine release, directly contributing to joint inflammation and destruction in rheumatoid arthritis."]}
{"disease": "autoinflammatory disease pathogenesis", "core_genes": ["NLRP3 inflammasome priming"], "hypotheses": ["Enhanced NLRP3 inflammasome priming in myeloid cells increases IL-1β secretion, driving aberrant inflammatory responses central to autoinflammatory disease pathogenesis."]}
{"disease": "tissue-resident memory T cells", "core_genes": ["CD69 expression"], "hypotheses": ["CD69 expression promotes tissue-resident memory T cell retention by inhibiting S1PR1-mediated egress signaling, thereby enhancing local immune surveillance within non-lymphoid tissues."]}
{"disease": "autoimmune polyglandular syndrome", "core_genes": ["AIRE gene mutations"], "hypotheses": ["AIRE gene mutations impair central thymic tolerance, leading to survival of autoreactive T cells that attack multiple endocrine organs in autoimmune polyglandular syndrome."]}
{"disease": "autoimmune disease susceptibility", "core_genes": ["CTLA-4 polymorphisms"], "hypotheses": ["CTLA-4 polymorphisms reduce inhibitory signaling in T cells, leading to increased self-reactive T cell activation and heightened autoimmune disease susceptibility."]}
{"disease": "microbiome-mediated immune development", "core_genes": ["TLR4 signaling"], "hypotheses": ["Activation of TLR4 signaling by specific gut microbiota-derived ligands during early life promotes regulatory T cell differentiation, thereby shaping immune tolerance and development."]}
{"disease": "carbapenem resistance", "core_genes": ["NDM-1 metallo-β-lactamase"], "hypotheses": ["NDM-1 metallo-β-lactamase hydrolyzes carbapenem antibiotics, rendering them ineffective and conferring carbapenem resistance through inactivation of their β-lactam ring structure."]}
{"disease": "COVID-19", "core_genes": ["SARS-CoV-2 spike protein D614G", "viral fitness"], "hypotheses": ["The D614G mutation in the SARS-CoV-2 spike protein enhances viral fitness by increasing spike protein stability, leading to greater infectivity and transmission efficiency in human airway epithelial cells."]}
{"disease": "tuberculosis", "core_genes": ["ESX-1 secretion system", "Mycobacterium tuberculosis virulence"], "hypotheses": ["The ESX-1 secretion system enhances Mycobacterium tuberculosis virulence by translocating effector proteins that disrupt host phagosomal membranes, promoting bacterial escape and intracellular survival."]}
{"disease": "azole-resistant Aspergillus fumigatus", "core_genes": ["CYP51A gene mutations"], "hypotheses": ["CYP51A gene mutations alter the enzyme's active site structure, reducing azole binding affinity and thereby conferring resistance in Aspergillus fumigatus."]}
{"disease": "influenza", "core_genes": ["memory B cell", "BCR affinity maturation"], "hypotheses": ["Enhanced BCR affinity maturation in memory B cells accelerates production of high-affinity neutralizing antibodies, leading to improved viral clearance during secondary influenza infection."]}
{"disease": "bacterial biofilm formation", "core_genes": ["FtsZ protein inhibition"], "hypotheses": ["Inhibition of FtsZ protein disrupts bacterial cell division, leading to impaired biofilm formation by preventing proper microcolony establishment and maturation."]}
{"disease": "hepatitis B virus drug resistance", "core_genes": ["HBV polymerase L180M", "entecavir resistance"], "hypotheses": ["The L180M mutation in HBV polymerase reduces entecavir binding affinity, thereby increasing viral replication in the presence of the drug and promoting hepatitis B virus drug resistance."]}
{"disease": "chronic viral infections", "core_genes": ["CD8+ T cell exhaustion markers"], "hypotheses": ["Upregulation of CD8+ T cell exhaustion markers during chronic viral infections impairs cytotoxic function by inhibiting TCR signaling, leading to persistent viral replication and inadequate immune clearance."]}
{"disease": "malaria", "core_genes": ["PfEMP1 protein", "Plasmodium falciparum immune evasion"], "hypotheses": ["PfEMP1 protein mediates Plasmodium falciparum immune evasion by altering host endothelial receptor binding, reducing antibody recognition and promoting chronic infection."]}
{"disease": "bacteriophage host specificity", "core_genes": ["phage tail fibers"], "hypotheses": ["Alterations in phage tail fiber genes modulate host specificity by changing the affinity and recognition of bacterial surface receptors, thereby determining which bacterial strains the phage can infect."]}
{"disease": "cellular senescence", "core_genes": ["p16INK4a expression"], "hypotheses": ["Increased p16INK4a expression induces cellular senescence by inhibiting CDK4/6 activity, leading to hypophosphorylation of Rb and permanent cell cycle arrest in somatic cells."]}
{"disease": "telomere maintenance disorders", "core_genes": ["TERT promoter mutations"], "hypotheses": ["TERT promoter mutations upregulate telomerase expression, preventing telomere shortening and enabling the survival of dysfunctional cells, thereby driving telomere maintenance disorder pathogenesis."]}
{"disease": "mitochondrial quality control", "core_genes": ["PINK1", "Parkin pathway"], "hypotheses": ["Activation of PINK1 recruits Parkin to damaged mitochondria, promoting ubiquitination of outer mitochondrial membrane proteins to initiate mitophagy and maintain mitochondrial quality control."]}
{"disease": "inflammaging", "core_genes": ["SASP factor", "IL-6 secretion"], "hypotheses": ["Senescent cell accumulation elevates SASP factor expression, leading to increased IL-6 secretion, which perpetuates chronic low-grade inflammation characteristic of inflammaging."]}
{"disease": "epigenetic aging", "core_genes": ["EPAS1 gene methylation"], "hypotheses": ["Hypermethylation of the EPAS1 gene promoter reduces EPAS1 expression, leading to impaired hypoxic response and accelerated epigenetic aging through increased oxidative stress and cellular senescence."]}
{"disease": "mitochondrial aging", "core_genes": ["SIRT3 deacetylase activity"], "hypotheses": ["SIRT3 deacetylase activity preserves mitochondrial function during aging by deacetylating and activating antioxidant enzymes, thereby reducing mitochondrial reactive oxygen species and delaying age-associated mitochondrial decline."]}
{"disease": "stem cell senescence", "core_genes": ["LIN28A expression"], "hypotheses": ["LIN28A overexpression delays stem cell senescence by inhibiting let-7 microRNA maturation, thereby sustaining expression of cell cycle and pluripotency regulators."]}
{"disease": "DNA damage response aging", "core_genes": ["ATM kinase activation"], "hypotheses": ["ATM kinase activation enhances DNA damage response efficiency, thereby delaying cellular senescence and mitigating aging-associated genomic instability."]}
{"disease": "progeria syndrome", "core_genes": ["LMNA mutations"], "hypotheses": ["LMNA mutations in progeria syndrome disrupt nuclear envelope integrity, leading to increased DNA damage and accelerated cellular senescence through persistent activation of the DNA damage response pathway."]}
{"disease": "senolytic drug mechanisms", "core_genes": ["BCL-2 family proteins"], "hypotheses": ["Senolytic drugs induce apoptosis in senescent cells by inhibiting BCL-2 family proteins, thereby disrupting mitochondrial membrane integrity and activating caspase-dependent cell death pathways."]}
{"disease": "cystic fibrosis", "core_genes": ["CFTR F508del mutation"], "hypotheses": ["The F508del mutation in CFTR causes misfolded protein retention in the endoplasmic reticulum, leading to defective chloride transport and thickened mucus in cystic fibrosis airways."]}
{"disease": "Pompe disease", "core_genes": ["GAA gene", "enzyme replacement therapy"], "hypotheses": ["Deficient GAA gene expression leads to impaired lysosomal glycogen degradation, which enzyme replacement therapy restores by increasing functional GAA enzyme, reducing glycogen accumulation in muscle cells."]}
{"disease": "spinal muscular atrophy", "core_genes": ["SMN1 gene deletion"], "hypotheses": ["Loss of SMN1 gene impairs snRNP assembly in motor neurons, leading to defective pre-mRNA splicing and subsequent motor neuron degeneration in spinal muscular atrophy."]}
{"disease": "Morquio syndrome", "core_genes": ["GALNS enzyme deficiency"], "hypotheses": ["Deficiency of GALNS enzyme in Morquio syndrome leads to impaired degradation of keratan sulfate, causing its accumulation and resulting in chondrocyte dysfunction and skeletal abnormalities."]}
{"disease": "Schwartz-Jampel syndrome", "core_genes": ["HSPG2 gene mutations"], "hypotheses": ["HSPG2 gene mutations impair perlecan synthesis, disrupting neuromuscular junction stability and leading to myotonia and skeletal abnormalities characteristic of Schwartz-Jampel syndrome."]}
{"disease": "myotonic dystrophy", "core_genes": ["DMPK gene expansion"], "hypotheses": ["Expanded CTG repeats in the DMPK gene sequester MBNL proteins, leading to widespread mis-splicing of pre-mRNAs and resulting in the multisystemic symptoms of myotonic dystrophy."]}
{"disease": "Fukuyama congenital muscular dystrophy", "core_genes": ["FKTN gene mutations"], "hypotheses": ["FKTN gene mutations impair α-dystroglycan glycosylation, disrupting muscle fiber membrane stability and leading to increased susceptibility to muscle fiber degeneration in Fukuyama congenital muscular dystrophy."]}
{"disease": "X-linked adrenoleukodystrophy", "core_genes": ["ABCD1 gene mutations"], "hypotheses": ["Mutations in the ABCD1 gene impair peroxisomal import of very long-chain fatty acids, leading to their accumulation and subsequent demyelination in X-linked adrenoleukodystrophy."]}
{"disease": "malignant infantile osteopetrosis", "core_genes": ["TCIRG1 gene defects"], "hypotheses": ["Defective TCIRG1 impairs osteoclast proton pump function, leading to reduced bone resorption and pathological bone sclerosis characteristic of malignant infantile osteopetrosis."]}
{"disease": "X-linked retinitis pigmentosa", "core_genes": ["RPGR gene mutations"], "hypotheses": ["RPGR gene mutations disrupt ciliary transport in photoreceptors, leading to accumulation of toxic proteins and progressive photoreceptor degeneration in X-linked retinitis pigmentosa."]}
{"disease": "metabolic health regulation", "core_genes": ["Akkermansia muciniphila"], "hypotheses": ["Akkermansia muciniphila improves metabolic health by increasing gut mucus layer thickness, which reduces intestinal permeability and systemic inflammation."]}
{"disease": "microbiota-gut-brain axis", "core_genes": ["Bacteroides fragilis polysaccharide A"], "hypotheses": ["Bacteroides fragilis polysaccharide A modulates gut-brain axis signaling by promoting regulatory T cell induction, leading to decreased neuroinflammation and improved behavioral outcomes."]}
{"disease": "antibiotic-associated colitis", "core_genes": ["Clostridioides difficile toxin B"], "hypotheses": ["Clostridioides difficile toxin B disrupts colonic epithelial tight junctions, increasing intestinal permeability and promoting inflammation in antibiotic-associated colitis."]}
{"disease": "immune system modulation", "core_genes": ["Lactobacillus rhamnosus GG"], "hypotheses": ["Lactobacillus rhamnosus GG upregulates IL-10 production in intestinal dendritic cells, promoting regulatory T cell differentiation and thereby modulating systemic immune responses."]}
{"disease": "rheumatoid arthritis", "core_genes": ["Prevotella copri"], "hypotheses": ["Prevotella copri colonization in the gut promotes rheumatoid arthritis by inducing Th17 cell differentiation and increasing systemic pro-inflammatory cytokines."]}
{"disease": "intestinal barrier function", "core_genes": ["butyrate-producing bacteria"], "hypotheses": ["Butyrate-producing bacteria enhance intestinal barrier function by upregulating tight junction protein expression in epithelial cells via butyrate-mediated activation of the AMPK signaling pathway."]}
{"disease": "periodontal disease and cardiovascular risk", "core_genes": ["Porphyromonas gingivalis"], "hypotheses": ["Porphyromonas gingivalis infection increases cardiovascular risk by inducing endothelial dysfunction through the upregulation of inflammatory cytokines and adhesion molecules in vascular endothelial cells."]}
{"disease": "obesity and insulin resistance", "core_genes": ["Firmicutes/Bacteroidetes ratio"], "hypotheses": ["An increased Firmicutes/Bacteroidetes ratio alters short-chain fatty acid production, promoting energy harvest and low-grade inflammation, thereby contributing to obesity and insulin resistance."]}
{"disease": "intestinal permeability", "core_genes": ["zonulin protein"], "hypotheses": ["Increased expression of zonulin protein disrupts tight junction integrity in intestinal epithelial cells, leading to elevated intestinal permeability."]}
{"disease": "anti-inflammatory effects", "core_genes": ["Faecalibacterium prausnitzii"], "hypotheses": ["Faecalibacterium prausnitzii produces butyrate, which inhibits NF-κB signaling in intestinal epithelial cells, thereby reducing pro-inflammatory cytokine expression and mediating anti-inflammatory effects."]}
{"disease": "pain management", "core_genes": ["CYP2D6 polymorphisms", "codeine metabolism"], "hypotheses": ["Individuals with CYP2D6 poor metabolizer polymorphisms experience reduced analgesic efficacy from codeine due to impaired conversion to morphine."]}
{"disease": "lung cancer monitoring", "core_genes": ["ctDNA", "EGFR T790M mutation"], "hypotheses": ["Hypothesis:"]}
{"disease": "hereditary breast cancer", "core_genes": ["BRCA1/2 germline mutations"], "hypotheses": ["BRCA1/2 germline mutations impair homologous recombination DNA repair, leading to genomic instability and increased accumulation of oncogenic mutations in breast epithelial cells."]}
{"disease": "immunotherapy patient selection", "core_genes": ["PD-L1 tumor proportion score"], "hypotheses": ["High PD-L1 tumor proportion score enhances tumor immune evasion by increasing PD-1/PD-L1 interactions, predicting greater clinical benefit from anti-PD-1/PD-L1 immunotherapy in selected patients."]}
{"disease": "abacavir hypersensitivity prevention", "core_genes": ["HLA-B*5701 allele"], "hypotheses": ["Carriers of the HLA-B*5701 allele present abacavir-derived peptides to T-cells, triggering a hypersensitivity response; pre-therapy screening prevents immune activation by identifying at-risk individuals."]}
{"disease": "predictive biomarker for sotorasib response", "core_genes": ["KRAS G12C mutation"], "hypotheses": ["KRAS G12C mutation confers increased sotorasib sensitivity by stabilizing the inactive GDP-bound KRAS conformation, enabling more effective covalent drug binding and downstream MAPK pathway inhibition."]}
{"disease": "cardiovascular risk stratification", "core_genes": ["CRP elevation"], "hypotheses": ["CRP elevation increases cardiovascular risk by promoting endothelial dysfunction through upregulation of adhesion molecules and recruitment of inflammatory monocytes to arterial walls."]}
{"disease": "prostate cancer early detection", "core_genes": ["PSA isoforms"], "hypotheses": ["Differential expression of specific PSA isoforms in serum enhances early detection of prostate cancer by distinguishing malignant from benign prostatic conditions via unique proteolytic cleavage patterns."]}
{"disease": "acute myocardial infarction diagnosis", "core_genes": ["Troponin I kinetics"], "hypotheses": ["Rapid release and clearance kinetics of Troponin I after myocardial injury enhance early diagnostic sensitivity for acute myocardial infarction by temporally aligning biomarker elevation with cardiomyocyte necrosis onset."]}
{"disease": "diabetes management", "core_genes": ["HbA1c levels"], "hypotheses": ["Elevated HbA1c levels impair pancreatic beta-cell function by increasing oxidative stress, thereby worsening glycemic control in diabetes management."]}
