{"disease": "", "core_genes": ["Chemical urolithin B", "Gene p65"], "hypotheses": ["Urolithin B suppresses PRKCA-mediated activation of the NF-κB/p65 pathway in joint tissues, thereby reducing osteoarthritis severity by limiting pro-inflammatory gene expression."]}
{"disease": "", "core_genes": ["Chemical baricitinib", "Gene NF-kappaB"], "hypotheses": ["Baricitinib suppresses JAK1-mediated activation of ETS1, thereby inhibiting downstream NF-κB-driven pro-fibrotic gene expression in tissue fibrosis."]}
{"disease": "", "core_genes": ["Chemical baricitinib", "Gene Akt"], "hypotheses": ["Baricitinib-mediated inhibition of JAK2 suppresses AKT1 activation via PPP2CA-dependent dephosphorylation, thereby attenuating cardiac fibroblast proliferation and extracellular matrix deposition."]}
{"disease": "", "core_genes": ["Chemical baricitinib", "Gene mTOR"], "hypotheses": ["Baricitinib suppresses SMAD3-mediated profibrotic signaling via inhibition of the JAK2-PI3K/AKT/mTOR pathway, thereby attenuating fibrosis in inflammatory diseases."]}
{"disease": "", "core_genes": ["Chemical baricitinib", "Gene NF-kappaB"], "hypotheses": ["Baricitinib suppresses the interaction between JAK1 and EGFR, thereby attenuating NF-κB-mediated pro-inflammatory cytokine production in fibrotic disease models."]}
{"disease": "", "core_genes": ["Chemical baricitinib", "Gene PI3K"], "hypotheses": ["Baricitinib suppresses ETS1-mediated transcriptional activation of pro-fibrotic genes in fibroblasts by inhibiting JAK1-dependent PI3K/Akt signaling."]}
{"disease": "", "core_genes": ["Chemical MCC950", "Gene GFAP"], "hypotheses": ["PPP2CA modulates NLRP3-driven astrocyte activation by regulating GFAP expression, and inhibition of NLRP3 by MCC950 disrupts this PPP2CA-dependent pathway to attenuate neuroinflammation."]}
{"disease": "", "core_genes": ["Chemical brigatinib", "Gene MATE1"], "hypotheses": ["Brigatinib-mediated inhibition of MATE1 alters renal excretion of creatinine, which in turn modulates the pharmacokinetics of PPP2CA-interacting proteins such as ALK in ALK-positive NSCLC patients."]}
{"disease": "", "core_genes": ["Chemical 11H-indeno[1,2-b]quinoxalin-11-one oxime", "Gene JNK"], "hypotheses": ["IQ-1-mediated inhibition of JNK suppresses PPP2CA-dependent activation of JUN family transcription factors, thereby attenuating myocardial ischemia-induced inflammation and cell death."]}
{"disease": "", "core_genes": ["Chemical tenapanor", "Gene TRPV1"], "hypotheses": ["Tenapanor inhibits NHE3 to suppress TRPV1-mediated signaling via attenuation of EGFR–TRPV1 protein interactions, thereby reducing visceral hypersensitivity in IBS-C."]}
{"disease": "", "core_genes": ["Chemical imidazo[2,1-b]thiazole", "Gene EGFR"], "hypotheses": ["Imidazo[2,1-b]thiazole-mediated inhibition of EGFR suppresses downstream PIK3R1 signaling, thereby reducing proliferation in EGFR-overexpressing breast cancer cells."]}
{"disease": "", "core_genes": ["Chemical corynoxine", "Gene Akt"], "hypotheses": ["Corynoxine enhances PP2A-mediated dephosphorylation of AKT1, which suppresses MYC-driven oncogenic transcription and thereby inhibits non-small cell lung cancer cell proliferation."]}
{"disease": "", "core_genes": ["Chemical sappanone A", "Gene IL-17"], "hypotheses": ["Sappanone A suppresses PCBP1-mediated interleukin-17 binding, thereby inhibiting downstream JAK2/STAT3 inflammatory signaling in autoimmune disease models."]}
{"disease": "", "core_genes": ["Chemical sappanone A", "Gene p65"], "hypotheses": ["Sappanone A suppresses inflammatory cytokine production in rheumatoid arthritis by inhibiting the JAK2/PIK3R1 protein interaction, thereby dampening downstream PI3K/AKT signaling."]}
{"disease": "", "core_genes": ["Chemical LY2409881", "Gene NF-kappaB"], "hypotheses": ["LY2409881-mediated inhibition of IKBKB suppresses FOS activation, thereby reducing proliferation and EMT in gallbladder cancer cells."]}
{"disease": "", "core_genes": ["Chemical fremanezumab", "Gene calcitonin receptor-like receptor"], "hypotheses": ["Fremanezumab-mediated inhibition of CGRP signaling suppresses CALM1 activation, thereby reducing migraine with aura susceptibility."]}
{"disease": "", "core_genes": ["Chemical erdafitinib", "Gene PD-L1"], "hypotheses": ["Erdafitinib-mediated inhibition of FGFR2/FGFR3 suppresses PIK3R1-driven signaling, thereby enhancing anti-tumor T-cell activity in FGFR-altered urothelial carcinoma by reducing PD-L1–mediated immune evasion."]}
{"disease": "", "core_genes": ["Chemical erdafitinib", "Gene STAT3"], "hypotheses": ["Erdafitinib-mediated FGFR inhibition suppresses STAT3-driven MYC expression, thereby reducing proliferation and enhancing apoptosis in FGFR1-positive lung squamous cell carcinoma."]}
{"disease": "", "core_genes": ["Chemical lipofermata", "Gene SLC27A2"], "hypotheses": ["SLC27A2 interacts with CCNB1 to promote cell cycle progression in gastric cancer cells, thereby enhancing tumor proliferation."]}
{"disease": "", "core_genes": ["Chemical HFPO-DA", "Gene amh"], "hypotheses": ["HFPO-DA exposure modulates SUMO2-mediated post-translational modification of PFAS-interacting proteins, thereby disrupting metabolic and immune pathways that contribute to abnormal sperm motility in offspring."]}
{"disease": "", "core_genes": ["Chemical HFPO-DA", "Gene sox9a"], "hypotheses": ["HFPO-DA exposure represses SOX9 expression in neural crest-derived cells by disrupting upstream regulatory interactions involving PPP2CA and TTR, thereby impairing craniofacial development."]}
{"disease": "", "core_genes": ["Chemical lecanemab", "Gene fibrinogen"], "hypotheses": ["Lecanemab administration suppresses fibrinogen-induced impairment of transthyretin (TTR) and amyloid precursor protein (APP) interactions, thereby reducing cerebrovascular dysfunction in Alzheimer's disease."]}
{"disease": "", "core_genes": ["Chemical kongensin A", "Gene Akt"], "hypotheses": ["Kongensin A suppresses osteoarthritis progression by inducing PPP2CA-mediated dephosphorylation and inactivation of AKT1 in chondrocytes, thereby attenuating inflammatory signaling and extracellular matrix degradation."]}
{"disease": "", "core_genes": ["Chemical upadacitinib", "Gene PD-1"], "hypotheses": ["Upadacitinib suppresses STAT2-mediated pro-inflammatory signaling in immune cells, thereby reducing the severity of immune-related adverse events induced by PD-1 checkpoint inhibition."]}
{"disease": "", "core_genes": ["Chemical GNE-140", "Gene LDHA"], "hypotheses": ["Inhibition of LDHA by GNE-140 suppresses MYC-mediated transcriptional activation of hypertrophic genes by reducing lactate-induced H3K18 lactylation in cardiac myocytes."]}
{"disease": "", "core_genes": ["Chemical brensocatib", "Gene cathepsin C"], "hypotheses": ["Brensocatib-mediated inhibition of cathepsin C suppresses extracellular exosome release from neutrophils, thereby attenuating joint inflammation in rheumatoid arthritis."]}
{"disease": "", "core_genes": ["Chemical avacopan", "Gene myeloperoxidase"], "hypotheses": ["Inhibition of PPP2CA activity suppresses MPO-driven neutrophil activation and consequently reduces renal injury in ANCA-associated vasculitis."]}
{"disease": "", "core_genes": ["Chemical tezepelumab", "Gene KLK11"], "hypotheses": ["KLK11 modulates the activity of TGFBR3, thereby enhancing downstream TGF-β signaling and promoting immune cell infiltration in airway tissues relevant to severe asthma."]}
{"disease": "", "core_genes": ["Chemical pyrotinib", "Gene HER2"], "hypotheses": ["Pyrotinib-mediated inhibition of HER2 disrupts the ERBB2–VAV3 protein interaction, thereby suppressing breast cancer cell proliferation and survival."]}
{"disease": "", "core_genes": ["Chemical echinatin", "Gene IL-1beta"], "hypotheses": ["Echinatin suppresses EGR1-mediated transcriptional activation of IL1B, thereby reducing IL-1β-driven inflammatory responses in acute tissue injury."]}
{"disease": "", "core_genes": ["Chemical echinatin", "Gene IL-6"], "hypotheses": ["Echinatin suppresses MAPK14-mediated activation of MYC, thereby reducing IL-6-driven inflammatory responses in macrophages."]}
{"disease": "", "core_genes": ["Chemical echinatin", "Gene NF-kappaB"], "hypotheses": ["Echinatin inhibits NF-κB activation by suppressing TLR4-mediated protein interactions with EGFR and ETS1, thereby attenuating glomerular disease–associated inflammation."]}
{"disease": "", "core_genes": ["Chemical anlotinib", "Gene PI3K"], "hypotheses": ["Anlotinib inhibits PIK3R1-mediated activation of AKT isoforms (AKT1/2/3), thereby suppressing MYC-driven cell proliferation in mantle cell lymphoma."]}
{"disease": "", "core_genes": ["Chemical atuveciclib", "Gene IFN-gamma"], "hypotheses": ["Atuveciclib suppresses IFN-γ-induced PD-L1 expression in psoriasis by inhibiting CDK9-dependent activation of STAT3, thereby reducing immune evasion in inflamed skin."]}
{"disease": "", "core_genes": ["Chemical C188-9", "Gene MYC"], "hypotheses": ["Inhibition of PI4KA suppresses MYC-driven tumor progression by disrupting protein-protein interactions that facilitate MYC-mediated phenotypic plasticity in cancer cells."]}
{"disease": "", "core_genes": ["Chemical MLN2480", "Gene BRAF"], "hypotheses": ["MLN2480 treatment suppresses BRAF-mediated activation of AURKA, thereby reducing tumor cell proliferation in BRAF-mutant cancers."]}
{"disease": "", "core_genes": ["Chemical N-phenylpyrrolamides", "Gene topoisomerase II"], "hypotheses": ["N-phenylpyrrolamides inhibit topoisomerase II activity in cancer cells, thereby downregulating NRF1-mediated transcription of ATP synthase subunits and inducing mitochondrial dysfunction."]}
{"disease": "", "core_genes": ["Chemical deucravacitinib", "Gene IL-19"], "hypotheses": ["ETS1 modulates IL-19 expression downstream of TYK2 signaling, amplifying keratinocyte-mediated inflammatory responses in psoriatic disease."]}
{"disease": "", "core_genes": ["Chemical ravulizumab", "Gene AQP4"], "hypotheses": ["CREB3 activation enhances AQP4 expression on astrocytes, thereby increasing susceptibility to complement-mediated cytotoxicity in neuromyelitis optica spectrum disorder."]}
{"disease": "", "core_genes": ["Chemical esketamine", "Gene JNK"], "hypotheses": ["Esketamine suppresses PI4KA-mediated activation of the JUN signaling axis in spinal microglia, thereby attenuating neuronal sensitization in cancer-induced bone pain."]}
{"disease": "", "core_genes": ["Chemical PLX5622", "Gene NLRP3"], "hypotheses": ["PLX5622-mediated inhibition of CSF1R suppresses AKT1-mTOR signaling in microglia, which in turn represses NLRP3 inflammasome activation and attenuates neuroinflammation in Alzheimer’s disease models."]}
{"disease": "", "core_genes": ["Chemical PLX5622", "Gene mTOR"], "hypotheses": ["PLX5622-induced inhibition of CSF1R suppresses mTOR-driven NLRP3 inflammasome activation in microglia via downregulation of LAMTOR complex components, thereby enhancing autophagy and reducing neuroinflammation in early Alzheimer's disease."]}
{"disease": "", "core_genes": ["Chemical sintilimab", "Gene CEA"], "hypotheses": ["Sintilimab-mediated inhibition of PD-1 signaling suppresses VEGFA expression via downregulation of FOS and SMAD3 activity, thereby reducing angiogenesis and enhancing anti-tumor efficacy in CEA-high non-small cell lung cancer."]}
{"disease": "", "core_genes": ["Chemical abrocitinib", "Gene JAK1"], "hypotheses": ["Abrocitinib-mediated inhibition of JAK1 suppresses EGFR-driven epidermal hyperplasia by downregulating KRT16 expression in atopic dermatitis."]}
{"disease": "", "core_genes": ["Chemical emapalumab", "Gene fibrinogen"], "hypotheses": ["CREB3 activation promotes abnormalities of the common coagulation pathway in hemophagocytic lymphohistiocytosis by modulating fibrinogen consumption during hyperinflammation."]}
{"disease": "", "core_genes": ["Chemical selpercatinib", "Gene CCDC6"], "hypotheses": ["PPP2CA activity modulates the oncogenic signaling of CCDC6-RET fusion proteins, thereby influencing selpercatinib sensitivity and the emergence of resistance mutations in RET-driven cancers."]}
{"disease": "", "core_genes": ["Chemical osocimab", "Gene FXI"], "hypotheses": ["Osocimab-mediated inhibition of FXIa suppresses venous thrombosis risk in patients with uterine disease by modulating the intrinsic coagulation pathway without exacerbating hemorrhagic disorders."]}
{"disease": "", "core_genes": ["Chemical AZD7648", "Gene CFTR"], "hypotheses": ["AZD7648-mediated inhibition of PRKDC enhances CFTR gene insertion efficiency by disrupting the PRKDC-GSK3B complex, thereby modulating downstream DNA repair pathway selection in cystic fibrosis gene therapy."]}
{"disease": "", "core_genes": ["Chemical BMS-202", "Gene Akt"], "hypotheses": ["BMS-202 suppresses glioblastoma proliferation by inhibiting PD-L1-mediated activation of AKT1, thereby disrupting downstream MYC and GSK3B signaling involved in metabolic adaptation and invasion."]}
{"disease": "", "core_genes": ["Chemical Yoda1", "Gene TGF-beta"], "hypotheses": ["Yoda1-mediated activation of Piezo1 promotes ubiquitin-dependent degradation of TGF-β receptor 2 via interaction with UBC, thereby attenuating TGF-β-driven fibrosis."]}
{"disease": "", "core_genes": ["Chemical HFPO-DA", "Gene vtg1"], "hypotheses": ["HFPO-DA exposure induces MT1A-mediated modulation of TP53 activity, thereby altering hepatocyte cell cycle progression and contributing to metabolic dysregulation."]}
{"disease": "", "core_genes": ["Chemical PT2399", "Gene BMAL1"], "hypotheses": ["PT2399-mediated inhibition of HIF2α disrupts BMAL1-dependent activation of CREBBP, thereby repressing circadian gene expression and reducing tumorigenicity in hereditary clear cell renal cell carcinoma."]}
{"disease": "", "core_genes": ["Chemical esketamine", "Gene Akt"], "hypotheses": ["Esketamine-induced activation of AKT1 suppresses GSK3B activity, thereby enhancing neuroplasticity and reducing depressive-like behaviors."]}
{"disease": "", "core_genes": ["Chemical seladelpar", "Gene PPAR"], "hypotheses": ["Seladelpar-mediated activation of PPARδ suppresses UBE2I expression in cholangiocytes, thereby attenuating autoimmune injury and disease progression in primary biliary cholangitis."]}
{"disease": "", "core_genes": ["Chemical AB680", "Gene CD4"], "hypotheses": ["Inhibition of CD73 by AB680 suppresses adenosine-mediated activation of CD81, thereby enhancing CD4+ T cell effector function within the tumor microenvironment."]}
{"disease": "", "core_genes": ["Chemical DDQ", "Gene MAP2"], "hypotheses": ["DDQ treatment enhances MAP2 expression in Alzheimer’s disease neurons by activating the SIRT3–CREB1 axis, thereby promoting mitochondrial biogenesis and reducing tau-induced neurotoxicity."]}
{"disease": "", "core_genes": ["Chemical maackiain", "Gene p53"], "hypotheses": ["Maackiain enhances p53-mediated apoptosis in hepatocellular carcinoma cells by upregulating PPP2CA, leading to dephosphorylation and activation of p53."]}
{"disease": "", "core_genes": ["Chemical parthenolide", "Gene NeuN"], "hypotheses": ["Parthenolide promotes NeuN expression in neuronal cells by inhibiting STAT3-mediated repression of MAPK1 signaling."]}
{"disease": "", "core_genes": ["Chemical parthenolide", "Gene mTOR"], "hypotheses": ["Parthenolide suppresses MYC-mediated activation of mTOR signaling in tumor cells, thereby reducing immune evasion and enhancing antitumor T cell responses."]}
{"disease": "", "core_genes": ["Chemical coumermycin", "Gene JAK2"], "hypotheses": ["Coumermycin-mediated activation of JAK2 enhances CASP3-dependent apoptosis in neuronal cells subjected to ischemic stroke."]}
{"disease": "", "core_genes": ["Chemical fulvic acid", "Gene cytochrome c"], "hypotheses": ["Fulvic acid enhances mitochondrial ATP synthesis in electroactive microbes by upregulating cytochrome c expression and promoting MYC-mediated NAD binding activity."]}
{"disease": "", "core_genes": ["Chemical naringenin", "Gene occludin"], "hypotheses": ["Naringenin enhances occludin expression and epithelial barrier integrity by promoting YAP1-mediated activation of STAT3 signaling in intestinal tissue."]}
{"disease": "", "core_genes": ["Chemical naringenin", "Gene ZO-1"], "hypotheses": ["Naringenin enhances ZO-1-mediated barrier integrity by promoting PPP2CA-dependent dephosphorylation of YAP1, thereby amplifying Hippo pathway signaling and suppressing STAT3-driven inflammatory responses."]}
{"disease": "", "core_genes": ["Chemical alpha-pinene", "Gene GLUT4"], "hypotheses": ["α-Pinene enhances CREB3-mediated transcriptional activation of SLC2A4, thereby promoting GLUT4-dependent glucose uptake and ameliorating cellular stress in insulin-sensitive tissues."]}
{"disease": "", "core_genes": ["Chemical astaxanthin", "Gene MFN2"], "hypotheses": ["Astaxanthin-induced upregulation of MFN2 enhances its interaction with VCP, thereby promoting mitochondrial quality control and attenuating muscle atrophy under oxidative stress conditions."]}
{"disease": "", "core_genes": ["Chemical baicalein", "Gene SLC7A11"], "hypotheses": ["Baicalein enhances the interaction between SLC7A11 and EP300, thereby promoting chromatin acetylation that suppresses renal fibrosis by further upregulating antioxidant defense pathways."]}
{"disease": "", "core_genes": ["Chemical deoxynivalenol", "Gene caspase-12"], "hypotheses": ["Deoxynivalenol exposure induces intestinal epithelial apoptosis by activating EIF2AK3-mediated ATF4 signaling, which upregulates caspase-12."]}
{"disease": "", "core_genes": ["Chemical deoxynivalenol", "Gene NCOA4"], "hypotheses": ["CTCF suppresses NCOA4-mediated ferritinophagy, thereby attenuating deoxynivalenol-induced ferroptosis and hepatic mitochondrial dysfunction."]}
{"disease": "", "core_genes": ["Chemical deoxynivalenol", "Gene catalase"], "hypotheses": ["Inhibition of MAPK14 suppresses DON-induced apoptosis by preserving catalase activity and reducing oxidative stress in hepatic cells."]}
{"disease": "", "core_genes": ["Chemical DEP", "Gene ACE2"], "hypotheses": ["Diesel exhaust particle exposure induces PPP2CA-mediated upregulation of TMPRSS2 in pulmonary tissue, thereby enhancing SARS-CoV-2 entry and COVID-19 severity."]}
{"disease": "", "core_genes": ["Chemical gallein", "Gene IL-6"], "hypotheses": ["Gallein-induced upregulation of IL-6 enhances IL6ST-mediated signaling in osteoblasts, thereby promoting osteoprotegerin secretion and suppressing osteoclast differentiation."]}
{"disease": "", "core_genes": ["Chemical gallein", "Gene OPG"], "hypotheses": ["Pharmacological inhibition of GNB1-containing Gβγ complexes modulates JUN phosphorylation to enhance OPG expression in osteoblasts, thereby suppressing RANKL-induced osteoclastogenesis."]}
{"disease": "", "core_genes": ["Chemical geraniol", "Gene occludin"], "hypotheses": ["Geraniol promotes occludin-mediated barrier integrity by activating NFE2L2, which suppresses NLRP3 inflammasome signaling in epithelial cells."]}
{"disease": "", "core_genes": ["Chemical pristane", "Gene Egr1"], "hypotheses": ["PI4KA activation enhances Egr1-mediated heparanase expression, thereby promoting endothelial glycocalyx degradation and exacerbating pristane-induced lung injury."]}
{"disease": "", "core_genes": ["Chemical pristane", "Gene CD141"], "hypotheses": ["Pristane-induced activation of MAPK1 promotes upregulation of THBD (CD141), which exacerbates diffuse alveolar hemorrhage by disrupting endothelial hemostasis in genetically susceptible mice."]}
{"disease": "", "core_genes": ["Chemical zebularine", "Gene cGAS"], "hypotheses": ["Zebularine-induced activation of cGAS enhances the interaction with STAT3, leading to augmented interferon signaling and increased antitumor immune responses."]}
{"disease": "", "core_genes": ["Chemical salidroside", "Gene GFAP"], "hypotheses": ["Salidroside administration enhances GFAP-mediated astrocyte interaction with ROCK1, thereby promoting neuroprotective remodeling after cerebral ischemia."]}
{"disease": "", "core_genes": ["Chemical salidroside", "Gene GPX4"], "hypotheses": ["Salidroside administration enhances the GPX4–TAF1 protein interaction, thereby amplifying GPX4-mediated suppression of ferroptosis in neuronal cells."]}
{"disease": "", "core_genes": ["Chemical salidroside", "Gene DCX"], "hypotheses": ["Salidroside enhances DCX-mediated neurogenesis by inhibiting GSK3B activity, thereby promoting neuronal precursor cell differentiation after cerebral ischemia."]}
{"disease": "", "core_genes": ["Chemical sinomenine", "Gene HO-1"], "hypotheses": ["Sinomenine-induced activation of NFE2L2 enhances SUMO1-mediated sumoylation of NFE2L2, thereby amplifying HO-1 upregulation and further suppressing oxidative stress in pulmonary arterial hypertension."]}
{"disease": "", "core_genes": ["Chemical trichostatin A", "Gene HMGB1"], "hypotheses": ["Inhibition of HDAC11 by Trichostatin A promotes HMGB1 acetylation and extracellular release in macrophages, thereby enhancing pro-inflammatory signaling and contributing to tissue injury."]}
{"disease": "", "core_genes": ["Chemical hesperetin", "Gene Parkin"], "hypotheses": ["Hesperetin administration enhances Parkin-mediated mitophagy by upregulating SIRT1 activity, thereby attenuating NLRP3 inflammasome activation in models of neurodegenerative and metabolic disease."]}
{"disease": "", "core_genes": ["Chemical hesperetin", "Gene PINK1"], "hypotheses": ["Hesperetin administration upregulates PINK1 expression via AMPKα activation, which in turn enhances the interaction between PINK1 and NEDD8 to promote mitophagy and ameliorate hepatic steatosis in non-alcoholic fatty liver disease."]}
{"disease": "", "core_genes": ["Chemical P4", "Gene SF-1"], "hypotheses": ["PPP2CA modulates NR5A1 (SF-1) transcriptional activity in granulosa cells, thereby regulating aromatase expression and influencing local estradiol production in endometriosis."]}
{"disease": "", "core_genes": ["Chemical CpG", "Gene IL-6"], "hypotheses": ["PIM1 activation enhances CpG-induced NF-κB signaling, thereby amplifying IL-6-mediated inflammatory responses in leishmaniasis."]}
{"disease": "", "core_genes": ["Chemical CpG", "Gene TNF-alpha"], "hypotheses": ["ETS2 interaction with TLR9 enhances CpG ODN-induced TNF-alpha production by promoting NF-κB activation in innate immune cells."]}
{"disease": "", "core_genes": ["Chemical CpG", "Gene CD8"], "hypotheses": ["CpG-induced activation of TLR9 enhances CD8+ T cell cytotoxicity by upregulating ETS2-mediated transcriptional programs in dendritic cells."]}
{"disease": "", "core_genes": ["Chemical dimethyldioctadecylammonium bromide", "Gene IL-17"], "hypotheses": ["DDA-induced upregulation of IL17A enhances TRAF6-mediated signaling in CD4+ T cells, thereby amplifying neutrophil recruitment and augmenting protection against pulmonary tuberculosis."]}
{"disease": "", "core_genes": ["Chemical asiatic acid", "Gene GPX4"], "hypotheses": ["Asiatic acid administration upregulates GPX4 expression via TAF1 interaction, thereby suppressing ferroptosis-induced cell death in malignant mixed neoplasms."]}
{"disease": "", "core_genes": ["Chemical sodium arsenite", "Gene RAGE"], "hypotheses": ["PPP2CA activation suppresses sodium arsenite-induced RAGE-mediated caspase-3 activation and apoptosis in hepatic tissue."]}
{"disease": "", "core_genes": ["Chemical tetramethylpyrazine", "Gene GPX4"], "hypotheses": ["Tetramethylpyrazine enhances the neuroprotective effect of GPX4 in spinal cord injury by upregulating UBC-mediated stabilization of GPX4 protein, thereby further suppressing ferroptosis."]}
{"disease": "", "core_genes": ["Chemical carnosic acid", "Gene AMPK"], "hypotheses": ["Carnosic acid-mediated activation of AMPK suppresses STAT3 signaling via inhibition of the PIK3R1-STAT3 interaction, leading to reduced insulin resistance in metabolic disease models."]}
{"disease": "", "core_genes": ["Chemical trimethylamine", "Gene IL-1beta"], "hypotheses": ["Trimethylamine-induced activation of the ZBP1-NLRP3 pathway enhances IL1B-driven upregulation of IGFBP7, thereby promoting renal fibrosis in chronic kidney injury."]}
{"disease": "", "core_genes": ["Chemical fucoxanthin", "Gene GSK-3beta"], "hypotheses": ["Fucoxanthin-induced inhibitory phosphorylation of GSK-3β suppresses MYC-mediated pro-apoptotic signaling, thereby enhancing neuronal survival in neurodegenerative disease models."]}
{"disease": "", "core_genes": ["Chemical diacerein", "Gene Nrf2"], "hypotheses": ["Diacerein enhances Nrf2-dependent antioxidant responses to suppress hemolytic anemia due to glutathione metabolism anomalies by upregulating GPX4 and restoring redox homeostasis."]}
{"disease": "", "core_genes": ["Chemical NaH", "Gene peroxidase"], "hypotheses": ["Enhanced MPO activity modulates immune signaling pathways to promote the development of vasculitis in the context of postinfectious disorders."]}
{"disease": "", "core_genes": ["Chemical crocin", "Gene SOX2"], "hypotheses": ["Crocin enhances mesenchymal stem cell pluripotency by upregulating SOX2, which in turn promotes NANOG expression through protein-protein interaction, thereby facilitating neural differentiation."]}
{"disease": "", "core_genes": ["Chemical IAA", "Gene IL-10"], "hypotheses": ["EP300 enhances AHR-mediated induction of IL-10–producing regulatory T cells in response to microbiota-derived indole-3-acetic acid, thereby suppressing intestinal inflammation."]}
{"disease": "", "core_genes": ["Chemical artemisinin", "Gene Nrf2"], "hypotheses": ["Artemisinin-induced activation of Nrf2 suppresses MYC-mediated regulation of KEAP1, thereby enhancing antioxidant defenses and reducing ferroptosis in oxidative stress-related diseases."]}
{"disease": "", "core_genes": ["Chemical artemisinin", "Gene GPX4"], "hypotheses": ["Artemisinin suppresses MYC-mediated repression of KEAP1, thereby enhancing Nrf2-driven GPX4 expression and reducing neuronal ferroptosis in Alzheimer’s disease models."]}
{"disease": "Disease hypoxia", "core_genes": ["Gene catalase"], "hypotheses": ["Catalase supplementation represses CTLA4-mediated inflammatory signaling in pulmonary hypertension under hypoxic conditions, thereby attenuating vascular remodeling."]}
{"disease": "Disease arbovirus", "core_genes": ["Gene PSMC1"], "hypotheses": ["PSMC1 physically interacts with MYC to suppress arbovirus replication by promoting the proteasomal degradation of viral or host pro-viral proteins."]}
{"disease": "Disease arbovirus", "core_genes": ["Gene SHOC2"], "hypotheses": ["UBC-mediated ubiquitination of SHOC2 promotes its degradation and thereby enhances arbovirus replication by diminishing SHOC2-driven antiviral restriction in human cells."]}
{"disease": "Disease T", "core_genes": ["Gene Parkin"], "hypotheses": ["NEDD8-mediated neddylation of PINK1 enhances Parkin activation and promotes mitophagy efficiency in dopaminergic neurons."]}
{"disease": "Disease platelet aggregation", "core_genes": ["Gene SOD3"], "hypotheses": ["Extracellular SOD3 modulates platelet aggregation by decreasing reactive oxygen species–mediated platelet activation in oxidative stress conditions."]}
{"disease": "Disease bone loss", "core_genes": ["Gene FGF18"], "hypotheses": ["FGF18 enhances osteoblast survival and bone mass by activating FGFRL1-mediated signaling, which in turn represses CASP3-dependent apoptosis in bone tissue."]}
{"disease": "Disease breast cancer", "core_genes": ["Gene dynamin 1"], "hypotheses": ["SUMO1-mediated SUMOylation of DNM1 represses its synaptic function, thereby exacerbating cognitive impairment in breast cancer patients following chemotherapy."]}
{"disease": "Disease breast cancer", "core_genes": ["Gene SNX13"], "hypotheses": ["SNX13 attenuates breast cancer cell proliferation by disrupting GNAS-mediated signaling pathways."]}
{"disease": "Disease basal cell carcinoma", "core_genes": ["Gene CTSH"], "hypotheses": ["CTSH reduces VCAM1-mediated recruitment of pro-tumorigenic immune cells, thereby limiting basal cell carcinoma progression."]}
{"disease": "Disease cognitive impairment", "core_genes": ["Gene thrombomodulin"], "hypotheses": ["Thrombomodulin restricts blood-brain barrier disruption by stabilizing ACTB-mediated cytoskeletal dynamics, thereby alleviating cognitive impairment in Alzheimer’s disease."]}
{"disease": "Disease atopic dermatitis", "core_genes": ["Gene AlkB"], "hypotheses": ["ALKBH5 counteracts atopic dermatitis pathogenesis by modulating NRF1-driven expression of genes associated with skin barrier function and immune response."]}
{"disease": "Disease diabetic nephropathy", "core_genes": ["Gene PRDM16"], "hypotheses": ["SUMO1-mediated SUMOylation of PRDM16 restrains SMAD3 signaling, thereby attenuating tubulointerstitial fibrosis in diabetic nephropathy."]}
{"disease": "Disease emphysema", "core_genes": ["Gene Igkv4-91"], "hypotheses": ["Downregulation of IGKV4-1 in B cells suppresses inflammatory cytokine production and mitigates alveolar destruction in emphysema."]}
{"disease": "Disease fibrosis", "core_genes": ["Gene GRIM-19"], "hypotheses": ["Elevated GRIM-19 dampens STAT3-mediated activation of EGR1, thereby curbing profibrotic gene expression and limiting fibrosis progression."]}
{"disease": "Disease gout", "core_genes": ["Gene CD45"], "hypotheses": ["CD45 constrains NLRP3 inflammasome activation in macrophages by disrupting interactions with SNRPB, thereby tempering inflammatory responses in gout."]}
{"disease": "Disease gout", "core_genes": ["Gene CD28"], "hypotheses": ["GRB2 association with CD28 diminishes CD4-positive T cell costimulation, thereby reducing monosodium urate-induced inflammation in gout."]}
{"disease": "Disease heart failure", "core_genes": ["Gene CTSV"], "hypotheses": ["CTSV dampens maladaptive cardiac remodeling in heart failure by interfering with NPPA activity and maintaining extracellular matrix homeostasis."]}
{"disease": "Disease hepatocellular carcinoma", "core_genes": ["Gene HNF4A-AS1"], "hypotheses": ["HNF4A-AS1 overexpression suppresses hepatocellular carcinoma progression by enhancing the ubiquitin-dependent degradation of PCBP2 via recruitment of UBC, thereby disrupting oncogenic protein complexes involving PCBP2 and SUMO2."]}
{"disease": "Disease hepatocellular carcinoma", "core_genes": ["Gene SLC6A13"], "hypotheses": ["SLC6A13 physically interacts with ATXN1 to suppress inflammasome-mediated inflammatory cytokine production in hepatocellular carcinoma under ethanol exposure."]}
{"disease": "Disease herpes simplex", "core_genes": ["Gene SLC19A1"], "hypotheses": ["SP1 enhances SLC19A1 transcription, thereby promoting STING-mediated interferon responses and restricting HSV-1 replication."]}
{"disease": "Disease hyperalgesia", "core_genes": ["Gene IFT88"], "hypotheses": ["Disruption of IFT88 impairs primary cilium-dependent Hedgehog (SHH) signaling, which in turn suppresses TRPV1-mediated nociceptor sensitization and attenuates hyperalgesia."]}
{"disease": "Disease hyperalgesia", "core_genes": ["Gene KCNT1"], "hypotheses": ["Restoration of KCNT1 expression in sensory neurons suppresses PENK-mediated pain signaling, thereby reducing hyperalgesia in disease states."]}
{"disease": "Disease hypotension", "core_genes": ["Gene UBR1"], "hypotheses": ["UBR1-mediated ubiquitination of FOS modulates vascular smooth muscle gene expression, thereby influencing susceptibility to hypotension."]}
{"disease": "Disease immunodeficiency", "core_genes": ["Gene DGAT1"], "hypotheses": ["DGAT1 deficiency suppresses APOA1-mediated lipid transport in intestinal epithelial cells, thereby exacerbating hypogammaglobulinemia and cellular immunodeficiency."]}
{"disease": "Disease infection", "core_genes": ["Gene AEN"], "hypotheses": ["AEN interacts with TLE5 to enhance type I interferon signaling, thereby suppressing Kaposi sarcoma-associated herpesvirus replication in infected cells."]}
{"disease": "Disease inflammatory", "core_genes": ["Gene SP8"], "hypotheses": ["SUMO1-mediated modification of CASP8 modulates inflammatory cell apoptosis, thereby influencing the severity of inflammatory diseases."]}
{"disease": "Disease inflammatory", "core_genes": ["Gene NRN1"], "hypotheses": ["NRN1 modulates inflammatory disease severity by inhibiting TRAF2-mediated activation of the NF-κB pathway, thereby suppressing IL1B and IL18 expression."]}
{"disease": "Disease inflammatory", "core_genes": ["Gene RPL41"], "hypotheses": ["RPL41 interacts with CSNK2B to suppress oxidative stress–induced neutrophilic inflammation in airway innate lymphoid cells following exposure to combustion products."]}
{"disease": "Disease lung disease", "core_genes": ["Gene Igkv4-91"], "hypotheses": ["SERPINB13 expression modulates the inflammatory response in interstitial lung disease by regulating immune cell recruitment to the lung parenchyma."]}
{"disease": "Disease lymph node metastasis", "core_genes": ["Gene ADRA2A"], "hypotheses": ["ADRA2A activation suppresses lymph node metastasis in pancreatic ductal adenocarcinoma by inhibiting VAV3-mediated signaling pathways that promote tumor cell invasion."]}
{"disease": "Disease lymphedema", "core_genes": ["Gene GLP-1"], "hypotheses": ["GLP-1 receptor agonists suppress lymphedema development by inhibiting insulin resistance–mediated impairment of lymphatic endothelial function."]}
{"disease": "Disease lymphoma", "core_genes": ["Gene BTKi"], "hypotheses": ["IBTK inhibits BTK-mediated BCR signaling, thereby reducing mantle cell lymphoma cell survival and promoting sensitivity to Bruton tyrosine kinase inhibitors."]}
{"disease": "Disease melanoma", "core_genes": ["Gene IL-2"], "hypotheses": ["IL-2 administration enhances the antitumor efficacy of tumor-infiltrating lymphocytes in melanoma by upregulating CEBPG expression, thereby increasing susceptibility of cutaneous malignant melanoma cells to immune-mediated elimination."]}
{"disease": "Disease multiple myeloma", "core_genes": ["Gene NLRC5"], "hypotheses": ["EBF1 activation enhances NLRC5-mediated MHC class I antigen presentation in multiple myeloma cells, thereby promoting tumor immune surveillance."]}
{"disease": "Disease multiple sclerosis", "core_genes": ["Gene CAR"], "hypotheses": ["Targeted inhibition of the CD19-PIK3R1 signaling axis in B cells using CAR-based therapies suppresses neuroinflammation and demyelination in multiple sclerosis."]}
{"disease": "Disease muscle atrophy", "core_genes": ["Gene GLP-1"], "hypotheses": ["Liraglutide attenuates muscle atrophy by activating YAP1, whose interaction with GSK3B further enhances mitochondrial function and inhibits pro-senescent signaling in skeletal muscle."]}
{"disease": "Disease myasthenia gravis", "core_genes": ["Gene CAR T"], "hypotheses": ["Engineering CAR T cells to selectively target B cells producing autoantibodies against CHRNA1 suppresses neuromuscular junction dysfunction in myasthenia gravis."]}
{"disease": "Disease cardiomyopathy", "core_genes": ["Gene Bmal1"], "hypotheses": ["Bmal1 deficiency suppresses NFE2L2-mediated antioxidant responses via disruption of the AKT1 pathway, thereby promoting oxidative stress–induced myocardial fibrosis in cardiomyopathy."]}
{"disease": "Disease myocardial infarction", "core_genes": ["Gene ALKBH5"], "hypotheses": ["ALKBH5 modulates the NRF1-mediated transcriptional response to myocardial infarction by altering m6A RNA methylation status, thereby regulating cardiac cell survival and post-infarct remodeling."]}
{"disease": "Disease myositis", "core_genes": ["Gene CAR"], "hypotheses": ["PLCG2 overexpression enhances the survival of autoreactive B cells in myositis, thereby reducing the efficacy of CD19-directed CAR T cell therapy."]}
{"disease": "Disease necrosis", "core_genes": ["Gene STC2"], "hypotheses": ["STC2 suppresses AIFM1-mediated mitochondrial apoptosis, thereby reducing necrosis under oxidative stress conditions."]}
{"disease": "Disease metastasis", "core_genes": ["Gene MAO-B"], "hypotheses": ["Downregulation of MAOB in anal carcinoma promotes metastatic progression by enhancing SRPK1-mediated signaling pathways that increase cancer cell motility."]}
{"disease": "Disease radiation-induced", "core_genes": ["Gene Cx43"], "hypotheses": ["ELAVL1 dampens radiation-induced cardiomyocyte apoptosis by downregulating post-transcriptional stabilization of GJB3 (Cx43) in response to HIF1A signaling."]}
{"disease": "Disease osteoarthritis", "core_genes": ["Gene CBFbeta"], "hypotheses": ["PPP2CA reduces CBFβ stability, thereby restraining chondrogenic differentiation of mesenchymal stem cells and limiting cartilage degeneration in osteoarthritis."]}
{"disease": "Disease osteoarthritis", "core_genes": ["Gene RUNX3"], "hypotheses": ["SMAD3 interaction with RUNX3 leads to decreased transcription of lubricin and aggrecan genes in chondrocytes, mitigating the progression of osteoarthritis."]}
{"disease": "Disease postoperative pain", "core_genes": ["Gene PTX3"], "hypotheses": ["PTX3 diminishes postoperative pain by suppressing cytoskeletal rearrangements in dorsal root ganglion neurons through CD44-dependent pathways."]}
{"disease": "Disease Parkinson's disease", "core_genes": ["Gene GALNT9"], "hypotheses": ["Reduced GALNT9-mediated glycosyltransferase activity suppresses dopamine transport by impairing tyrosine hydroxylase function, thereby promoting neurodegeneration in Parkinson’s disease."]}
{"disease": "Disease polycystic ovary syndrome", "core_genes": ["Gene FTH1"], "hypotheses": ["EP300-mediated acetylation of FTH1 enhances iron sequestration and suppresses ferroptosis in ovarian granulosa cells, thereby mitigating granulosa cell dysfunction in polycystic ovary syndrome."]}
{"disease": "Disease pruritus", "core_genes": ["Gene NPY2R"], "hypotheses": ["PI4KA interaction with NPY2R inhibits itch transmission by enhancing NPY2R-mediated tonic suppression in spinal cord sensory neurons."]}
{"disease": "Disease psoriasis", "core_genes": ["Gene MIR181A2HG"], "hypotheses": ["SUMO1-mediated sumoylation of SOX6 enhances its ability to repress keratinocyte proliferation downstream of MIR181A2HG signaling in psoriasis."]}
{"disease": "Disease social isolation", "core_genes": ["Gene KIM-1"], "hypotheses": ["Reduced VIP expression in the brain suppresses neuroprotective signaling, thereby promoting susceptibility to cerebrovascular dementia in individuals experiencing social isolation."]}
{"disease": "Disease social isolation", "core_genes": ["Gene MMP-12"], "hypotheses": ["MMP-12 upregulation induces CXCL8-mediated neuroinflammation, thereby promoting gray matter loss in brain regions vulnerable to social isolation."]}
{"disease": "Disease social isolation", "core_genes": ["Gene NfL"], "hypotheses": ["Social isolation enhances CLU-mediated positive regulation of neuron death, leading to increased plasma NfL levels indicative of neuroaxonal injury."]}
{"disease": "Disease social isolation", "core_genes": ["Gene prostasin"], "hypotheses": ["Social isolation suppresses VIP expression in the brain, thereby promoting the development of cerebrovascular dementia through impaired neuroprotective signaling."]}
{"disease": "Disease social isolation", "core_genes": ["Gene renin"], "hypotheses": ["Social isolation-induced upregulation of renin enhances neuroinflammation, thereby impairing multicellular organismal reproductive processes."]}
{"disease": "Disease social isolation", "core_genes": ["Gene RANK"], "hypotheses": ["Elevated TNFRSF11A (RANK) induced by social isolation promotes caspase-8 activation via TRAF6 interaction, thereby enhancing apoptotic signaling in immune cells."]}
{"disease": "Disease social isolation", "core_genes": ["Gene DR5"], "hypotheses": ["Upregulation of TNFRSF10B in neuronal cells induces FOS-mediated transcriptional changes that promote vulnerability to neurostructural alterations associated with social isolation."]}
{"disease": "Disease social isolation", "core_genes": ["Gene DR4"], "hypotheses": ["Upregulation of TNFRSF10A in socially isolated individuals suppresses CASP8 activity, thereby promoting necrosis over apoptosis in peripheral tissues."]}
{"disease": "Disease social isolation", "core_genes": ["Gene ALK1"], "hypotheses": ["Activation of ACVRL1 modulates PIK3R1 signaling in endothelial cells to alter neurovascular integrity, thereby increasing susceptibility to social isolation-induced vascular dysfunction."]}
{"disease": "Disease traumatic brain injury", "core_genes": ["Gene SNAP-25"], "hypotheses": ["Activation of EGFR signaling modulates SNAP-25–mediated synaptic vesicle fusion, thereby influencing neuroinflammatory responses and neurological outcomes following traumatic brain injury."]}
{"disease": "Disease traumatic brain injury", "core_genes": ["Gene LC3B"], "hypotheses": ["PPP2CA activation enhances MAP1LC3B-mediated autophagy, thereby reducing neuroinflammation and secondary neuronal damage following traumatic brain injury."]}
{"disease": "Disease stress", "core_genes": ["Gene Iba1"], "hypotheses": ["Iba1-mediated microglial activation enhances RPL7A expression, thereby promoting neuroinflammatory responses in central nervous system disease under disease stress conditions."]}
{"disease": "Disease chronic GVHD", "core_genes": ["Gene CX3CL1"], "hypotheses": ["EP300 enhances CX3CL1-mediated recruitment of CX3CR1-expressing macrophages, thereby promoting fibrotic remodeling in chronic graft-versus-host disease."]}
{"disease": "Disease metastatic disease", "core_genes": ["Gene PTX3"], "hypotheses": ["PTX3 physically interacts with FGF2 to enhance epithelial–mesenchymal transition and promote metastatic progression in gastric cancer."]}
{"disease": "Disease fire", "core_genes": ["Gene IL-1beta"], "hypotheses": ["PPP2CA suppresses IL-1β-mediated airway epithelial inflammation induced by wildfire smoke exposure."]}
{"disease": "Disease post-COVID-19", "core_genes": ["Gene CCL5"], "hypotheses": ["CCL5 activation of CCR5 signaling induces PIK3R1-mediated pathways that sustain persistent immune cell recruitment and chronic inflammation in post-COVID-19 syndrome."]}
{"disease": "Disease ACS", "core_genes": ["Gene GPRC5D"], "hypotheses": ["GPRC5D modulates the inflammatory response in acute coronary syndrome by regulating CCL4-mediated leukocyte recruitment during myocardial injury."]}
{"disease": "Disease airway obstruction", "core_genes": ["Gene MCP-1"], "hypotheses": ["AGER activation enhances MCP-1 production in airway tissues, thereby promoting tissue remodeling and exacerbating airway obstruction following tobacco smoke exposure."]}
{"disease": "Disease Alzheimer's disease", "core_genes": ["Gene IRF6"], "hypotheses": ["IRF6 modulates STAT3-mediated neuroinflammatory signaling, thereby influencing the progression of neurodegeneration in late-onset Alzheimer's disease."]}
{"disease": "Disease Alzheimer's disease", "core_genes": ["Gene ARL2"], "hypotheses": ["ARL2 upregulation promotes PPP2CB-mediated dephosphorylation of neuronal substrates, thereby enhancing neuronal resilience to neurodegeneration in Alzheimer's disease."]}
{"disease": "Disease Alzheimer's disease", "core_genes": ["Gene S100A13"], "hypotheses": ["Upregulation of S100A13 enhances neuroinflammation in Alzheimer's disease by modulating the activity of STK4 and FOXA1 within APOE-associated signaling pathways."]}
{"disease": "Disease Alzheimer's disease", "core_genes": ["Gene ISG15"], "hypotheses": ["ISG15-mediated ISGylation of HSPA1A suppresses autophagic flux and enhances tau (MAPT) accumulation in Alzheimer’s disease neurons."]}
{"disease": "Disease perianal disease", "core_genes": ["Gene leptin"], "hypotheses": ["Leptin modulates perianal disease severity in Crohn’s disease by enhancing TNFSF4-mediated immune activation."]}
{"disease": "Disease perianal disease", "core_genes": ["Gene resistin"], "hypotheses": ["Resistin upregulates TNFSF4 expression in perianal tissues, thereby enhancing local inflammatory responses and promoting fistula formation in Crohn’s disease-associated perianal disease."]}
{"disease": "Disease anaphylaxis", "core_genes": ["Gene IL-8"], "hypotheses": ["TTR-mediated modulation of neutrophil degranulation mimics IL-8-driven amplification of the inflammatory response during anaphylaxis."]}
{"disease": "Disease aneuploidy", "core_genes": ["Gene TPX2"], "hypotheses": ["CDK2 activity recapitulates TPX2-mediated disruption of the p53/p21 checkpoint, fostering mitotic errors that resemble aneuploidy development."]}
{"disease": "Disease suicidal ideation", "core_genes": ["Gene GLP-1"], "hypotheses": ["Upregulation of CPSF4 generates neurotransmitter dynamics analogous to GLP-1 modulation, thereby simulating conditions predisposing to suicidal ideation."]}
{"disease": "Disease asthma", "core_genes": ["Gene OIP5-AS1"], "hypotheses": ["PI4KA-driven changes in GATA1 regulation produce OIP5-AS1 expression patterns that mirror NLRP3 inflammasome-driven epithelial pyroptosis in asthma."]}
{"disease": "Disease atrial fibrillation", "core_genes": ["Gene CD25"], "hypotheses": ["Elevated CD52 on lymphocytes generates inflammatory signaling cascades that parallel those driven by CD25, contributing to the pathophysiology of atrial fibrillation."]}
{"disease": "Disease bacterial", "core_genes": ["Gene TSG-6"], "hypotheses": ["Upregulation of TNFAIP6 establishes CXCL8-dependent neutrophil recruitment patterns that simulate the inflammatory milieu of bacterial disease."]}
{"disease": "Disease breast cancer", "core_genes": ["Gene SMC1A"], "hypotheses": ["SMC1A enhances breast cancer cell proliferation and metastasis by promoting MET-mediated activation of the AKT/FOXM1 signaling pathway."]}
{"disease": "Disease bursitis", "core_genes": ["Gene CXCL10"], "hypotheses": ["EP300-mediated acetylation of CXCL10 enhances its pro-fibrotic signaling and immune cell recruitment, thereby exacerbating tissue remodeling in bursitis."]}
{"disease": "Disease ductal carcinoma in situ", "core_genes": ["Gene RPL7A"], "hypotheses": ["SUMO2-mediated SUMOylation of RPL7A enhances ribosomal biogenesis and promotes abnormal cell proliferation in ductal carcinoma in situ."]}
{"disease": "Disease ductal carcinoma in situ", "core_genes": ["Gene RPL11"], "hypotheses": ["RPL11 interacts with MYC to enhance cell cycle progression by suppressing TAF1-mediated transcriptional control in ductal carcinoma in situ."]}
{"disease": "Disease ductal carcinoma in situ", "core_genes": ["Gene RPL31"], "hypotheses": ["RPL31 upregulation in ductal carcinoma in situ selectively enhances the translation of cyclin E1 and CDK2, intensifying CDK2-cyclin E complex formation and activity, thereby driving cell cycle progression and providing a specific regulatory axis for targeted breast cancer interventions."]}
{"disease": "Disease cardiovascular disease", "core_genes": ["Gene ETV3"], "hypotheses": ["ETV3 modulates cardiovascular disease progression by interacting with UBC to regulate protein ubiquitination and subsequent inflammatory signaling in vascular tissues."]}
{"disease": "Disease cartilage", "core_genes": ["Gene CBFB"], "hypotheses": ["PPP2CA-mediated dephosphorylation of YAP1 enhances CBFB transcriptional activity, thereby promoting cartilage homeostasis and preventing osteoarthritis progression."]}
{"disease": "Disease tumorigenic", "core_genes": ["Gene TSSK6"], "hypotheses": ["TSSK6 kinase activity enhances tumor cell invasion in colorectal cancer by phosphorylating ETS1, thereby promoting focal adhesion formation."]}
{"disease": "Disease ischemic stroke", "core_genes": ["Gene RIPK3"], "hypotheses": ["MAPK1 activation enhances RIPK3-mediated necroptosis and exacerbates neuronal loss following ischemic stroke."]}
{"disease": "Disease cleft palate", "core_genes": ["Gene carbapenemase"], "hypotheses": ["FGF9 dysregulation during craniofacial development induces cleft palate by disrupting mesenchymal-epithelial signaling pathways."]}
{"disease": "Disease coloboma", "core_genes": ["Gene ntn1b"], "hypotheses": ["NTN1 modulates optic cup morphogenesis by regulating downstream effectors of MAB21L2, thereby influencing susceptibility to coloboma."]}
{"disease": "Disease coronary artery disease", "core_genes": ["Gene BAFF"], "hypotheses": ["BAFF upregulation promotes increased immunoglobulin production by B cells, thereby enhancing vascular inflammation and accelerating coronary atherosclerosis progression."]}
{"disease": "Disease cranial nerve palsies", "core_genes": ["Gene C-reactive protein"], "hypotheses": ["EXTL2 upregulation promotes anterior ischemic optic neuropathy by enhancing vascular inflammation in the context of elevated C-reactive protein in temporal arteritis."]}
{"disease": "Disease dyspnea", "core_genes": ["Gene CD38"], "hypotheses": ["CD38 engagement induces IRF1-mediated upregulation of dendritic cell cytokine production, thereby promoting immune-driven dyspnea in patients exposed to anti-CD38 therapies."]}
{"disease": "Disease intrauterine growth restriction", "core_genes": ["Gene METTL3"], "hypotheses": ["MYC enhances METTL3-mediated m6A modification of FOSL1 mRNA, thereby amplifying FOSL1-driven impairment of trophoblast proliferation and promoting intrauterine growth restriction."]}
{"disease": "Disease fibrosis", "core_genes": ["Gene GPR39"], "hypotheses": ["GPR39 upregulation promotes renal fibrosis by enhancing GSK3B-mediated activation of the NLRP3 inflammasome in response to angiotensin II signaling."]}
{"disease": "Disease fistula", "core_genes": ["Gene resistin"], "hypotheses": ["Resistin upregulates SP1-mediated transcription of MMP2 and MMP9, thereby enhancing epithelial-to-mesenchymal transition and promoting the formation of complex anal fistulas."]}
{"disease": "Disease glioma", "core_genes": ["Gene HADHA"], "hypotheses": ["HADHA enhances glioma malignancy by promoting MYC stabilization and transcriptional activity through a direct protein-protein interaction, independently of p53 degradation pathways."]}
{"disease": "Disease gout", "core_genes": ["Gene KRTCAP2"], "hypotheses": ["KRTCAP2 modulates NRF1-mediated transcriptional regulation of genes involved in urate metabolism, thereby promoting susceptibility to gout."]}
{"disease": "Disease granulomas", "core_genes": ["Gene IL-10R"], "hypotheses": ["SP1-mediated upregulation of IL-10 enhances IL-10R signaling, which suppresses IFN-γ-dependent granuloma formation in granulomatous diseases."]}
{"disease": "", "core_genes": ["Gene Galpha13", "Gene fibronectin"], "hypotheses": ["PPP2CA inhibits Gα13-mediated phosphorylation of Smad2 and Smad3, thereby suppressing TGF-β-induced fibronectin expression during myofibroblast differentiation."]}
{"disease": "", "core_genes": ["Gene Galpha13", "Gene TGF-beta"], "hypotheses": ["PPP2CA-mediated signaling in human fibroblasts restricts Gα13-driven amplification of TGF-β/Smad3 pathways, thereby limiting myofibroblast differentiation."]}
{"disease": "", "core_genes": ["Gene Galpha13", "Gene TGFBR1"], "hypotheses": ["Gα13 activity counteracts TGFBR1-mediated EIF3I recruitment, resulting in reduced Smad2/3 phosphorylation and suppression of collagen-1 expression during myofibroblast differentiation."]}
{"disease": "", "core_genes": ["Gene Galpha13", "Gene TGFBR2"], "hypotheses": ["EIF3I signaling interferes with TGFBR2-mediated Smad2/3 phosphorylation, attenuating myofibroblast differentiation during fibrosis."]}
{"disease": "", "core_genes": ["Gene corin", "Gene CoREST"], "hypotheses": ["Corin-mediated inhibition of the CoREST complex suppresses MYC-driven proliferation in malignant tumors by disrupting HDAC1-dependent chromatin remodeling."]}
{"disease": "", "core_genes": ["Gene UBE2C", "Gene CD4"], "hypotheses": ["UBE2C overexpression suppresses TNFSF4-mediated positive regulation of CD4-positive, alpha-beta T cell costimulation, thereby promoting tumor immune evasion."]}
{"disease": "", "core_genes": ["Gene PTPRT", "Gene PD-1"], "hypotheses": ["PTPRT interaction with EGFR suppresses EGFR-mediated signaling in tumor cells, thereby enhancing the efficacy of PD-1 blockade through increased antitumor immune activation."]}
{"disease": "", "core_genes": ["Gene chromogranin A", "Gene F13B"], "hypotheses": ["REST suppresses CHGA-mediated neuroinflammation by directly inhibiting CHGA expression in neuroendocrine cells."]}
{"disease": "", "core_genes": ["Gene LINC00152", "Gene FTH1"], "hypotheses": ["LINC00152 upregulation suppresses FTH1-mediated ferroptosis in peripheral blood mononuclear cells via modulation of the cAMP/PKA/CREB pathway, thereby promoting immune dysregulation in rheumatoid arthritis."]}
{"disease": "", "core_genes": ["Gene LINC00152", "Gene PDE4D"], "hypotheses": ["LINC00152-mediated stabilization of PDE4D mRNA represses cAMP/PKA/CREB signaling, which in turn upregulates MYC-driven oncogenic transcription via PDE4DIP interactions, thereby enhancing chemoresistance in breast cancer cells."]}
{"disease": "", "core_genes": ["Gene NLRP3", "Gene PPARdelta"], "hypotheses": ["Activation of PPARD suppresses NLRP3 inflammasome activity by modulating the PPP2CA-mediated signaling pathway, thereby attenuating inflammation in metabolic tissue contexts."]}
{"disease": "", "core_genes": ["Gene cGAS", "Gene ORF48"], "hypotheses": ["ORF48 inhibits the interaction between CGAS and STAT3, thereby suppressing STAT3-mediated amplification of the interferon response during KSHV lytic replication."]}
{"disease": "", "core_genes": ["Gene PARP", "Gene granzyme B"], "hypotheses": ["PARP1 inhibition enhances granzyme B-mediated apoptosis of colorectal cancer cells by disrupting PARP1-MYC protein interactions that otherwise suppress cytotoxic T lymphocyte activity."]}
{"disease": "", "core_genes": ["Gene albumin", "Gene WHAMM"], "hypotheses": ["WHAMM promotes the autophagic degradation of TGFB1 in bronchopulmonary epithelial cells, thereby suppressing epithelial-mesenchymal transition and limiting fibrotic remodeling in bronchopulmonary dysplasia."]}
{"disease": "", "core_genes": ["Gene Astn1", "Gene Astn2"], "hypotheses": ["Loss of ASTN2 function induces SPATA18-mediated mitophagy in cerebellar Purkinje cells, thereby disrupting mitochondrial homeostasis and increasing susceptibility to migraine with aura."]}
{"disease": "", "core_genes": ["Gene Bax", "Gene adropin"], "hypotheses": ["Adropin administration suppresses BAX-mediated apoptosis in fibroblasts, thereby attenuating fibrotic tissue remodeling in cancer-associated fibrosis."]}
{"disease": "", "core_genes": ["Gene BCKDK", "Gene BT2"], "hypotheses": ["SUMO1-mediated SUMOylation of BCKDK enhances BCKDK stability, thereby promoting mTOR-driven inflammation and vascular remodeling in thoracic aortic dissection."]}
{"disease": "", "core_genes": ["Gene AK7", "Gene SIRT2"], "hypotheses": ["SIRT2 inhibition promotes anti-fibrotic remodeling in COPD by enhancing AKT1-mediated suppression of TGF-β signaling in lung tissue."]}
{"disease": "", "core_genes": ["Gene caspase-3", "Gene RTEL1"], "hypotheses": ["RTEL1 knockdown represses CASP3-mediated activation of STAT3 signaling, thereby attenuating pro-tumorigenic transformation in glioblastoma cells."]}
{"disease": "", "core_genes": ["Gene caspase-3", "Gene adropin"], "hypotheses": ["Adropin suppresses caspase-3-mediated activation of the Src-STAT3 signaling pathway, thereby inhibiting glioblastoma tumor progression."]}
{"disease": "", "core_genes": ["Gene COL1A1", "Gene IL-15"], "hypotheses": ["SMAD3 activation mediates the IL-15-induced upregulation of COL1A1 expression in hepatic stellate cells during liver fibrosis."]}
{"disease": "", "core_genes": ["Gene ACBP", "Gene Lcn2"], "hypotheses": ["ACBP-mediated inhibition of autophagy in hepatocytes suppresses LCN2 secretion, thereby exacerbating hepatic steatosis through reduced MC4R signaling."]}
{"disease": "", "core_genes": ["Gene CREM", "Gene VDR"], "hypotheses": ["CREM interacts with SP1 to synergistically repress VDR transcription, thereby further suppressing cathelicidin expression and facilitating Leishmania donovani survival in host cells."]}
{"disease": "", "core_genes": ["Gene Foxq1", "Gene IL-6"], "hypotheses": ["FOXQ1 physically interacts with CDH1 to repress IL-6 secretion by inhibiting NLRP3-mediated pyroptosis in senescent epithelial cells."]}
{"disease": "", "core_genes": ["Gene Foxq1", "Gene TNF-alpha"], "hypotheses": ["FOXQ1 suppresses TNF-α–induced apoptosis in renal epithelial cells by enhancing CDH1-mediated cell-cell adhesion."]}
{"disease": "", "core_genes": ["Gene Irg1", "Gene NLRP3"], "hypotheses": ["Itaconate produced via IRG1 suppresses NLRP3-mediated macrophage pyroptosis by inhibiting PRKACA-dependent phosphorylation of NLRP3 during acute lung injury."]}
{"disease": "", "core_genes": ["Gene JAK2", "Gene TREM2"], "hypotheses": ["HMG20A interaction with TREM2 represses JAK2/STAT3-mediated proinflammatory microglial activation following cerebral ischemia."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene IL-27"], "hypotheses": ["Activation of IL27RA signaling counteracts EBNA3A-mediated suppression of IRF3-dependent IFNB1 transcription in Epstein-Barr virus-infected cells."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene IL-4"], "hypotheses": ["IL-4-mediated activation of the STAT6 pathway enhances ULK1/ATG9A/RAB9A-dependent autophagy, which suppresses EBNA3A-induced inhibition of IRF3 and restores IFNβ production in Epstein-Barr virus-infected cells."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene IL-10"], "hypotheses": ["PPP2CA modulates STAT3-dependent chromatin remodeling to enhance IL-10-mediated repression of EBNA transcription during Epstein-Barr virus infection."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene IL-15"], "hypotheses": ["EBNA-LP-mediated chromatin remodeling via YY1 and DPF2 represses IL15 expression in EBV-infected B cells, thereby diminishing immune surveillance."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene IL-21"], "hypotheses": ["IL-21 signaling via IL21R induces STAT3-dependent repression of EBNA1 expression in EBV-infected B cells, thereby enhancing IFNγ-mediated immune responses against glioblastoma."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene STAT3"], "hypotheses": ["STAT3 activation counteracts EBNA-driven MYC upregulation in EBV-infected B cells, thereby restraining inflammation and nerve hyperplasia in EBV-associated disease."]}
{"disease": "", "core_genes": ["Gene EBNA", "Gene STAT5"], "hypotheses": ["EBNA-LP and STAT5 display antagonistic regulation of YY1-mediated enhancer-promoter looping, limiting MYC expression and curbing B cell proliferation during Epstein-Barr virus infection."]}
{"disease": "", "core_genes": ["Gene DNA2", "Gene USP50"], "hypotheses": ["USP50-mediated stabilization of NLRP3 impedes DNA2-dependent DNA damage signaling under replication stress, thereby reducing inflammatory cell death in BRCA-deficient cancer cells."]}
{"disease": "", "core_genes": ["Gene peroxiredoxin", "Gene FLP-2"], "hypotheses": ["SUMO2-mediated sumoylation of PRDX2 enhances its ability to suppress abnormal bone marrow cell morphology by stabilizing PRDX2 protein under oxidative stress conditions."]}
{"disease": "", "core_genes": ["Gene FSHR-1", "Gene unc-10"], "hypotheses": ["FSHR-1 activation promotes ubiquitin-mediated proteostasis via interaction with UBC and UBB, thereby enhancing stress resilience and longevity in Caenorhabditis elegans."]}
{"disease": "", "core_genes": ["Gene FLP-2", "Gene prdx-2"], "hypotheses": ["SUMO2-mediated post-translational modification of PRDX2 modulates neuropeptide signaling to suppress intestinal digestion in response to neuronal oxidative stress in C. elegans."]}
{"disease": "", "core_genes": ["Gene PDGFRbeta", "Gene IL-33"], "hypotheses": ["Inhibition of PDGFRβ-driven STAT1 activation enhances IL-33-mediated recruitment of RELA-expressing immune cells, thereby promoting beige adipocyte formation and improving metabolic function in aged adipose tissue."]}
{"disease": "", "core_genes": ["Gene UBR1", "Gene NEDD4L"], "hypotheses": ["UBR1-mediated monoubiquitylation of YAP1 enhances GSK3B-driven proliferation signaling in anaplastic thyroid carcinoma cells."]}
{"disease": "", "core_genes": ["Gene UBR1", "Gene ACE2"], "hypotheses": ["GSK3B activation enhances UBR1-mediated ubiquitination and degradation of ACE2, thereby exacerbating hypertension in the presence of elevated angiotensin II and testosterone."]}
{"disease": "", "core_genes": ["Gene Sim2", "Gene VDAC1"], "hypotheses": ["SIM2 overexpression enhances endometrial carcinoma progression by recruiting HSP90AB1, thereby stabilizing Cyclin D1 and promoting cell cycle progression."]}
{"disease": "", "core_genes": ["Gene alpha-synuclein", "Gene proSAAS"], "hypotheses": ["GSK3B activation enhances alpha-synuclein aggregation and exacerbates neuroinflammation in dopaminergic neurons, accelerating neurodegeneration in Parkinson’s disease."]}
{"disease": "", "core_genes": ["Gene Akt", "Gene NMI"], "hypotheses": ["NMI deficiency enhances MYC-mediated activation of AKT1, thereby promoting endometrial stromal cell proliferation and progression of endometriosis."]}
{"disease": "", "core_genes": ["Gene IRE1", "Gene PSAT1"], "hypotheses": ["PSAT1 upregulation enhances collagen synthesis in intestinal tissue, which indirectly suppresses IRE1-mediated IL-22 production by promoting a fibrotic microenvironment that impairs group 3 innate lymphoid cell function in colitis."]}
{"disease": "", "core_genes": ["Gene IRE1", "Gene SHMT1"], "hypotheses": ["SUMOylation of SHMT1 interferes with IRE1-driven pathways, thereby constraining serine metabolism and limiting ILC3 proliferation during ERN1-mediated intestinal inflammation."]}
{"disease": "", "core_genes": ["Gene ERbeta", "Gene NMI"], "hypotheses": ["ERβ/HDAC8-mediated repression of NMI antagonizes STAT2-dependent interferon signaling, thereby counteracting AKT1-driven proliferation and extracellular matrix remodeling in endometriotic lesions."]}
{"disease": "", "core_genes": ["Gene FBP1", "Gene TERT"], "hypotheses": ["FBP1 interaction with TERF1 antagonizes TERT-mediated telomerase activation, thereby restraining cellular senescence and inhibiting hepatocellular carcinoma cell proliferation."]}
{"disease": "", "core_genes": ["Gene TP53", "Gene CDK12"], "hypotheses": ["Loss of CDK12 limits TP53-dependent senescence by impeding FOXA1-mediated transcriptional regulation of DNA repair genes in response to genotoxic stress in cancer cells."]}
{"disease": "", "core_genes": ["Gene CD16", "Gene KRT17"], "hypotheses": ["MYH9-mediated stabilization of CD16 surface expression on NK cells is diminished by KRT17 activity, thereby restricting antibody-dependent cellular cytotoxicity."]}
{"disease": "", "core_genes": ["Gene YAP", "Gene GPX4"], "hypotheses": ["SUMO1-mediated SUMOylation of YAP1 enhances YAP1-induced GPX4 expression, thereby suppressing ferroptosis in oxidative stress-associated tissue injury."]}
{"disease": "", "core_genes": ["Gene CEBPD", "Gene PD-L1"], "hypotheses": ["GSK3B inhibition enhances CEBPD-mediated upregulation of VAMP3-dependent autophagy, thereby increasing extracellular PD-L1 release and promoting immune evasion in triple-negative breast cancer cells."]}
{"disease": "", "core_genes": ["Gene BATF", "Gene PD-L1"], "hypotheses": ["BATF interaction with FOS enhances PD-L1-mediated immunosuppression, thereby promoting immune evasion and tumor progression in bone cancer."]}
{"disease": "", "core_genes": ["Gene IGF2BP3", "Gene fibronectin"], "hypotheses": ["IGF2BP3 enhances fibronectin-driven extracellular matrix remodeling in oral squamous cell carcinoma by stabilizing transcripts regulated through its interaction with MEOX2."]}
{"disease": "", "core_genes": ["Gene FtsH", "Gene Akt"], "hypotheses": ["ZDHHC17-mediated palmitoylation of AKT1 enhances its ability to phosphorylate TRPML1, thereby promoting ferroptosis resistance and facilitating hepatocellular carcinoma progression in the context of metabolic stress."]}
{"disease": "", "core_genes": ["Gene FtsH", "Gene p70S6K"], "hypotheses": ["MYC activation enhances p70S6K-mediated protein synthesis and promotes cancer stemness in glioblastoma through direct protein-protein interaction with RPS6KB1."]}
{"disease": "", "core_genes": ["Gene PGC-1alpha", "Gene ASCL1"], "hypotheses": ["PGC-1α interacts with EP300 to enhance ASCL1 expression and promote mitochondrial metabolic reprogramming, thereby accelerating neuroendocrine lineage commitment and tumor aggressiveness in small cell neuroendocrine cancers."]}
{"disease": "", "core_genes": ["Gene Fdps", "Gene TEAD1"], "hypotheses": ["TEAD1 interaction with EP300 enhances FDPS-mediated cholesterol biosynthesis in Schwann cells, thereby promoting efficient remyelination following peripheral nerve injury."]}
{"disease": "", "core_genes": ["Gene NRG1", "Gene YAP"], "hypotheses": ["CTCF enhances NRG1-mediated YAP nuclear translocation in cardiomyocytes, thereby amplifying resistance to doxorubicin-induced senescence."]}
{"disease": "", "core_genes": ["Gene LINC00152", "Gene ANLN"], "hypotheses": ["LINC00152 enhances ANLN-mediated upregulation of PD-L1 expression in cancer cells by stabilizing PDE4D mRNA and activating cAMP/PKA/CREB signaling, thereby promoting immune evasion."]}
{"disease": "", "core_genes": ["Gene LINC00152", "Gene RRM2"], "hypotheses": ["LINC00152 enhances RRM2-mediated resistance to ferroptosis in cancer cells by activating the cAMP/PKA/CREB1 signaling axis."]}
{"disease": "", "core_genes": ["Gene LINC00152", "Gene TRPC1"], "hypotheses": ["LINC00152 upregulates TRPC1-mediated calcium influx by enhancing ELAVL1–TRPC1 protein interactions, thereby promoting chemoresistance in pancreatic cancer cells."]}
{"disease": "", "core_genes": ["Gene C5aR", "Gene Akt"], "hypotheses": ["C5aR1 activation suppresses PPP2CA-mediated dephosphorylation of AKT1, thereby enhancing AKT1-dependent cell survival signaling during inflammatory stress."]}
{"disease": "", "core_genes": ["Gene NLRP3", "Gene CXCL10"], "hypotheses": ["PPP2CA activation suppresses NLRP3-mediated upregulation of CXCL10, thereby reducing T cell infiltration and inflammatory pathology in disease states."]}
{"disease": "", "core_genes": ["Gene MIR155HG", "Gene PD-L1"], "hypotheses": ["EGR1 enhances HIF-1α-mediated upregulation of MIR155HG, thereby amplifying PD-L1 expression and immune evasion in hepatocellular carcinoma under hypoxic conditions."]}
{"disease": "", "core_genes": ["Gene ADAM10", "Gene BDNF"], "hypotheses": ["PPP2CA activation enhances ADAM10-mediated non-amyloidogenic APP processing, thereby reducing amyloid-β accumulation in Alzheimer’s disease models."]}
{"disease": "", "core_genes": ["Gene atrogin-1", "Gene PI3K"], "hypotheses": ["FOXA1 directly regulates FBXO32 expression and thereby modulates muscle atrophy downstream of PI3K/AKT signaling."]}
{"disease": "", "core_genes": ["Gene cGAS", "Gene OMA1"], "hypotheses": ["Interaction between OMA1 and BZW2 enhances OMA1-driven mitophagy, thereby amplifying cGAS-STING-mediated PD-L1 upregulation and facilitating immune evasion in glioblastoma cells."]}
{"disease": "", "core_genes": ["Gene OMA1", "Gene STING"], "hypotheses": ["OMA1 interaction with SLC15A1 augments mitophagy-driven cGAS-STING pathway activation, thereby increasing PD-L1 expression and promoting immune evasion in glioblastoma."]}
{"disease": "", "core_genes": ["Gene AEBP1", "Gene PI3K"], "hypotheses": ["AEBP1 enhances GRB2-mediated activation of PI3K/AKT signaling to promote osteogenic differentiation in dexamethasone-treated osteoblastic cells."]}
{"disease": "", "core_genes": ["Gene PACAP", "Gene VGAT"], "hypotheses": ["REST represses ADCYAP1 transcription in PACAP/VGAT co-expressing periaqueductal gray neurons, thereby modulating inhibitory control over defensive behaviors."]}
{"disease": "", "core_genes": ["Gene Atg5", "Gene PI3K"], "hypotheses": ["ATG5 physically interacts with CAV1 to modulate autophagic flux, thereby enhancing TGF-β1-induced epithelial-to-mesenchymal transition through activation of SMAD2/3 signaling."]}
{"disease": "", "core_genes": ["Gene CCR5", "Gene G-CSF"], "hypotheses": ["CEBPB enhances CCR5-mediated activation of the NF-κB signaling pathway, thereby amplifying pro-inflammatory leukocyte infiltration in chronic inflammatory diseases."]}
{"disease": "", "core_genes": ["Gene CCR7", "Gene TRAC"], "hypotheses": ["Interaction between CCR7 and CD247 modulates T cell migration and localization within tumor-draining lymph nodes, thereby enhancing antigen-specific immune responses in the tumor microenvironment."]}
{"disease": "", "core_genes": ["Gene CBFbeta", "Gene YAP"], "hypotheses": ["CBFβ promotes articular cartilage homeostasis by enhancing YAP1-mediated transcriptional activation of extracellular matrix genes in chondrocytes."]}
{"disease": "", "core_genes": ["Gene N-cadherin", "Gene YAP"], "hypotheses": ["SUMO1-mediated SUMOylation of YAP1 enhances YAP1-driven EGR1 transcriptional activation, thereby promoting EMT and metastasis in ovarian cancer cells."]}
{"disease": "", "core_genes": ["Gene SWSAP1", "Gene RPA"], "hypotheses": ["SP1 modulates the transcriptional activation of SWSAP1, thereby enhancing RAD51 filament stability and promoting efficient homologous recombination during replication stress."]}
{"disease": "", "core_genes": ["Gene CPEB", "Gene PLK1"], "hypotheses": ["PLK1-mediated phosphorylation of MIS18BP1 enhances CENP-A deposition, thereby promoting chromosomal stability and suppressing genomic instability in colorectal cancer cells."]}
{"disease": "", "core_genes": ["Gene CLP", "Gene TNF-alpha"], "hypotheses": ["EGR1 upregulation enhances TNF-α expression in macrophages during the acute phase of sepsis, but its sustained activation impairs endotoxin tolerance by suppressing PD-L1 and IL-10 induction."]}
{"disease": "", "core_genes": ["Gene A2AR", "Gene CD38"], "hypotheses": ["SPI1 upregulation enhances CD38 expression in tumor cells, thereby increasing adenosine-mediated A2AR activation and promoting immune evasion and metastatic potential."]}
{"disease": "", "core_genes": ["Gene CPT1A", "Gene TRIM2"], "hypotheses": ["SUMO2-mediated sumoylation of CPT1A enhances its interaction with TRIM2, thereby promoting cancer cell survival under metabolic stress."]}
{"disease": "", "core_genes": ["Gene CREB", "Gene MASP"], "hypotheses": ["CREB1 interaction with GSK3B suppresses endothelial senescence by regulating CREB-mediated transcriptional programs during vascular aging."]}
{"disease": "", "core_genes": ["Gene FUNDC1", "Gene FBXL2"], "hypotheses": ["FBXL2 interaction with HSP90AB1 modulates the stability of FUNDC1, thereby regulating mitochondrial quality control and suppressing inflammatory cytokine production in asthmatic epithelial cells."]}
{"disease": "", "core_genes": ["Gene p38", "Gene granzyme B"], "hypotheses": ["MAPK14 (p38) activation enhances granzyme B-mediated cytotoxicity in dermatomyositis, thereby promoting limb dysmetria through increased muscle tissue injury."]}
{"disease": "", "core_genes": ["Gene beta-catenin", "Gene NSUN5"], "hypotheses": ["NSUN5 promotes immune evasion in hepatocellular carcinoma by enhancing WNT3A-mediated activation of the β-catenin pathway, thereby reducing CD8+ T cell infiltration."]}
{"disease": "", "core_genes": ["Gene beta-catenin", "Gene USP10"], "hypotheses": ["USP10 enhances cancer cell proliferation and stemness by stabilizing β-catenin and promoting ANXA2-mediated activation of Wnt/β-catenin signaling in APC-deficient tumors."]}
{"disease": "", "core_genes": ["Gene cathepsin K", "Gene RUFY4"], "hypotheses": ["MAPK14 activation enhances LAMP2-mediated lysosomal fusion, thereby promoting RUFY4-dependent cathepsin K secretion and increasing osteoclast-driven bone resorption."]}
{"disease": "", "core_genes": ["Gene FOXA1", "Gene RARgamma"], "hypotheses": ["RARγ-mediated induction of FOXA1 suppresses MYC-driven transcriptional programs to maintain prostate epithelial differentiation and prevent tumorigenesis."]}
{"disease": "", "core_genes": ["Gene IFN-beta", "Gene S100A14"], "hypotheses": ["S100A14 modulates STAT3 signaling in immune cells, thereby altering IFN-β–mediated suppression of neuroinflammation in multiple sclerosis."]}
{"disease": "", "core_genes": ["Gene PPTC7", "Gene BNIP3L"], "hypotheses": ["PPTC7 cooperates with BNIP3L to promote mitophagy, thereby restraining papillary renal cell carcinoma progression through enhanced BNIP3L protein stability in tumor cells."]}
{"disease": "", "core_genes": ["Gene IL-13", "Gene Y1R"], "hypotheses": ["PPP2CA facilitates coordinated signaling between IL-13 and NPY1R pathways, jointly regulating neuroimmune-mediated cardiac excitability."]}
{"disease": "", "core_genes": ["Gene CD25", "Gene CD226"], "hypotheses": ["PRKCA activation synergizes with CD226 to potentiate effector T cell responses, amplifying immune activation while attenuating FOXP3-dependent Treg suppression."]}
{"disease": "", "core_genes": ["Gene Irg1", "Gene TLR7"], "hypotheses": ["Irg1-derived itaconate and TLR7 signaling jointly enhance GPX4 activity in macrophages, collaboratively reducing proinflammatory cytokine production and mitigating systemic lupus erythematosus progression."]}
{"disease": "", "core_genes": ["Gene TF", "Gene YY1"], "hypotheses": ["YY1 and GTF3C1 coordinate transcriptional repression, collectively suppressing melanoma cell proliferation."]}
{"disease": "", "core_genes": ["Gene AP-1", "Gene LRP1"], "hypotheses": ["AP-1-mediated chromatin remodeling enhances the expression of KAT5, which in turn promotes LRP1-dependent breast cancer metastasis."]}
{"disease": "", "core_genes": ["Gene DDX3X", "Gene PD-L1"], "hypotheses": ["DDX3X promotes PD-L1-mediated immune suppression in cancer by interacting with and enhancing the transcriptional activity of SP1 on the CD274 promoter."]}
{"disease": "", "core_genes": ["Gene OPA1", "Gene SIRT3"], "hypotheses": ["SIRT3-mediated deacetylation of OPA1 enhances NRF1-OPA1 protein interactions, thereby promoting mitochondrial fusion and mitigating oxidative stress in models of presbycusis."]}
{"disease": "", "core_genes": ["Gene MEG3", "Gene METTL3"], "hypotheses": ["MEG3 upregulation represses METTL3-mediated m6A methylation of MYC, thereby inhibiting MYC-driven proliferation in bone cancer cells."]}
{"disease": "", "core_genes": ["Gene tba-1", "Gene EFA-6"], "hypotheses": ["Loss of efa-6 function enhances microtubule bundle formation mediated by tba-1, thereby promoting establishment or maintenance of microtubule cytoskeleton polarity in Caenorhabditis elegans."]}
{"disease": "", "core_genes": ["Gene LMP2A", "Gene WAPL"], "hypotheses": ["AURKA-mediated phosphorylation of WAPL represses LMP2A expression and thereby inhibits the progression of Epstein-Barr virus-associated gastric carcinoma."]}
